{
    "kategori": "Kitab Barang Temuan",
  "hadits": [
    {
                "number": 1450,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا شُعْبَةُ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ سُوَيْدِ بْنِ غَفَلَةَ قَالَغَزَوْتُ مَعَ زَيْدِ بْنِ صُوحَانَ وَسَلْمَانَ بْنِ رَبِيعَةَ فَوَجَدْتُ سَوْطًا فَقَالَا لِيَ اطْرَحْهُ فَقُلْتُ لَا وَلَكِنْ إِنْ وَجَدْتُ صَاحِبَهُ وَإِلَّا اسْتَمْتَعْتُ بِهِ فَحَجَجْتُ فَمَرَرْتُ عَلَى الْمَدِينَةِ فَسَأَلْتُ أُبَيَّ بْنَ كَعْبٍ فَقَالَ وَجَدْتُ صُرَّةً فِيهَا مِائَةُ دِينَارٍ فَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ عَرِّفْهَا حَوْلًا فَعَرَّفْتُهَا حَوْلًا ثُمَّ أَتَيْتُهُ فَقَالَ عَرِّفْهَا حَوْلًا فَعَرَّفْتُهَا حَوْلًا ثُمَّ أَتَيْتُهُ فَقَالَ عَرِّفْهَا حَوْلًا فَعَرَّفْتُهَا حَوْلًا ثُمَّ أَتَيْتُهُ فَقُلْتُ لَمْ أَجِدْ مَنْ يَعْرِفُهَا فَقَالَ احْفَظْ عَدَدَهَا وَوِكَاءَهَا وَوِعَاءَهَا فَإِنْ جَاءَ صَاحِبُهَا وَإِلَّا فَاسْتَمْتِعْ بِهَا وَقَالَ وَلَا أَدْرِي أَثَلَاثًا قَالَ عَرِّفْهَا أَوْ مَرَّةً وَاحِدَةًحَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ شُعْبَةَ بِمَعْنَاهُ قَالَ عَرِّفْهَا حَوْلًا وَقَالَ ثَلَاثَ مِرَارٍ قَالَ فَلَا أَدْرِي قَالَ لَهُ ذَلِكَ فِي سَنَةٍ أَوْ فِي ثَلَاثِ سِنِينَ حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ حَدَّثَنَا حَمَّادٌ حَدَّثَنَا سَلَمَةُ بْنُ كُهَيْلٍ بِإِسْنَادِهِ وَمَعْنَاهُ قَالَ فِي التَّعْرِيفِ قَالَ عَامَيْنِ أَوْ ثَلَاثَةً وَقَالَ اعْرِفْ عَدَدَهَا وَوِعَاءَهَا وَوِكَاءَهَا زَادَ فَإِنْ جَاءَ صَاحِبُهَا فَعَرَفَ عَدَدَهَا وَوِكَاءَهَا فَادْفَعْهَا إِلَيْهِ قَالَ أَبُو دَاوُد لَيْسَ يَقُولُ هَذِهِ الْكَلِمَةَ إِلَّا حَمَّادٌ فِي هَذَا الْحَدِيثِ يَعْنِي فَعَرَفَ عَدَدَهَا",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Katsir], telah mengabarkan kepada Kami [Syu'bah] dari [Salamah bin Kuhail] dari [Suwaid bin Ghafalah], ia berkata; aku pernah berperang bersama Zaid bin Shuhan, serta Salman bin Rabi'ah, kemudian aku mendapatkan sebuah cambuk. Kemudian mereka berkata kepadaku; letakkan cambuk itu! Maka aku katakan; tidak, akan tetapi apabila aku mendapatkan pemiliknya maka akan aku berikan kepadanya, jika tidak maka aku akan menikmatinya. Kemudian aku melakukan haji dan melewati Madinah, kemudian aku bertanya kepada [Ubai bin Ka'b], kemudian ia berkata; aku pernah mendapatkan sebuah kantong yang berisi uang seratus dinar. Kemudian aku datang kepada Nabi shallallahu 'alaihi wasallam dan beliau berkata: \"Umumkan selama satu tahun.\" Lalu aku mengumumkannya selama satu tahun, kemudian aku datang kepada beliau, dan beliau berkata: \"Umumkan selama satu tahun.\" Lalu aku umumkan selama satu tahun. Kemudian aku datang kepada beliau dan beliau bersabda: \"Umumkan selama satu tahun.\" Lalu aku mengumumkannya selama satu tahun. Kemudian aku berkata; aku tidak mendapatkan orang yang mengakuinya. Lalu beliau bersabda: \"Simpanlah jumlahnya isinya dan kantong dan talinya. Jika datang pemiliknya maka serahkan dan jika tidak maka manfaatkanlah.\" Dia berkata; saya tidak tahu apakah mengatakannya tiga kali atau umumkanlah sekali saja. Telah menceritakan kepada Kami [Musaddad], telah menceritakan kepada Kami [Yahya], dari [Syu'bah] semakna. Yaitu; \"Umumkanlah satu tahun\" dan dikatakan tiga kali, dan saya tidak mengetahuinya apakah itu dikatakan dalam satu tahun atau dalam tiga tahun. Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] telah menceritakan kepada kami [Salamah bin Kuhail] dengan sanadnya. Hammad menambahkan: \"Apabila pemiliknya telah datang dan mengetahui jumlahnya, serta talinya maka serahkan kepadanya.\" Abu Daud berkata; tidak ada yang mengatakan kalimat ini kecuali Hammad dalam hadits ini, yaitu kata \"dan mengetahui jumlahnya.\""
            },
            {
                "number": 1451,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ جَعْفَرٍ عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ عَنْ يَزِيدَ مَوْلَى الْمُنْبَعِثِ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّأَنَّ رَجُلًا سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ اللُّقَطَةِ قَالَ عَرِّفْهَا سَنَةً ثُمَّ اعْرِفْ وِكَاءَهَا وَعِفَاصَهَا ثُمَّ اسْتَنْفِقْ بِهَا فَإِنْ جَاءَ رَبُّهَا فَأَدِّهَا إِلَيْهِ فَقَالَ يَا رَسُولَ اللَّهِ فَضَالَّةُ الْغَنَمِ فَقَالَ خُذْهَا فَإِنَّمَا هِيَ لَكَ أَوْ لِأَخِيكَ أَوْ لِلذِّئْبِ قَالَ يَا رَسُولَ اللَّهِ فَضَالَّةُ الْإِبِلِ فَغَضِبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى احْمَرَّتْ وَجْنَتَاهُ أَوْ احْمَرَّ وَجْهُهُ وَقَالَ مَا لَكَ وَلَهَا مَعَهَا حِذَاؤُهَا وَسِقَاؤُهَا حَتَّى يَأْتِيَهَا رَبُّهَاحَدَّثَنَا ابْنُ السَّرْحِ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي مَالِكٌ بِإِسْنَادِهِ وَمَعْنَاهُ زَادَ سِقَاؤُهَا تَرِدُ الْمَاءَ وَتَأْكُلُ الشَّجَرَ وَلَمْ يَقُلْ خُذْهَا فِي ضَالَّةِ الشَّاءِ وَقَالَ فِي اللُّقَطَةِ عَرِّفْهَا سَنَةً فَإِنْ جَاءَ صَاحِبُهَا وَإِلَّا فَشَأْنُكَ بِهَا وَلَمْ يَذْكُرْ اسْتَنْفِقْ قَالَ أَبُو دَاوُد رَوَاهُ الثَّوْرِيُّ وَسُلَيْمَانُ بْنُ بِلَالٍ وَحَمَّادُ بْنُ سَلَمَةَ عَنْ رَبِيعَةَ مِثْلَهُ لَمْ يَقُولُوا خُذْهَا",
                "id": "Telah menceritakan kepada Kami [Qutaibah bin Sa'id], telah menceritakan kepada Kami [Isma'il bin Ja'far], dari [Rabi'ah bin Abu Abdurrahman], dari [Yazid] mantan budak Al Munba'its, dari [Zaid bin Khalid Al Juhani], bahwa seorang laki-laki bertanya kepada Rasulullah shallAllahu wa'alaihi wa sallam mengenai barang temuan, beliau berkata: \"Umumkan satu tahun, kemudian ketahuilah talinya dan kantongnya kemudian nafkahkan kepada dirimu. Apabila pemiliknya datang maka berikan kepadanya.\" Lalu orang tersebut berkata; wahai Rasulullah, bagaimana dengan kambing yang tersesat? Beliau bersabda: \"Ambillah kambing tersebut, sesungguhnya kambing tersebut adalah milikmu atau saudaramu atau milik serigala.\" Ia berkata; wahai Rasulullah, bagaiamana dengan unta yang tersesat? Kemudian Rasulullah shallAllahu wa'alaihi wa sallam marah hingga kedua pipinya atau wajahnya memerah. Beliau berkata: \"Apa urusanmu dengannya? Ia memiliki sepatu, dan kantong air minum hingga pemiliknya mendapatkannya.\" Telah menceritakan kepada Kami [Ibnu As Sarh], telah menceritakan kepada Kami [Ibnu Wahb], telah mengabarkan kepadaku [Malik] dengan sanad dan maknanya. Ibnu Wahb menambahkan; kantong air minum, unta tersebut minum air dan memakan pohon. Dan beliau tidak mengatakan: \"Ambillah kambing yang hilang.\" Dan beliau berkata mengenai barang temuan: \"Umumkan selama satu tahun, apabila pemiliknya telah datang maka berikan kepadanya, jika tidak maka urusanmu dengannya.\" Dan beliau tidak menyebutkan nafkahkan kepada dirimu. Abu Daud berkata; [Ats Tsauri] dan [Sulaiman bin Bilal] serta [Hammad bin Salamah] dari [Rabi'ah] seperti itu seperti itu, mereka tidak menyebutkan; \"ambillah barang temuan tersebut.\""
            },
            {
                "number": 1452,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ وَهَارُونُ بْنُ عَبْدِ اللَّهِ الْمَعْنَى قَالَا حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ عَنْ الضَّحَّاكِ يَعْنِي ابْنَ عُثْمَانَ عَنْ سَالِمٍ أَبِي النَّضْرِ عَنْ بُسْرِ بْنِ سَعِيدٍ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنْ اللُّقَطَةِ فَقَالَ عَرِّفْهَا سَنَةً فَإِنْ جَاءَ بَاغِيهَا فَأَدِّهَا إِلَيْهِ وَإِلَّا فَاعْرِفْ عِفَاصَهَا وَوِكَاءَهَا ثُمَّ كُلْهَا فَإِنْ جَاءَ بَاغِيهَا فَأَدِّهَا إِلَيْهِ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Rafi'], dan [Harun bin Abdullah] secara makna, mereka berkata; telah menceritakan kepada Kami [Ibnu Abu Fudaik] dari [Adh Dhahhak yaitu Ibnu Utsman] dari [Salim Abu An Nadhr] dari [Busr bin Sa'id] dari [Zaid bin Khalid Al Juhani] bahwa Rasulullah shallAllahu wa'alaihi wa sallam ditanya mengenai barang temuan. Kemudian beliau berkata: \"Umumkan selama satu tahun, kemudian apabila orang yang mencarinya telah datang maka berikan kepadanya, jika tidak maka katahuilah kantongnya dan talinya kemudian makanlah, kemudian apabila orang yang mencarinya telah datang maka kembalikan kepadanya.\""
            },
            {
                "number": 1453,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَفْصٍ حَدَّثَنِي أَبِي حَدَّثَنِي إِبْرَاهِيمُ بْنُ طَهْمَانَ عَنْ عَبَّادِ بْنِ إِسْحَقَ عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ عَنْ أَبِيهِ يَزِيدَ مَوْلَى الْمُنْبَعِثِ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ أَنَّهُ قَالَ سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ نَحْوَ حَدِيثِ رَبِيعَةَقَالَ وَسُئِلَ عَنْ اللُّقَطَةِ فَقَالَ تُعَرِّفُهَا حَوْلًا فَإِنْ جَاءَ صَاحِبُهَا دَفَعْتَهَا إِلَيْهِ وَإِلَّا عَرَفْتَ وِكَاءَهَا وَعِفَاصَهَا ثُمَّ أَفِضْهَا فِي مَالِكَ فَإِنْ جَاءَ صَاحِبُهَا فَادْفَعْهَا إِلَيْهِحَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ عَنْ حَمَّادِ بْنِ سَلَمَةَ عَنْ يَحْيَى بْنِ سَعِيدٍ وَرَبِيعَةَ بِإِسْنَادِ قُتَيْبَةَ وَمَعْنَاهُ وَزَادَ فِيهِ فَإِنْ جَاءَ بَاغِيهَا فَعَرَفَ عِفَاصَهَا وَعَدَدَهَا فَادْفَعْهَا إِلَيْهِ و قَالَ حَمَّادٌ أَيْضًا عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ قَالَ أَبُو دَاوُد وَهَذِهِ الزِّيَادَةُ الَّتِي زَادَ حَمَّادُ بْنُ سَلَمَةَ فِي حَدِيثِ سَلَمَةَ بْنِ كُهَيْلٍ وَيَحْيَى بْنِ سَعِيدٍ وَعُبَيْدِ اللَّهِ بْنِ عُمَرَ وَرَبِيعَةَ إِنْ جَاءَ صَاحِبُهَا فَعَرَفَ عِفَاصَهَا وَوِكَاءَهَا فَادْفَعْهَا إِلَيْهِ لَيْسَتْ بِمَحْفُوظَةٍ فَعَرَفَ عِفَاصَهَا وَوِكَاءَهَا وَحَدِيثُ عُقْبَةَ بْنِ سُوَيْدٍ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيْضًا قَالَ عَرِّفْهَا سَنَةً وَحَدِيثُ عُمَرَ بْنِ الْخَطَّابِ أَيْضًا عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ عَرِّفْهَا سَنَةً",
                "id": "Telah menceritakan kepada Kami [Ahmad bin Hafsh], telah menceritakan kepadaku [ayahku], telah menceritakan kepadaku [Ibrahim bin Thahman], dari ['Abbad bin Ishaq] dari [Abdullah bin Yazid] dari [ayahnya yaitu Yazid] mantan budak Al Munba'its dari [Zaid bin Khalid Al Juhani] bahwa ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam ditanya ….. kemudian ia menyebutkan seperti hadits Rabi'ah. Ia berkata; dan beliau ditanya mengenai barang temuan, lalu beliau mengatakan: \"Engkau umumkan selama satu tahun, kemudian apabila pemiliknya telah datang maka engkau serahkan kepadanya, jika tidak engkau ketahui talinya dan kantongnya, kemudian masukkan ke dalam hartamu, kemudian apabila pemiliknya datang maka serahkan kepadanya.\" Telah menceritakan kepada Kami [Musa bin Isma'il] dari [Hammad bin Salamah] dari [Yahya bin Sa'id] serta [Rabi'ah] dengan sanad Qutaibah, dan maknanya. Dan ia tambahkan dalam hadits tersebut: \"Kemudian apabila orang yang mencarinya telah datang dan mengetahui isinya dan jumlahnya maka serahkan kepadanya.\" [Hammad] juga mengatakan dari ['Ubaidullah bin Umar] dari ['Amr bin Syuiab] dari [ayahnya] dari [kakeknya] dari Nabi shallallahu 'alaihi wasallam seperti itu. Abu Daud berkata; dan tambahan yang disebutkan Hammad bin Salamah dalam hadits Salamah Kuhail, Yahya bin Sa'id serta 'Ubaidullah bin Umar dan Rabi'ah: \"Apabila pemiliknya telah datang dan mengetahui kantong serta talinya maka serahkan kepadanya\" bukanlah kalimat yang mahfuzh yaitu: \"dan mengetahui kandong dan talinya…\", sedangkan hadits Uqbah bin Suwaid dari ayahnya dari Nabi juga beliau bersabda: \"Umumkan selama satu tahun.\" Sedangkan hadits Umar bin Al Khathab juga dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Umumkan selama satu tahun.\""
            },
            {
                "number": 1454,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا خَالِدٌ يَعْنِي الطَّحَّانَ ح و حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ حَدَّثَنَا وُهَيْبٌ الْمَعْنَى عَنْ خَالِدٍ الْحَذَّاءِ عَنْ أَبِي الْعَلَاءِ عَنْ مُطَرِّفٍ يَعْنِي ابْنَ عَبْدِ اللَّهِ عَنْ عِيَاضِ بْنِ حِمَارٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ وَجَدَ لُقَطَةً فَلْيُشْهِدْ ذَا عَدْلٍ أَوْ ذَوِي عَدْلٍ وَلَا يَكْتُمْ وَلَا يُغَيِّبْ فَإِنْ وَجَدَ صَاحِبَهَا فَلْيَرُدَّهَا عَلَيْهِ وَإِلَّا فَهُوَ مَالُ اللَّهِ عَزَّ وَجَلَّ يُؤْتِيهِ مَنْ يَشَاءُ",
                "id": "Telah menceritakan kepada Kami [Musaddad], telah menceritakan kepada Kami [Khalid yaitu Ath Thahhan], dan telah diriwayatkan dari jalu yang lain: Telah menceritakan kepada Kami [Musa bin Isma'il], telah menceritakan kepada Kami [Wuhaib] secara makna, dari [Khalid Al Hadzdza`] dari [Abu Al 'Ala`] dari [Mutharrif yaitu Ibnu Abdullah] dari ['Iyadh bin Himar], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Barang siapa yang mendapatkan barang temuan, maka hendaknya ia memperlihatkan kepada orang yang adil dan tidak menyembunyikannya, kemudian apabila pemiliknya telah datang maka hendaknya ia mengembalikannya kepadanya. Jika tidak maka itu adalah harta Allah 'azza wajalla yang diberikan kepada orang yang Dia kehendaki.\""
            },
            {
                "number": 1455,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ عَجْلَانَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ سُئِلَ عَنْ الثَّمَرِ الْمُعَلَّقِ فَقَالَ مَنْ أَصَابَ بِفِيهِ مِنْ ذِي حَاجَةٍ غَيْرَ مُتَّخِذٍ خُبْنَةً فَلَا شَيْءَ عَلَيْهِ وَمَنْ خَرَجَ بِشَيْءٍ مِنْهُ فَعَلَيْهِ غَرَامَةُ مِثْلَيْهِ وَالْعُقُوبَةُ وَمَنْ سَرَقَ مِنْهُ شَيْئًا بَعْدَ أَنْ يُؤْوِيَهُ الْجَرِينُ فَبَلَغَ ثَمَنَ الْمِجَنِّ فَعَلَيْهِ الْقَطْعُ وَذَكَرَ فِي ضَالَّةِ الْإِبِلِ وَالْغَنَمِ كَمَا ذَكَرَهُ غَيْرُهُ قَالَ وَسُئِلَ عَنْ اللُّقَطَةِ فَقَالَ مَا كَانَ مِنْهَا فِي طَرِيقِ الْمِيتَاءِ أَوْ الْقَرْيَةِ الْجَامِعَةِ فَعَرِّفْهَا سَنَةً فَإِنْ جَاءَ طَالِبُهَا فَادْفَعْهَا إِلَيْهِ وَإِنْ لَمْ يَأْتِ فَهِيَ لَكَ وَمَا كَانَ فِي الْخَرَابِ يَعْنِي فَفِيهَا وَفِي الرِّكَازِ الْخُمُسُ حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ الْوَلِيدِ يَعْنِي ابْنَ كَثِيرٍ حَدَّثَنِي عَمْرُو بْنُ شُعَيْبٍ بِإِسْنَادِهِ بِهَذَا قَالَ فِي ضَالَّةِ الشَّاءِ قَالَ فَاجْمَعْهَا حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ الْأَخْنَسِ عَنْ عَمْرِو بْنِ شُعَيْبٍ بِهَذَا بِإِسْنَادِهِ قَالَ فِي ضَالَّةِ الْغَنَمِ لَكَ أَوْ لِأَخِيكَ أَوْ لِلذِّئْبِ خُذْهَا قَطُّ وَكَذَا قَالَ فِيهِ أَيُّوبُ وَيَعْقُوبُ بْنُ عَطَاءٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَخُذْهَا حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ حَدَّثَنَا حَمَّادٌ ح و حَدَّثَنَا ابْنُ الْعَلَاءِ حَدَّثَنَا ابْنُ إِدْرِيسَ عَنْ ابْنِ إِسْحَقَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا قَالَ فِي ضَالَّةِ الشَّاءِ فَاجْمَعْهَا حَتَّى يَأْتِيَهَا بَاغِيهَا",
                "id": "Telah menceritakan kepada Kami Qutaibah bin Sa'id, telah menceritakan kepada Kami Al Laits dari Ibnu 'Ajlan dari 'Amr bin Syu'aib dari ayahnya dari kakeknya yaitu Abdullah bin 'Amr bin Al 'Ash, dari Rasulullah shallallahu 'alaihi wa sallam bahwa Beliau ditanya mengenai buah kurma yang masih menggantung dipohon? Beliau menjawab: \"Orang yang sangat membutuhkan yang mengambilnya dan tidak mengumpulkannya di dalam baju, maka tidak ada hukuman atasnya. Dan barang siapa yang keluar membawa sebagian darinya maka ia wajib membayar denda dua kalinya, serta mendapat hukuman. Dan barang siapa yang mencuri sebagian darinya setelah terkumpul dalam tempat pengeringan dan mencapai harga tameng maka tangannya dipotong, dan barang siapa yang mencuri kurang dari itu maka ia berkewajiban membayar denda dua kalinya, dan mendapatkan hukuman.\" Dan ia menyebutkan mengenai unta dan domba yang hilang sebagaimana yang disebutkan selainnya. Ia berkata: dan beliau ditanya mengenai barang temuan lalu beliau menjawab: \"Apa yang ditemukan di jalan yang dilalui orang atau jalan sebuah kampung maka umumkan selama setahun, apabila orang yang mencarinya telah datang maka harus serahkan kepadanya, apabila tidak datang maka barang tersebut adalah milikmu, adapun yang terdapat di lahan yang tak bertuan, maka padanya dan juga pada barang terpendam zakatnya seperlima.\" Telah menceritakan kepada Kami Muhammad bin Al 'Ala`, telah menceritakan kepada Kami Abu Usamah dari Al Walid bin Katsir, telah menceritakan kepadaku 'Amr bin Syu'aib dengan sanadnya dengan hadits ini ia mengatakan mengenai domba yang hilang Beliau menjawab: \"Kumpulkanlah\". Telah menceritakan kepada Kami Musaddad, telah menceritakan kepada Kami Abu 'Awanah dari 'Ubaidullah bin Al Akhnasy dari 'Amr bin Syu'aib dengan hadits tersebut dengan sanadnya, ia berkata mengenai domba yang hilang: \"Domba tersebut adalah milikmu, saudaramu atau serigala. Ambillah domba tersebut\". Begitu juga yang diriwayatkan oleh Ayyub dan Ya'kub bin 'Atho` dari 'Amr bin Syuaib dari Nabi shallallahu 'alaihi wa sallam, beliau berkata: \"Ambillah.\" Telah menceritakan kepada Kami Musa bin Isma'il, telah menceritakan kepada Kami Hammad, dan telah diriwayatkan melalui jalur yang lain: Telah telah menceritakan kepada Kami Ibnu Al 'Ala`, telah menceritakan kepada Kami Ibnu Idris dari Ibnu Ishaq dari 'Amr bin Syu'aib dari ayahnya dari kakeknya dari Nabi shallallahu 'alaihi wa sallam dengan hadits ini, beliau berkata mengenai domba yang hilang: \"Kumpulkanlah hingga datang orang yang mencarinya.\""
            },
            {
                "number": 1456,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ عَنْ عَمْرِو بْنِ الْحَارِثِ عَنْ بُكَيْرِ بْنِ الْأَشَجِّ عَنْ عُبَيْدِ اللَّهِ بْنِ مِقْسَمٍ حَدَّثَهُ عَنْ رَجُلٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ وَجَدَ دِينَارًا فَأَتَى بِهِ فَاطِمَةَ فَسَأَلَتْ عَنْهُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ هُوَ رِزْقُ اللَّهِ عَزَّ وَجَلَّ فَأَكَلَ مِنْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَكَلَ عَلِيٌّ وَفَاطِمَةُ فَلَمَّا كَانَ بَعْدَ ذَلِكَ أَتَتْهُ امْرَأَةٌ تَنْشُدُ الدِّينَارَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا عَلِيُّ أَدِّ الدِّينَارَ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Al 'Ala`], telah menceritakan kepada Kami [Abdullah bin Wahb] dari ['Amr bin Al Harits] dari [Bukair bin Al Asyajj] dari ['Ubaidullah bin Miqsam] menceritakannya, dari [seorang laki-laki] dari [Abu Sa'id Al Khudri radliallahu 'anhu] bahwasanya Ali Bin Abu Thalib radliallahu 'anhu menemukan uang satu dinar, kemudian membawanya kepada Fathimah radliallahu 'anha, lalu ia menanyakannya kepada Rasulullah shallallahu 'alaihi wasallam, maka Rasulullah shallla Allahu 'alaihi wa sallam berkata: itu adalah rizqi dari Allah 'azza wajalla, kemudian beliau memakannya dan begitu juga Ali serta Fathimah. Kemudian setelah itu seorang wanita datang kepada beliau mengumumkan kehilangan uang satu dinar, maka Rasulullah shallallahu 'alaihi wasallam mengatakan kepada Ali: wahai Ali, berikan uang satu dinar tersebut kepadanya. "
            },
            {
                "number": 1457,
                "arab": "حَدَّثَنَا الْهَيْثَمُ بْنُ خَالِدٍ الْجُهَنِيُّ حَدَّثَنَا وَكِيعٌ عَنْ سَعْدِ بْنِ أَوْسٍ عَنْ بِلَالِ بْنِ يَحْيَى الْعَبْسِيِّ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُأَنَّهُ الْتَقَطَ دِينَارًا فَاشْتَرَى بِهِ دَقِيقًا فَعَرَفَهُ صَاحِبُ الدَّقِيقِ فَرَدَّ عَلَيْهِ الدِّينَارَ فَأَخَذَهُ عَلِيٌّ وَقَطَعَ مِنْهُ قِيرَاطَيْنِ فَاشْتَرَى بِهِ لَحْمًا",
                "id": "Telah menceritakan kepada Kami [Al Haitsam bin Khalid Al Juhani], telah menceritakan kepada Kami [Waki'] dari [Sa'd bin Aus] dari [Bilal bin Yahya Al 'Absi] dari [Ali Bin Abu Thalib radliallahu 'anhu] bahwa ia menemukan uang satu dinar lalu dia menggunakannya untuk membeli tepung, pedagang tepung mengetahuinya, kemudian ia mengembalikan uang dinar tersebut kepadanya dan Ali pun mengambilnya lalu dia memotongn sebagian darinya dua kirath lalu ia gunakan untuk membeli daging. "
            },
            {
                "number": 1458,
                "arab": "حَدَّثَنَا جَعْفَرُ بْنُ مُسَافِرٍ التِّنِّيسِيُّ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ حَدَّثَنَا مُوسَى بْنُ يَعْقُوبَ الزَّمَعِيُّ عَنْ أَبِي حَازِمٍ عَنْ سَهْلِ بْنِ سَعْدٍ أَخْبَرَهُ أَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ دَخَلَ عَلَى فَاطِمَةَ وَحَسَنٌ وَحُسَيْنٌ يَبْكِيَانِ فَقَالَ مَا يُبْكِيهِمَا قَالَتْ الْجُوعُ فَخَرَجَ عَلِيٌّ فَوَجَدَ دِينَارًا بِالسُّوقِ فَجَاءَ إِلَى فَاطِمَةَ فَأَخْبَرَهَا فَقَالَتْ اذْهَبْ إِلَى فُلَانٍ الْيَهُودِيِّ فَخُذْ لَنَا دَقِيقًا فَجَاءَ الْيَهُودِيَّ فَاشْتَرَى بِهِ فَقَالَ الْيَهُودِيُّ أَنْتَ خَتَنُ هَذَا الَّذِي يَزْعُمُ أَنَّهُ رَسُولُ اللَّهِ قَالَ نَعَمْ قَالَ فَخُذْ دِينَارَكَ وَلَكَ الدَّقِيقُ فَخَرَجَ عَلِيٌّ حَتَّى جَاءَ بِهِ فَاطِمَةَ فَأَخْبَرَهَا فَقَالَتْ اذْهَبْ إِلَى فُلَانٍ الْجَزَّارِ فَخُذْ لَنَا بِدِرْهَمٍ لَحْمًا فَذَهَبَ فَرَهَنَ الدِّينَارَ بِدِرْهَمِ لَحْمٍ فَجَاءَ بِهِ فَعَجَنَتْ وَنَصَبَتْ وَخَبَزَتْ وَأَرْسَلَتْ إِلَى أَبِيهَا فَجَاءَهُمْ فَقَالَتْ يَا رَسُولَ اللَّهِ أَذْكُرُ لَكَ فَإِنْ رَأَيْتَهُ لَنَا حَلَالًا أَكَلْنَاهُ وَأَكَلْتَ مَعَنَا مِنْ شَأْنِهِ كَذَا وَكَذَا فَقَالَ كُلُوا بِاسْمِ اللَّهِ فَأَكَلُوا فَبَيْنَمَا هُمْ مَكَانَهُمْ إِذَا غُلَامٌ يَنْشُدُ اللَّهَ وَالْإِسْلَامَ الدِّينَارَ فَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَدُعِيَ لَهُ فَسَأَلَهُ فَقَالَ سَقَطَ مِنِّي فِي السُّوقِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا عَلِيُّ اذْهَبْ إِلَى الْجَزَّارِ فَقُلْ لَهُ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَكَ أَرْسِلْ إِلَيَّ بِالدِّينَارِ وَدِرْهَمُكَ عَلَيَّ فَأَرْسَلَ بِهِ فَدَفَعَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَيْهِ",
                "id": "Telah menceritakan kepada Kami Ja'far bin Musafir At Tanusi, telah menceritakan kepada Kami Ibnu Abu Fudaik, telah menceritakan kepada Kami Musa bin Ya'qub Az Zama'i, dari Abu Hazim dari Sahl bin Sa'd, ia telah mengabarkan kepadanya bahwa Ali Bin Abu Thalib menemui Fathimah sementara Hasan dan Husain sedang menangis, dia bertanya: apa yang membuat mereka menangis? Fathimah menjawab: rasa lapar. Kemudian Ali keluar dan di pasar dia menemukan uang satu dinar, lalu ia kembali kepada fathimah memberitahukan kepadanya, lalu Fathimah berkata: pergilah kepada fulan seorang yahudi, dan belilah tepung untuk Kami, maka dia pun mendatangi orang yahudi tersebut untuk membeli tepung. Orang yahudi tersebut berkata: apakah engkau menantu orang yang disebut sebagai Rasulullah? Dia menjawab: Ya. Orang yahudi tersebut berkata: ambillah uang dinarmu dan tepung ini untukmu! Maka Ali kembali kepada Fathimah dan memberitahukan kejadian tersebut, lalu Fathimah meminta Ali untuk pergi ke tukang daging untuk membeli daging satu dirham. Maka Ali menggadaikan satu dinar dengan daging seharga satu dirham lalu ia membawanya kepada Fathimah dan Fathimah pun mengadon dan membuat roti, lalu dia mengirim utusan kepada bapaknya kemudian beliau datang. Lalu ia berkata: Ya Rasulallah, aku akan bercerita kepadamu, apabila anda menganggapnya halal maka Kami akan memakannya dan anda pun memakannya bersama Kami. Kemudian beliau berkata: \"Makanlah dengan menyebut nama Allah.\" Tatkala mereka sedang pada kondisi seperti itu tiba-tiba terdapat seorang yang mengumumkan kehilangan uang satu dinar. Maka Rasulullah shallallahu 'alaihi wa sallam memerintahkan untuk memanggilnya dan menanyakannya. Orang tersebut menjawab: uang tersebut terjatuh dariku di pasar. Kemudian Nabi shallallahu 'alaihi wa sallam berkata: \"Wahai Ali, pergilah ke tukang daging dan katakan kepadanya bahwasanya Rasulullah shallallahu 'alaihi wa sallam mengatakan kepadamu: \"Kirimkan satu uang dinar tersebut sedangkan uang dirhammu menjadi tanggunganku.\" Maka tukang daging tersebut mengembalikan satu dinar dan Rasulullah shallallahu 'alaihi wa sallam menyerahkannya kepada orang tersebut."
            },
            {
                "number": 1459,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ عَبْدِ الرَّحْمَنِ الدِّمَشْقِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ شُعَيْبٍ عَنْ الْمُغِيرَةِ بْنِ زِيَادٍ عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّ أَنَّهُ حَدَّثَهُ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَرَخَّصَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْعَصَا وَالسَّوْطِ وَالْحَبْلِ وَأَشْبَاهِهِ يَلْتَقِطُهُ الرَّجُلُ يَنْتَفِعُ بِهِقَالَ أَبُو دَاوُد رَوَاهُ النُّعْمَانُ بْنُ عَبْدِ السَّلَامِ عَنْ الْمُغِيرَةِ أَبِي سَلَمَةَ بِإِسْنَادِهِ وَرَوَاهُ شَبَابَةُ عَنْ مُغِيرَةَ بْنِ مُسْلِمٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ كَانُوا لَمْ يَذْكُرُوا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada Kami [Sulaiman bin Abdurrahman Ad Damasyqi], telah menceritakan kepada Kami [Muhammad bin Syu'aib] dari [Al Mughirah bin Ziyad] dari [Abu Az Zubair Al Makki] bahwa ia menceritakan kepadanya, dari [Jabir bin Abdullah], ia berkata; Rasulullah shallallahu 'alaihi wasallam memberikan keringanan kepada Kami untuk menggunakan tongkat, pecut, tali dan yang semisalnya yang Kami temukan. Abu Daud berkata; hadits ini diriwayatkan [An Nu'man bin Abdussalam] dari [Al Mughirah Abu Salamah] dengan sanadnya. Dan diriwayatkan oleh [Syababah] dari [Al Mughirah bin Muslim] dari [Abu Az Zubair] dari [Jabir], ia berkata; mereka tidak menyebutkan Nabi Shalla Allahu 'alaihi wa sallam. "
            },
            {
                "number": 1460,
                "arab": "حَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ عَمْرِو بْنِ مُسْلِمٍ عَنْ عِكْرِمَةَ أَحْسَبُهُ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ضَالَّةُ الْإِبِلِ الْمَكْتُومَةُ غَرَامَتُهَا وَمِثْلُهَا مَعَهَا",
                "id": "Telah menceritakan kepada Kami [Makhlad bin Khalid], telah menceritakan kepada Kami [Abdurrazzaq], telah mengabarkan kepada Kami [Ma'mar] dari ['Amr bin Muslim] dari [Ikrimah], aku mengira dari [Abu Hurairah] radliallahu 'anhu bahwa Nabi shalla Allahu 'alaihi wa sallam bersabda: \"Unta yang terlepas yang disembunyikan maka dendanya adalah seperti onta tersebut dan ditambah dengan yang semisalnya."
            },
            {
                "number": 1461,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ خَالِدِ بْنِ مَوْهَبٍ وَأَحْمَدُ بْنُ صَالِحٍ قَالَا حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو عَنْ بُكَيْرٍ عَنْ يَحْيَى بْنِ عَبْدِ الرَّحْمَنِ بْنِ حَاطِبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عُثْمَانَ التَّيْمِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ لُقَطَةِ الْحَاجِّقَالَ أَحْمَدُ قَالَ ابْنُ وَهْبٍ يَعْنِي فِي لُقَطَةِ الْحَاجِّ يَتْرُكُهَا حَتَّى يَجِدَهَا صَاحِبُهَا قَالَ ابْنُ مَوْهَبٍ عَنْ عَمْرٍو",
                "id": "Telah menceritakan kepada Kami [Yazid bin Khalid bin Mauhib] serta [Ahmad bin Shalih], mereka berkata; telah menceritakan kepada Kami [Ibnu Wahb], telah mengabarkan kepadaku ['Amr] dari [Bukair] dari [Yahya bin Abdurrahman bin Hathib] dari [Abdurrahman bin Utsman At Taimi] bahwa Rasulullah shallAllahu wa'alaihi wa sallam melarang dari barang temuan dari orang yang melakukan haji. Ahmad berkata; Ibnu Wahb berkata mengenai barang temuan dari orang yang melakukan haji; ia tinggalkan hingga ditemukan pemiliknya. Ibnu Mauhib berkata; dari 'Amr. "
            },
            {
                "number": 1462,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا خَالِدٌ عَنْ أَبِي حَيَّانَ التَّيْمِيِّ عَنْ الْمُنْذِرِ بْنِ جَرِيرٍ قَالَ كُنْتُ مَعَ جَرِيرٍ بِالْبَوَازِيجِ فَجَاءَ الرَّاعِي بِالْبَقَرِ وَفِيهَا بَقَرَةٌ لَيْسَتْ مِنْهَا فَقَالَ لَهُ جَرِيرٌ مَا هَذِهِ قَالَ لَحِقَتْ بِالْبَقَرِ لَا نَدْرِي لِمَنْ هِيَ فَقَالَ جَرِيرٌ أَخْرِجُوهَا فَقَدْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يَأْوِي الضَّالَّةَ إِلَّا ضَالٌّ",
                "id": "Telah menceritakan kepada Kami 'Amr bin 'Aun, telah mengabarkan kepada Kami Khalid dari Abu Hayyan At Taimi dari Al Mundzir bin Jarir, ia berkata: Aku bersama Jarir di Al Bawazij, kemudian terdapat seorang penggembala sapi yang datang, dan padanya terdapat seekor sapi yang bukan dari sapi-sapi tersebut, kemudian Jarir berkata: \"Apakah ini?\" Ia berkata: \"Sapi tersebut mengikuti sapi-sapi tersebut. Kami tidak mengerti milik siapakah sapi tersebut?\" Kemudian Jarir berkata: Keluarkan sapi tersebut! Sungguh aku telah mendengar Rasulullah shallallahu 'alaihi wa sallam bersabda: \"Tidak ada yang melindungi sesuatu yang tersesat kecuali orang yang tersesat.\""
            }
  ]
}