{
    "kategori": "Kitab Sunnah",
  "hadits": [
    {
                "number": 3980,
                "arab": "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ عَنْ خَالِدٍ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ افْتَرَقَتْ الْيَهُودُ عَلَى إِحْدَى أَوْ ثِنْتَيْنِ وَسَبْعِينَ فِرْقَةً وَتَفَرَّقَتْ النَّصَارَى عَلَى إِحْدَى أَوْ ثِنْتَيْنِ وَسَبْعِينَ فِرْقَةً وَتَفْتَرِقُ أُمَّتِي عَلَى ثَلَاثٍ وَسَبْعِينَ فِرْقَةً",
                "id": "Telah menceritakan kepada kami [Wahb bin Baqiyyah] dari [Khalid] dari [Muhammad bin Amru] dari [Abu Salamah] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Yahudi terpecah menjadi tujuh puluh satu atau tujuh puluh dua golongan, Nashara terpecah menjadi tujuh puluh satu atau tujuh puluh dua golongan, dan umatku akan terpecah menjadi tujuh puluh tiga golongan.\""
            },
            {
                "number": 3981,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ وَمُحَمَّدُ بْنُ يَحْيَى قَالَا حَدَّثَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا صَفْوَانُ ح و حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ حَدَّثَنَا بَقِيَّةُ قَالَ حَدَّثَنِي صَفْوَانُ نَحْوَهُ قَالَ حَدَّثَنِي أَزْهَرُ بْنُ عَبْدِ اللَّهِ الْحَرَازِيُّ عَنْ أَبِي عَامِرٍ الْهَوْزَنِيِّ عَنْ مُعَاوِيَةَ بْنِ أَبِي سُفْيَانَأَنَّهُ قَامَ فِينَا فَقَالَ أَلَا إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ فِينَا فَقَالَ أَلَا إِنَّ مَنْ قَبْلَكُمْ مِنْ أَهْلِ الْكِتَابِ افْتَرَقُوا عَلَى ثِنْتَيْنِ وَسَبْعِينَ مِلَّةً وَإِنَّ هَذِهِ الْمِلَّةَ سَتَفْتَرِقُ عَلَى ثَلَاثٍ وَسَبْعِينَ ثِنْتَانِ وَسَبْعُونَ فِي النَّارِ وَوَاحِدَةٌ فِي الْجَنَّةِ وَهِيَ الْجَمَاعَةُ زَادَ ابْنُ يَحْيَى وَعَمْرٌو فِي حَدِيثَيْهِمَا وَإِنَّهُ سَيَخْرُجُ مِنْ أُمَّتِي أَقْوَامٌ تَجَارَى بِهِمْ تِلْكَ الْأَهْوَاءُ كَمَا يَتَجَارَى الْكَلْبُ لِصَاحِبِهِ وَقَالَ عَمْرٌو الْكَلْبُ بِصَاحِبِهِ لَا يَبْقَى مِنْهُ عِرْقٌ وَلَا مَفْصِلٌ إِلَّا دَخَلَهُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] dan [Muhammad bin Yahya] keduanya berkata; telah menceritakan kepada kami [Abu Al Mughirah] berkata, telah menceritakan kepada kami [Shafwan]. (dalam jalur lain disebutkan) [Amru bin Utsman] berkata, telah menceritakan kepada kami [Baqiyyah] ia berkata; telah menceritakan kepadaku [Shafwan] seperti itu. Ia berkata, \"telah menceritakan kepadaku [Azhar bin Abdullah Al Harazi] dari [Abu Amir Al Hauzani] dari [Mu'awiyah bin Abu Sufyan] Bahwasanya saat sedang besama kami ia berkata, \"Ketahuilah, ketika sedang bersama kami Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ketahuilah! Sesungguhnya orang-orang sebelum kalian dari kalangan ahlu kitab berpecah belah menjadi tujuh puluh dua golongan, dan umatku akan berpecah menjadi tujuh puluh tiga golongan; tujuh puluh dua golongan masuk neraka dan satu golongan masuk surga, yaitu Al Jama'ah.\" Ibnu Yahya dan Amru menambahkan dalam hadits keduanya, \"Sesungguhnya akan keluar dari umatku beberapa kaum yang mengikuti hawa nafsunya seperti anjing mengikuti tuannya.\" Amru berkata, \"Seekor lekat dengan tuannya, yang jika ada tulang bersamanya pasti dia akan mengikutinya.\""
            },
            {
                "number": 3982,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ حَدَّثَنَا يَزِيدُ بْنُ إِبْرَاهِيمَ التَّسْتُرِيُّ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْقَرَأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَذِهِ الْآيَةَ{ هُوَ الَّذِي أَنْزَلَ عَلَيْكَ الْكِتَابَ مِنْهُ آيَاتٌ مُحْكَمَاتٌ إِلَى أُولُو الْأَلْبَابِ }قَالَتْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِذَا رَأَيْتُمْ الَّذِينَ يَتَّبِعُونَ مَا تَشَابَهَ مِنْهُ فَأُولَئِكَ الَّذِينَ سَمَّى اللَّهُ فَاحْذَرُوهُمْ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] berkata, telah menceritakan kepada kami [Yazid bin Ibrahim At Tastutri] dari [Abdullah bin Abu Bulaikah] dari [Al Qasim bin Muhammad bin Muhammad] dari ['Aisyah radliallahu 'anha] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam membaca ayat: '(Dia-lah yang menurunkan Al Kitab (Al-Qur'an) kepada kamu. Di antara isinya ada ayat-ayat yang muhkamat..) hingga ayat '(orang-orang yang berakal).\" 'Aisyah berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika kamu melihat orang-orang yang mengikuti ayat-ayat mutasyabihat dari Al-Qur'an, maka mereka itulah orang-orang yang Allah maksud, maka berhati-hatilah terhadap mereka.\""
            },
            {
                "number": 3983,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا يَزِيدُ بْنُ أَبِي زِيَادٍ عَنْ مُجَاهِدٍ عَنْ رَجُلٍ عَنْ أَبِي ذَرٍّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفْضَلُ الْأَعْمَالِ الْحُبُّ فِي اللَّهِ وَالْبُغْضُ فِي اللَّهِ",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Khalid bin Abdullah] berkata, telah menceritakan kepada kami [Yazid bin Abu Ziyad] dari [Mujahid] dari [seorang laki-laki] dari [Abu Dzar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sebaik-baik amal adalah cinta karena Allah dan benci karena Allah.\""
            },
            {
                "number": 3984,
                "arab": "حَدَّثَنَا ابْنُ السَّرْحِ أَخْبَرَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ أَنَّ عَبْدَ اللَّهِ بْنَ كَعْبِ بْنِ مَالِكٍ وَكَانَ قَائِدَ كَعْبٍ مِنْ بَنِيهِ حِينَ عَمِيَ قَالَ سَمِعْتُ كَعْبَ بْنَ مَالِكٍ وَذَكَرَ ابْنُ السَّرْحِ قِصَّةَ تَخَلُّفِهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةِ تَبُوكَ قَالَوَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُسْلِمِينَ عَنْ كَلَامِنَا أَيُّهَا الثَّلَاثَةَ حَتَّى إِذَا طَالَ عَلَيَّ تَسَوَّرْتُ جِدَارَ حَائِطِ أَبِي قَتَادَةَ وَهُوَ ابْنُ عَمِّي فَسَلَّمْتُ عَلَيْهِ فَوَاللَّهِ مَا رَدَّ عَلَيَّ السَّلَامَ ثُمَّ سَاقَ خَبَرَ تَنْزِيلِ تَوْبَتِهِ",
                "id": "Telah menceritakan kepada kami [Ibnu As Sarh] berkata, telah mengabarkan kepada kami [Ibnu Wahb] ia berkata; telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] ia berkata; telah mengabarkan kepadaku ['Abdurrahman bin Abdullah bin Ka'b bin Malik] bahwa [Abdullah bin Ka'b bin Malik] -di antara anak-anak Ka'ab Abdullah adalah orang yang menjadi penuntun Ka'b saat buta- ia berkata, \"Aku mendengar [Ka'b bin Malik] -Ibnu As Sarh menyebutkan kisah ketidak ikut sertaannya bersama Nabi shallallahu 'alaihi wasallam daam perang Tabuk- ia (Ka'b) berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang kaum muslimin untuk berbicara dengan kami bertiga. Ketika suasana seperti berjalan lama, aku masuk ke dalam kebun milik anak pamanku, Abu Qatadah. Demi Allah, aku ucapkan salam kepadanya namun ia tidak menjawabnya.\" Kemudian Ka'ab menceritakan turunnya ayat yang mengabarkan atas diterimanya taubatnya. "
            },
            {
                "number": 3985,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا عَطَاءٌ الْخُرَاسَانِيُّ عَنْ يَحْيَى بْنِ يَعْمَرَ عَنْ عَمَّارِ بْنِ يَاسِرٍ قَالَقَدِمْتُ عَلَى أَهْلِي وَقَدْ تَشَقَّقَتْ يَدَايَ فَخَلَّقُونِي بِزَعْفَرَانٍ فَغَدَوْتُ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَلَّمْتُ عَلَيْهِ فَلَمْ يَرُدَّ عَلَيَّ وَقَالَ اذْهَبْ فَاغْسِلْ هَذَا عَنْكَ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Hammad] berkata, telah mengabarkan kepada kami [Atha Al Akhurasani] dari [Yahya bin Ya'mar] dari [Ammar bin Yasir] ia berkata, \"Aku mendatangi isteriku saat tanganku lecet, kemudian ia membalur tanganku dengan za'faran. Pagi harinya aku datang menemui Nabi shallallahu 'alaihi wasallam, saat aku mengucapkan salam beliau tidak mau menjawabnya. Beliau bersabda: \"Pergi dan bersihkanlah ini (za'faran) darimu.\""
            },
            {
                "number": 3986,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ ثَابِتٍ الْبُنَانِيِّ عَنْ سُمَيَّةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَاأَنَّهُ اعْتَلَّ بَعِيرٌ لِصَفِيَّةَ بِنْتِ حُيَيٍّ وَعِنْدَ زَيْنَبَ فَضْلُ ظَهْرٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِزَيْنَبَ أَعْطِيهَا بَعِيرًا فَقَالَتْ أَنَا أُعْطِي تِلْكَ الْيَهُودِيَّةَ فَغَضِبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَهَجَرَهَا ذَا الْحِجَّةِ وَالْمُحَرَّمَ وَبَعْضَ صَفَرٍ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Hammad] dari [Tsabit Al Bunani] dari [Sumayyah] dari ['Aisyah radliallahu 'anha] ia berkata, \"Ketika unta Shafiyah binti Huyay sakit, Zainab masih mempunyai kendaraan yang bisa digunakan. Lalu Rasulullah shallallahu 'alaihi wasallam berkata kepada Zainab: \"Berilah Shafiyah unta.\" Zainab menjawab, \"Aku harus memberi Yahudi itu!\" Rasulullah shallallahu 'alaihi wasallam pun marah, kemudian beliau mendiamkannya selama bulan Dzul hijjah, Muharram dan sebagian bulan Shafar.\""
            },
            {
                "number": 3987,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ هَارُونَ أَخْبَرَنَا مُحَمَّدُ بْنُ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمِرَاءُ فِي الْقُرْآنِ كُفْرٌ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] berkata, telah menceritakan kepada kami [Yazid] -maksudnya Yazid bin Harun- berkata, telah mengabarkan kepada kami [Muhammad bin Amru] dari [Abu Salamah] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Berbantah-bantahan dalam Al-Qur'an adalah kufur.\""
            },
            {
                "number": 3988,
                "arab": "حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ نَجْدَةَ حَدَّثَنَا أَبُو عَمْرِو بْنُ كَثِيرِ بْنِ دِينَارٍ عَنْ حَرِيزِ بْنِ عُثْمَانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَوْفٍ عَنْ الْمِقْدَامِ بْنِ مَعْدِي كَرِبَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ أَلَا إِنِّي أُوتِيتُ الْكِتَابَ وَمِثْلَهُ مَعَهُ أَلَا يُوشِكُ رَجُلٌ شَبْعَانُ عَلَى أَرِيكَتِهِ يَقُولُ عَلَيْكُمْ بِهَذَا الْقُرْآنِ فَمَا وَجَدْتُمْ فِيهِ مِنْ حَلَالٍ فَأَحِلُّوهُ وَمَا وَجَدْتُمْ فِيهِ مِنْ حَرَامٍ فَحَرِّمُوهُ أَلَا لَا يَحِلُّ لَكُمْ لَحْمُ الْحِمَارِ الْأَهْلِيِّ وَلَا كُلُّ ذِي نَابٍ مِنْ السَّبُعِ وَلَا لُقَطَةُ مُعَاهِدٍ إِلَّا أَنْ يَسْتَغْنِيَ عَنْهَا صَاحِبُهَا وَمَنْ نَزَلَ بِقَوْمٍ فَعَلَيْهِمْ أَنْ يَقْرُوهُ فَإِنْ لَمْ يَقْرُوهُ فَلَهُ أَنْ يُعْقِبَهُمْ بِمِثْلِ قِرَاهُ",
                "id": "Telah menceritakan kepada kami [Abdul Wahhab bin Najdah] berkata, telah menceritakan kepada kami [Abu Amru bin Katsir bin Dinar] dari [Hariz bin Utsman] dari ['Abdurrahman bin Abu Auf] dari [Al Miqdam bin Ma'di Karib] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Ketahuilah, sesungguhnya aku diberi Al -Qur'an dan yang semisal bersamanya (As Sunnah). Lalu ada seorang laki-laki yang dalam keadaan kekenyangan duduk di atas kursinya berkata, \"Hendaklah kalian berpegang teguh dengan Al-Qur'an! Apa yang kalian dapatkan dalam Al-Qur'an dari perkara halal maka halalkanlah. Dan apa yang kalian dapatkan dalam Al-Qur'an dari perkara haram maka haramkanlah. Ketahuilah! Tidak dihalalkan bagi kalian daging himar jinak, daging binatang buas yang bertaring dan barang temuan milik orang kafir mu'ahid (kafir dalam janji perlindungan penguasa Islam, dan barang temuan milik muslim lebih utama) kecuali pemiliknya tidak membutuhkannya. Dan barangsiapa singgah pada suatu kaum hendaklah mereka menyediakan tempat, jika tidak memberikan tempat hendaklah memberikan perlakukan sesuai dengan sikap jamuan mereka.\""
            },
            {
                "number": 3989,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ حَنْبَلٍ وَعَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ أَبِي النَّضْرِ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ عَنْ أَبِيهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا أُلْفِيَنَّ أَحَدَكُمْ مُتَّكِئًا عَلَى أَرِيكَتِهِ يَأْتِيهِ الْأَمْرُ مِنْ أَمْرِي مِمَّا أَمَرْتُ بِهِ أَوْ نَهَيْتُ عَنْهُ فَيَقُولُ لَا نَدْرِي مَا وَجَدْنَا فِي كِتَابِ اللَّهِ اتَّبَعْنَاهُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Muhammad bin Hanbal] dan [Abdullah bin Muhammad An nufaili] keduanya berkata; telah menceritakan kepada kami [Sufyan] dari [Abu An Nadhr] dari [Ubaidullah bin Abu Rafi'] dari [Bapaknya] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sungguh, akan ada salah seorang dari kalian duduk di atas kursi santainya, lalu datang kepadanya perkara yang aku perintahkan atau aku larang kemudian ia berkata, \"Aku tidak tahu! Apa yang kami dapatkan dalam Kitabullah selalu kami ikuti.\""
            },
            {
                "number": 3990,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ الْبَزَّازُ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ ح و حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ الْمَخْرَمِيُّ وَإِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَحْدَثَ فِي أَمْرِنَا هَذَا مَا لَيْسَ فِيهِ فَهُوَ رَدٌّقَالَ ابْنُ عِيسَى قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَنَعَ أَمْرًا عَلَى غَيْرِ أَمْرِنَا فَهُوَ رَدٌّ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah Al Bazzaz] berkata, telah menceritakan kepada kami [Ibrahim bin Sa'd]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Isa] berkata, telah menceritakan kepada kami [Abdullah bin Ja'far Al Makhrami] dan [Ibrahim bin Sa'd] dari [Sa'd bin Ibrahim] dari [Al Qasim bin Muhammad] dari ['Aisyah radliallahu 'anha] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam a bersabda: \"Barangsiapa membuat-buat suatu perkara yang tidak ada dalam agama kami, maka akan tertolak.\" Ibnu Isa menyebutkan, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa membuat perkara baru selain dari yang kami perintahkan maka akan tertolak.\""
            },
            {
                "number": 3991,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا ثَوْرُ بْنُ يَزِيدَ قَالَ حَدَّثَنِي خَالِدُ بْنُ مَعْدَانَ قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ عَمْرٍو السُّلَمِيُّ وَحُجْرُ بْنُ حُجْرٍ قَالَاأَتَيْنَا الْعِرْبَاضَ بْنَ سَارِيَةَ وَهُوَ مِمَّنْ نَزَلَ فِيهِ{ وَلَا عَلَى الَّذِينَ إِذَا مَا أَتَوْكَ لِتَحْمِلَهُمْ قُلْتَ لَا أَجِدُ مَا أَحْمِلُكُمْ عَلَيْهِ }فَسَلَّمْنَا وَقُلْنَا أَتَيْنَاكَ زَائِرِينَ وَعَائِدِينَ وَمُقْتَبِسِينَ فَقَالَ الْعِرْبَاضُ صَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ يَوْمٍ ثُمَّ أَقْبَلَ عَلَيْنَا فَوَعَظَنَا مَوْعِظَةً بَلِيغَةً ذَرَفَتْ مِنْهَا الْعُيُونُ وَوَجِلَتْ مِنْهَا الْقُلُوبُ فَقَالَ قَائِلٌ يَا رَسُولَ اللَّهِ كَأَنَّ هَذِهِ مَوْعِظَةُ مُوَدِّعٍ فَمَاذَا تَعْهَدُ إِلَيْنَا فَقَالَ أُوصِيكُمْ بِتَقْوَى اللَّهِ وَالسَّمْعِ وَالطَّاعَةِ وَإِنْ عَبْدًا حَبَشِيًّا فَإِنَّهُ مَنْ يَعِشْ مِنْكُمْ بَعْدِي فَسَيَرَى اخْتِلَافًا كَثِيرًا فَعَلَيْكُمْ بِسُنَّتِي وَسُنَّةِ الْخُلَفَاءِ الْمَهْدِيِّينَ الرَّاشِدِينَ تَمَسَّكُوا بِهَا وَعَضُّوا عَلَيْهَا بِالنَّوَاجِذِ وَإِيَّاكُمْ وَمُحْدَثَاتِ الْأُمُورِ فَإِنَّ كُلَّ مُحْدَثَةٍ بِدْعَةٌ وَكُلَّ بِدْعَةٍ ضَلَالَةٌ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] berkata, telah menceritakan kepada kami [Al Walid bin Muslim] berkata, telah menceritakan kepada kami [Tsaur bin Yazid] ia berkata; telah menceritakan kepadaku [Khalid bin Ma'dan] ia berkata; telah menceritakan kepadaku ['Abdurrahman bin Amru As Sulami] dan [Hujr bin Hujr] keduanya berkata, \"Kami mendatangi [Irbadh bin Sariyah], dan ia adalah termasuk seseorang yang turun kepadanya ayat: '(dan tiada (pula dosa) atas orang-orang yang apabila mereka datang kepadamu, suapaya kami memberi mereka kendaraan, lalu kamu berkata, \"Aku tidak memperoleh kendaraan orang yang membawamu) ' -Qs. At Taubah: 92- kami mengucapkan salam kepadanya dan berkata, \"Kami datang kepadamu untuk ziarah, duduk-duduk mendengar sesuatu yang berharga darimu.\" Irbadh berkata, \"Suatu ketika Rasulullah shallallahu 'alaihi wasallam shalat bersama kami, beliau lantas menghadap ke arah kami dan memberikan sebuah nasihat yang sangat menyentuh yang membuat mata menangis dan hati bergetar. Lalu seseorang berkata, \"Wahai Rasulullah, seakan-akan ini adalah nasihat untuk perpisahan! Lalu apa yang engkau washiatkan kepada kami?\" Beliau mengatakan: \"Aku wasiatkan kepada kalian untuk bertakwa kepada Allah, senantiasa taat dan mendengar meskipun yang memerintah adalah seorang budak habsyi yang hitam. Sesungguhnya orang-orang yang hidup setelahku akan melihat perselisihan yang banyak. Maka, hendaklah kalian berpegang dengan sunahku, sunah para khalifah yang lurus dan mendapat petunjuk, berpegang teguhlah dengannya dan gigitlah dengan gigi geraham. Jauhilah oleh kalian perkara-perkara baru (dalam urusan agama), sebab setiap perkara yang baru adalah bid'ah dan setaip bid'ah adalah sesat.\""
            },
            {
                "number": 3992,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ ابْنِ جُرَيْجٍ قَالَ حَدَّثَنِي سُلَيْمَانُ يَعْنِي ابْنَ عَتِيقٍ عَنْ طَلْقِ بْنِ حَبِيبٍ عَنْ الْأَحْنَفِ بْنِ قَيْسٍ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَلَا هَلَكَ الْمُتَنَطِّعُونَ ثَلَاثَ مَرَّاتٍ",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Yahya] dari [Ibnu Juraij] ia berkata; telah menceritakan kepadaku [Sulaiman] -maksudnya Sulaiman bin Atiq- dari [Thalq bin habib] dari [Al Ahnaf bin Qais] dari [Abdullah bin Mas'ud] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Ketahuilah, sesungguhnya celakalah orang-orang yang berlebih-lebihan dan melampaui batas.\" Beliau ucapkan hal itu hingga tiga kali. "
            },
            {
                "number": 3993,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ حَدَّثَنَا إِسْمَعِيلُ يَعْنِي ابْنَ جَعْفَرٍ قَالَ أَخْبَرَنِي الْعَلَاءُ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ دَعَا إِلَى هُدًى كَانَ لَهُ مِنْ الْأَجْرِ مِثْلُ أُجُورِ مَنْ تَبِعَهُ لَا يَنْقُصُ ذَلِكَ مِنْ أُجُورِهِمْ شَيْئًا وَمَنْ دَعَا إِلَى ضَلَالَةٍ كَانَ عَلَيْهِ مِنْ الْإِثْمِ مِثْلُ آثَامِ مَنْ تَبِعَهُ لَا يَنْقُصُ ذَلِكَ مِنْ آثَامِهِمْ شَيْئًا",
                "id": "Telah menceritakan kepada kami Yahya bin Ayyub berkata: telah menceritakan kepada kami Isma'il -maksudnya Isma'il bin ja'far- ia berkata: telah mengabarkan kepadaku Al 'Ala -maksudnya Al 'Ala` bin 'Abdurrahman dari Bapaknya dari Abu Hurairah bahwa Rasulullah shallallahu 'alaihi wa sallam bersabda: \"Barangsiapa mengajak kepada petunjuk maka ia akan mendapatkan pahala seperti pahala orang yang mengikutinya tanpa mengurangi pahala mereka sedikitpun. Dan barangsiapa mengajak kepada kesesatan maka ia akan mendapatkan dosa seperti dosa orang-orang yang mengikutinya tanpa mengurangi dari dosa mereka sedikitpun.\""
            },
            {
                "number": 3994,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ عَامِرِ بْنِ سَعْدٍ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَعْظَمَ الْمُسْلِمِينَ فِي الْمُسْلِمِينَ جُرْمًا مَنْ سَأَلَ عَنْ أَمْرٍ لَمْ يُحَرَّمْ فَحُرِّمَ عَلَى النَّاسِ مِنْ أَجْلِ مَسْأَلَتِهِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu syaibah] berkata, telah menceritakan kepada kami [Sufyan] dari [Az zuhri] dari [Amir bin Sa'd] dari [Bapaknya] ia berkata, 'Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya seorang muslim yang paling besar kejahatannya kepada kaum muslimin adalah seseorang yang bertanya tentang sesuatu yang belum diharamkan, lalu hal itu diharamkan atas semua manusia karena sebab pertanyaannya tersebut.\""
            },
            {
                "number": 3995,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ خَالِدِ بْنِ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ الْهَمْدَانِيُّ حَدَّثَنَا اللَّيْثُ عَنْ عُقَيْلٍ عَنْ ابْنِ شِهَابٍ أَنَّ أَبَا إِدْرِيسَ الْخَوْلَانِيَّ عَائِذَ اللَّهِ أَخْبَرَهُ أَنَّ يَزِيدَ بْنَ عُمَيْرَةَ وَكَانَ مِنْ أَصْحَابِ مُعَاذِ بْنِ جَبَلٍ أَخْبَرَهُ قَالَكَانَ لَا يَجْلِسُ مَجْلِسًا لِلذِّكْرِ حِينَ يَجْلِسُ إِلَّا قَالَ اللَّهُ حَكَمٌ قِسْطٌ هَلَكَ الْمُرْتَابُونَ فَقَالَ مُعَاذُ بْنُ جَبَلٍ يَوْمًا إِنَّ مِنْ وَرَائِكُمْ فِتَنًا يَكْثُرُ فِيهَا الْمَالُ وَيُفْتَحُ فِيهَا الْقُرْآنُ حَتَّى يَأْخُذَهُ الْمُؤْمِنُ وَالْمُنَافِقُ وَالرَّجُلُ وَالْمَرْأَةُ وَالصَّغِيرُ وَالْكَبِيرُ وَالْعَبْدُ وَالْحُرُّ فَيُوشِكُ قَائِلٌ أَنْ يَقُولَ مَا لِلنَّاسِ لَا يَتَّبِعُونِي وَقَدْ قَرَأْتُ الْقُرْآنَ مَا هُمْ بِمُتَّبِعِيَّ حَتَّى أَبْتَدِعَ لَهُمْ غَيْرَهُ فَإِيَّاكُمْ وَمَا ابْتُدِعَ فَإِنَّ مَا ابْتُدِعَ ضَلَالَةٌ وَأُحَذِّرُكُمْ زَيْغَةَ الْحَكِيمِ فَإِنَّ الشَّيْطَانَ قَدْ يَقُولُ كَلِمَةَ الضَّلَالَةِ عَلَى لِسَانِ الْحَكِيمِ وَقَدْ يَقُولُ الْمُنَافِقُ كَلِمَةَ الْحَقِّ قَالَ قُلْتُ لِمُعَاذٍ مَا يُدْرِينِي رَحِمَكَ اللَّهُ أَنَّ الْحَكِيمَ قَدْ يَقُولُ كَلِمَةَ الضَّلَالَةِ وَأَنَّ الْمُنَافِقَ قَدْ يَقُولُ كَلِمَةَ الْحَقِّ قَالَ بَلَى اجْتَنِبْ مِنْ كَلَامِ الْحَكِيمِ الْمُشْتَهِرَاتِ الَّتِي يُقَالُ لَهَا مَا هَذِهِ وَلَا يُثْنِيَنَّكَ ذَلِكَ عَنْهُ فَإِنَّهُ لَعَلَّهُ أَنْ يُرَاجِعَ وَتَلَقَّ الْحَقَّ إِذَا سَمِعْتَهُ فَإِنَّ عَلَى الْحَقِّ نُورًاقَالَ أَبُو دَاوُد قَالَ مَعْمَرٌ عَنْ الزُّهْرِيِّ فِي هَذَا الْحَدِيثِ وَلَا يُنْئِيَنَّكَ ذَلِكَ عَنْهُ مَكَانَ يُثْنِيَنَّكَ و قَالَ صَالِحُ بْنُ كَيْسَانَ عَنْ الزُّهْرِيِّ فِي هَذَا الْمُشَبِّهَاتِ مَكَانَ الْمُشْتَهِرَاتِ وَقَالَ لَا يُثْنِيَنَّكَ كَمَا قَالَ عُقَيْلٌ و قَالَ ابْنُ إِسْحَقَ عَنْ الزُّهْرِيِّ قَالَ بَلَى مَا تَشَابَهَ عَلَيْكَ مِنْ قَوْلِ الْحَكِيمِ حَتَّى تَقُولَ مَا أَرَادَ بِهَذِهِ الْكَلِمَةِ",
                "id": "Telah menceritakan kepada kami [Yazid bin Khalid bin Yazid bin Abdullah bin Mauhab Al hamdani] berkata, telah menceritakan kepada kami [Al Laits] dari [Uqail] dari [Ibnu Syihab] bahwa [Abu Idris Al Khaulani 'Aidzaallah] telah mengabarkan kepadanya bahwa [Yazid bin Umairah] -salah seorang dari sahabat Mu'adz bin Jabal- mengabarkan kepadanya, ia berkata, \" [Mu'adz bin Jabal] tidak pernah duduk dalam sebuah majlis kecuali selalu berkata, \"Allah Maha Bijak, Allah Maha Adil, maka celakalah orang-orang yang merasa ragu.\" Suatu hari Mu'adz berkata, \"Di belakang kalian akan terjadi fitnah, harta semakin melimpah, Al Al Quran akan muda dibaca oleh siapa saja; seorang mukmin, munafik, laki-laki, wanita, anak kecil, orang dewasa, budak atau pun orang merdeka. Sehingga seseorang berkata, 'Kenapa orang-orang tidak mengikuti aku, padahal aku telah membaca Al-Qur'an! Sungguh, mereka tidak mengikuti kecuali aku melakukan bid'ah. ' Maka berhati-hatilah kalian dari bid'ah, sesungguhnya bi'dah akan membawa kepada kesesatan. Dan berhati-hatilah kalian dari hakim yang menyimpang, sebab setan akan mengucapkan kesasatan (kebathilan) melalui lisan hakim tersebut. Dan sungguh, seorang munafik terkadang akan mengucapkan kata-kata yang benar.\" Yazid berkata, \"Aku bertanya kepada Mu'adz, \"Semoga Allah merahmatimu, apakah aku pernah tahu dengan seorang hakim yang terkadang akan mengatakan sesuatu yang sesat dan munafik yang akan mengatakan sesuatu yang benar' ia menjawab, \"Ya. berhati-hatilah dengan perkataan hakim yang menyimpang (samar karena kebathilan) yang orang-orang mengingkarinya dan berkata; apa ini?. Meski demikian, janganlah kalian mengucilkannya. Sebab kemungkinan ia akan kembali kepada kebenaran hingga kamu dapat mendengar kebenaran darinya. karena di atas kebenaran pasti ada cahaya.\" Abu Dawud berkata, \" [Ma'mar] menyebutkan dari [Az Zuhri] dalam hadits ini, dengan lafdh berbeda yaitu; 'walaa yuts`iyannaka dzalikan 'ahu' (sekali-kali yang demikian itu janganlah membuatmu menyimpang) bukan \"yutsniyannaka\".\" [Shalih bin Kisan] menyebutkan dari [Az Zuhri], dengan lafadh, \"Musyabbihat\" sebagai ganti \"musytahirat\". Ia (perawi) menyebutkan, 'jangan menjauhkan kamu dari jalan yang lurus', yaitu seperti yang disebutkan oleh [Uqail].\" [Ibnu Ishaq] menyebutkan dari [Az Zuhri], \"Ia menjawab, \"Benar, perkataan hakim yang kamu merasa rancu darinya, hingga kamu mengingkarinya dan mengatakan, \"Apa yang ia inginkan dari perkataan ini?\""
            },
            {
                "number": 3996,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ كَتَبَ رَجُلٌ إِلَى عُمَرَ بْنِ عَبْدِ الْعَزِيزِ يَسْأَلُهُ عَنْ الْقَدَرِ ح و حَدَّثَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ الْمُؤَذِّنُ قَالَ حَدَّثَنَا أَسَدُ بْنُ مُوسَى قَالَ حَدَّثَنَا حَمَّادُ بْنُ دُلَيْلٍ قَالَ سَمِعْتُ سُفْيَانَ الثَّوْرِيَّ يُحَدِّثُنَا عَنِ النَّضْرِ ح و حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ قَبِيصَةَ قَالَ حَدَّثَنَا أَبُو رَجَاءٍ عَنْ أَبِي الصَّلْتِ وَهَذَا لَفْظُ حَدِيثِ ابْنِ كَثِيرٍ وَمَعْنَاهُمْ قَالَ كَتَبَ رَجُلٌ إِلَى عُمَرَ بْنِ عَبْدِ الْعَزِيزِ يَسْأَلُهُ عَنْ الْقَدَرِ فَكَتَبَ أَمَّا بَعْدُ أُوصِيكَ بِتَقْوَى اللَّهِ وَالِاقْتِصَادِ فِي أَمْرِهِ وَاتِّبَاعِ سُنَّةِ نَبِيِّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَتَرْكِ مَا أَحْدَثَ الْمُحْدِثُونَ بَعْدَ مَا جَرَتْ بِهِ سُنَّتُهُ وَكُفُوا مُؤْنَتَهُ فَعَلَيْكَ بِلُزُومِ السُّنَّةِ فَإِنَّهَا لَكَ بِإِذْنِ اللَّهِ عِصْمَةٌ ثُمَّ اعْلَمْ أَنَّهُ لَمْ يَبْتَدِعْ النَّاسُ بِدْعَةً إِلَّا قَدْ مَضَى قَبْلَهَا مَا هُوَ دَلِيلٌ عَلَيْهَا أَوْ عِبْرَةٌ فِيهَا فَإِنَّ السُّنَّةَ إِنَّمَا سَنَّهَا مَنْ قَدْ عَلِمَ مَا فِي خِلَافِهَا وَلَمْ يَقُلْ ابْنُ كَثِيرٍ مَنْ قَدْ عَلِمَ مِنْ الْخَطَإِ وَالزَّلَلِ وَالْحُمْقِ وَالتَّعَمُّقِ فَارْضَ لِنَفْسِكَ مَا رَضِيَ بِهِ الْقَوْمُ لِأَنْفُسِهِمْ فَإِنَّهُمْ عَلَى عِلْمٍ وَقَفُوا وَبِبَصَرٍ نَافِذٍ كَفُّوا وَهُمْ عَلَى كَشْفِ الْأُمُورِ كَانُوا أَقْوَى وَبِفَضْلِ مَا كَانُوا فِيهِ أَوْلَى فَإِنْ كَانَ الْهُدَى مَا أَنْتُمْ عَلَيْهِ لَقَدْ سَبَقْتُمُوهُمْ إِلَيْهِ وَلَئِنْ قُلْتُمْ إِنَّمَا حَدَثَ بَعْدَهُمْ مَا أَحْدَثَهُ إِلَّا مَنْ اتَّبَعَ غَيْرَ سَبِيلِهِمْ وَرَغِبَ بِنَفْسِهِ عَنْهُمْ فَإِنَّهُمْ هُمْ السَّابِقُونَ فَقَدْ تَكَلَّمُوا فِيهِ بِمَا يَكْفِي وَوَصَفُوا مِنْهُ مَا يَشْفِي فَمَا دُونَهُمْ مِنْ مَقْصَرٍ وَمَا فَوْقَهُمْ مِنْ مَحْسَرٍ وَقَدْ قَصَّرَ قَوْمٌ دُونَهُمْ فَجَفَوْا وَطَمَحَ عَنْهُمْ أَقْوَامٌ فَغَلَوْا وَإِنَّهُمْ بَيْنَ ذَلِكَ لَعَلَى هُدًى مُسْتَقِيمٍ كَتَبْتَ تَسْأَلُ عَنْ الْإِقْرَارِ بِالْقَدَرِ فَعَلَى الْخَبِيرِ بِإِذْنِ اللَّهِ وَقَعْتَ مَا أَعْلَمُ مَا أَحْدَثَ النَّاسُ مِنْ مُحْدَثَةٍ وَلَا ابْتَدَعُوا مِنْ بِدْعَةٍ هِيَ أَبْيَنُ أَثَرًا وَلَا أَثْبَتُ أَمْرًا مِنْ الْإِقْرَارِ بِالْقَدَرِ لَقَدْ كَانَ ذَكَرَهُ فِي الْجَاهِلِيَّةِ الْجُهَلَاءُ يَتَكَلَّمُونَ بِهِ فِي كَلَامِهِمْ وَفِي شِعْرِهِمْ يُعَزُّونَ بِهِ أَنْفُسَهُمْ عَلَى مَا فَاتَهُمْ ثُمَّ لَمْ يَزِدْهُ الْإِسْلَامُ بَعْدُ إِلَّا شِدَّةً وَلَقَدْ ذَكَرَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَيْرِ حَدِيثٍ وَلَا حَدِيثَيْنِ وَقَدْ سَمِعَهُ مِنْهُ الْمُسْلِمُونَ فَتَكَلَّمُوا بِهِ فِي حَيَاتِهِ وَبَعْدَ وَفَاتِهِ يَقِينًا وَتَسْلِيمًا لِرَبِّهِمْ وَتَضْعِيفًا لِأَنْفُسِهِمْ أَنْ يَكُونَ شَيْءٌ لَمْ يُحِطْ بِهِ عِلْمُهُ وَلَمْ يُحْصِهِ كِتَابُهُ وَلَمْ يَمْضِ فِيهِ قَدَرُهُ وَإِنَّهُ مَعَ ذَلِكَ لَفِي مُحْكَمِ كِتَابِهِ مِنْهُ اقْتَبَسُوهُ وَمِنْهُ تَعَلَّمُوهُ وَلَئِنْ قُلْتُمْ لِمَ أَنْزَلَ اللَّهُ آيَةَ كَذَا لِمَ قَالَ كَذَا لَقَدْ قَرَءُوا مِنْهُ مَا قَرَأْتُمْ وَعَلِمُوا مِنْ تَأْوِيلِهِ مَا جَهِلْتُمْ وَقَالُوا بَعْدَ ذَلِكَ كُلِّهِ بِكِتَابٍ وَقَدَرٍ وَكُتِبَتِ الشَّقَاوَةُ وَمَا يُقْدَرْ يَكُنْ وَمَا شَاءَ اللَّهُ كَانَ وَمَا لَمْ يَشَأْ لَمْ يَكُنْ وَلَا نَمْلِكُ لِأَنْفُسِنَا ضَرًّا وَلَا نَفْعًا ثُمَّ رَغِبُوا بَعْدَ ذَلِكَ وَرَهِبُوا",
                "id": "Telah menceritakan kepada kami Muhammad bin katsir ia berkata: telah menceritakan kepada kami Sufyan ia berkata: seorang laki-laki menulis surat kepada Umar bin Abdul Aziz bertanya tentang takdir. (dalam jalur lain disebutkan) Telah menceritakan kepada kami Ar Rabi' bin Sulaiman Al Muadzdzin ia berkata: telah menceritakan kepada kami Asad bin Musa ia berkata: telah menceritakan kepada kami Hammad bin Dulail ia berkata: Aku mendengar Sufyan Ats Tsauri menceritakan kepada kami dari An Nadhr. (dalam jalur lain disebutkan) Telah menceritakan kepada kami Hannad bin As Sari dari Qabishah ia berkata: telah menceritakan kepada kami Abu Raja' dari Abu Ash Shalt -dan ini adalah hadits Ibnu Katsir- ia berkata: \"Seorang laki-laki menulis surat kepada Umar bin Abdul Aziz bertanya tentang takdir. Umar bin Abdul Aziz lalu menulis balasan: Amma Ba'du. Aku berwasiat kepadamu agar bertakwa kepada Allah dan konsisten (tidak menambah dan mengurangi) dalam melaksanakan perintah-Nya, mengikuti sunnah Nabi-Nya shallallahu 'alaihi wa sallam dan meninggalkan apa yang diada-adakan oleh orang-orang yang membuat hal baru setelah berlaku sunnahnya, padahal mereka telah dicukupkan dengan sunnah beliau. Hendaklah engkau berpegang teguh dengan sunnah, sebab dengan izin Allah ia akan menjagamu dari kesesatan. Ketahuilah, tidaklah orang-orang membuat suatu kebid'ahan kecuali telah ada dalil yang menjelaskan tentang hal itu, atau pelajaran yang bisa diambil keterangannya. Sesungguhnya sunnah itu, yang menjadi sumbernya adalah Dia (Allah dan Rasul-Nya) yang telah mengetahui kebalikannya -Ibnu Katsir tidak menyebutkan: \"yang mengetahui berbagai kesalahan- kekeliruan dan kebodohan serta penyulitan diri. Maka ridla-lah dengan apa-apa yang dipegang oleh orang-orang sebelum kamu (para sahabat). Karena mereka (para sahabat), dengan ketinggian ilmu yang dimiliki, serta kecerdasan yang cemerlang mereka juga tetap menahan diri. Padahal dari sisi keilmuan mereka lebih paham, dan dari sisi keutamaan mereka lebih layak untuk memperbincangkannya. Jika kebenaran itu ada pada kalian, maka kalian telah mendahului mereka. Jika kalian katakan hanyasanya terjadi perkara baru setelah mereka yang tidak diada-adakan kecuali oleh orang yang tidak mengikuti petunjuk mereka (para sahabat) dan ridla dengan pemikirannya sendiri dari pada pemikiran mereka, ketahuilah sesungguhnya para sahabat adalah orang-orang yang lebih dahulu mendapati permasalahan ini. Mereka berbicara (masalah takdir) hanya sekedarnya, mereka tidak terlalu menyepelekan namun tidak juga terlalu berlebihan, sungguh telah ada orang-orang selain mereka yang terlalu menyepelekan hingga mereka jauh berpaling, dan ada juga yang terlalu bersemangat hingga mereka berlebih-lebihan (melampui batas). Dan sesungguhnya sikap para sahabat di antara yang demikian yakni berada di atas jalan yang lurus. Kamu telah menulis surat menanyakan tentang menyakini adanya takdir, maka -dengan izin Allah- engkau telah tepat memilih orangnya (tanya kepada saya). Aku tidak mengetahui sesuatu yang baru atau perkara bid'ah yang dimunculkan oleh manusia, yang dampaknya sangat jelas dan pasti kecuali dalam permasalahan mengakui takdir. Orang-orang bodoh pada masa jahiliyyah saja telah memperbincangkan pengakuan taqdir dalam ucapan-ucapan dan syair mereka terhadap kenikmatan yang hilang dari mereka, kemudian Islam datang dan semakin mempertegasnya lagi, Rasulullah shallallahu 'alaihi wa sallam telah mengingatkan tidak hanya dalam satu hadits atau dua hadits, kaum muslimin juga telah mendengarnya dari beliau, mereka membicarakan takdir baik ketika beliau masih hidup atau sepeninggal beliau dengan sikap yakin dan menerima terhadap Rabb mereka serta merendah diri bahwa tidak ada sesuatu melainkan telah dahulu Ilmu (pengetahuan) Allah terhadapnya dan telah tertulis dalam kitab-Nya (Al Lauhul mahfudh), serta telah ditentukan takdirnya oleh-Nya. Selain dari itu, persoalan takdir telah dijelaskan dalam muhkam kitab-Nya (ayat-ayat Al Quran yang jelas maknanya), mereka mengutipnya serta belajar darinya. Jika kalian tanyakan, 'kenapa Allah menurunkan ayat seperti ini, mengapa Dia menyatakan yang demikian?' sesungguhnya para sahabat juga telah membacanya sebagaimana kalian membaca. Mereka mengetahui bagaimana ta'wilnya yang kalian sendiri tidak tahu dan setelah itu semua, mereka berkata: \"kami beriman terhadap kitab (lauhul mahfudh) dan taqdir, dan kesengsaraan telah tertuliskan, maka apa yang telah ditakdirkan pasti akan terjadi. Apa yang Allah kehendaki pasti akan terjadi dan apa yang tidak Allah kehendaki pasti tidak akan terjadi. Sungguh, kita semua tidak mempunyai daya dan upaya untuk menolak madlarat atau mengambil manfaat.\" Maka setelah itu mereka ridla dan merasa takut untuk memperbincangkan masalah takdir.\""
            },
            {
                "number": 3997,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ قَالَ حَدَّثَنَا سَعِيدٌ يَعْنِي ابْنَ أَبِي أَيُّوبَ قَالَ أَخْبَرَنِي أَبُو صَخْرٍ عَنْ نَافِعٍ قَالَكَانَ لِابْنِ عُمَرَ صَدِيقٌ مِنْ أَهْلِ الشَّامِ يُكَاتِبُهُ فَكَتَبَ إِلَيْهِ عَبْدُ اللَّهِ بْنُ عُمَرَ إِنَّهُ بَلَغَنِي أَنَّكَ تَكَلَّمْتَ فِي شَيْءٍ مِنْ الْقَدَرِ فَإِيَّاكَ أَنْ تَكْتُبَ إِلَيَّ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّهُ سَيَكُونُ فِي أُمَّتِي أَقْوَامٌ يُكَذِّبُونَ بِالْقَدَرِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] ia berkata; telah menceritakan kepada kami [Abdullah bin Yazid] ia berkata; telah menceritakan kepada kami [Sa'id] -maksudnya Said bin Abu Ayyub- ia berkata; telah mengabarkan kepadaku [Abu Shakr] dari [Nafi'] ia berkata, \"Ibnu Umar mempunyai seorang sahabat dari Syam yang menulis surat kepadanya, [Ibnu Umar] lantas menulis surat balasan yang isinya, \"Telah sampai kabar kepadaku bahwa engkau mempermasalahkan tentang takdir, maka janganlah engkau tanyakan hal itu kepdaku. Sungguh aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Akan ada dari umatku orang-orang yang mendustakan takdir.\""
            },
            {
                "number": 3998,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْجَرَّاحِ قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ خَالِدٍ الْحَذَّاءِ قَالَ قُلْتُ لِلْحَسَنِيَا أَبَا سَعِيدٍ أَخْبِرْنِي عَنْ آدَمَ أَلِلسَّمَاءِ خُلِقَ أَمْ لِلْأَرْضِ قَالَ لَا بَلْ لِلْأَرْضِ قُلْتُ أَرَأَيْتَ لَوْ اعْتَصَمَ فَلَمْ يَأْكُلْ مِنْ الشَّجَرَةِ قَالَ لَمْ يَكُنْ لَهُ مِنْهُ بُدٌّ قُلْتُ أَخْبِرْنِي عَنْ قَوْلِهِ تَعَالَى{ مَا أَنْتُمْ عَلَيْهِ بِفَاتِنِينَ إِلَّا مَنْ هُوَ صَالِ الْجَحِيمِ }قَالَ إِنَّ الشَّيَاطِينَ لَا يَفْتِنُونَ بِضَلَالَتِهِمْ إِلَّا مَنْ أَوْجَبَ اللَّهُ عَلَيْهِ الْجَحِيمَ",
                "id": "Telah menceritakan kepada kami [Abdullah Ibnul Jarrah] ia berkata; telah menceritakan kepada kami [Hammad bin Zaid] dari [Khalid Al Hadzdza] ia berkata; Aku berkata kepada [Al Hasan], \"Wahai Abu Sa'id, beritahukanlah aku tentang Nabi Adam, apakah ia dicipta untuk langit atau untuk bumi?\" Ia menjawab, \"Untuk bumi.\" Aku bertanya lagi, \"Apa pendapatmu sekiranya Adam tidak makan buah khuldi?\" Ia menjawab, \"Itu tidak menjadi keharusan baginya.\" Aku berkata, \"Kabarkanlah kepadaku tentang firman Allah: (Sekali-kali tidak dapat menyesatkan kecuali (seseorang) terhadap Allah, kecuali orang-orang yang akan masuk neraka yang menyala). -Qs. Ash Shaffaat: 162-163- Abu Said menjawab; \"Sesungguhnya setan akan menggoda dengan kesesatan mereka, kecuali orang yang telah Allah wajibkan (tetapkan) neraka Al Jahim atasnya.\""
            },
            {
                "number": 3999,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ حَدَّثَنَا خَالِدٌ الْحَذَّاءُ عَنْ الْحَسَنِفِي قَوْلِهِ تَعَالَى{ وَلِذَلِكَ خَلَقَهُمْ }قَالَ خَلَقَ هَؤُلَاءِ لِهَذِهِ وَهَؤُلَاءِ لِهَذِهِ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Hammad] berkata, telah menceritakan kepada kami [Khalid Al Hadzdza] dari [Al Hasan] tentang firman Allah Ta'ala: '(dan untuk itulah Allah menciptakan mereka) ' -Qs. Huud: 119-. Ia menjawab, \"Allah telah menciptakan sekelompok orang untuk ini (syurga) dan sekelompok yang lain untuk ini (neraka).\""
            },
            {
                "number": 4000,
                "arab": "حَدَّثَنَا أَبُو كَامِلٍ حَدَّثَنَا إِسْمَعِيلُ حَدَّثَنَا خَالِدٌ الْحَذَّاءُ قَالَ قُلْتُ لِلْحَسَنِ { مَا أَنْتُمْ عَلَيْهِ بِفَاتِنِينَ إِلَّا مَنْ هُوَ صَالِ الْجَحِيمِ } قَالَ إِلَّا مَنْ أَوْجَبَ اللَّهُ تَعَالَى عَلَيْهِ أَنَّهُ يَصْلَى الْجَحِيمَ",
                "id": "Telah menceritakan kepada kami Abu Kamil berkata, telah menceritakan kepada kami Isma'il berkata, telah menceritakan kepada kami Khalid Al Hadzdza ia berkata, \"Aku bertanya kepada Al Hasan tentang ayat: '(Sekali-kali tidak dapat menyesatkan (seseorang) terhadap Allah, kecuali orang-orang yang akan masuk neraka yang menyala).\" -Qs. Ash Shaffaat: 163-. Al Hasan menjawab, \"maksudnya kecuali orang-orang yang telah Allah tetapkan akan masuk neraka Al Jahim.\""
            },
            {
                "number": 4001,
                "arab": "حَدَّثَنَا هِلَالُ بْنُ بِشْرٍ قَالَ حَدَّثَنَا حَمَّادٌ قَالَ أَخْبَرَنِي حُمَيْدٌ كَانَ الْحَسَنُ يَقُولُلَأَنْ يُسْقَطَ مِنْ السَّمَاءِ إِلَى الْأَرْضِ أَحَبُّ إِلَيْهِ مِنْ أَنْ يَقُولَ الْأَمْرُ بِيَدِي",
                "id": "Telah menceritakan kepada kami [Hilal bin Bisyr] ia berkata; telah menceritakan kepada kami [Hammad] ia berkata; telah mengabarkan kepadaku [Humaid] berkata; [Al Hasan] berkata, \"Dijatuhkannya (adam) dari langit ke bumi lebih disukai daripada harus mengatakan segala urusan ada di tanganku (meniadakan takdir).\""
            },
            {
                "number": 4002,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ قَالَ حَدَّثَنَا حَمَّادٌ حَدَّثَنَا حُمَيْدٌ قَالَ قَدِمَ عَلَيْنَا الْحَسَنُ مَكَّةَفَكَلَّمَنِي فُقَهَاءُ أَهْلِ مَكَّةَ أَنْ أُكَلِّمَهُ فِي أَنْ يَجْلِسَ لَهُمْ يَوْمًا يَعِظُهُمْ فِيهِ فَقَالَ نَعَمْ فَاجْتَمَعُوا فَخَطَبَهُمْ فَمَا رَأَيْتُ أَخْطَبَ مِنْهُ فَقَالَ رَجُلٌ يَا أَبَا سَعِيدٍ مَنْ خَلَقَ الشَّيْطَانَ فَقَالَ سُبْحَانَ اللَّهِ هَلْ مِنْ خَالِقٍ غَيْرُ اللَّهِ خَلَقَ اللَّهُ الشَّيْطَانَ وَخَلَقَ الْخَيْرَ وَخَلَقَ الشَّرَّ قَالَ الرَّجُلُ قَاتَلَهُمْ اللَّهُ كَيْفَ يَكْذِبُونَ عَلَى هَذَا الشَّيْخِ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] ia berkata; telah menceritakan kepada kami [Hammad] berkata, telah menceritakan kepada kami [Humaid] ia berkata, \" [Al Hasan] mendatangi kami di Makkah, lalu para ulama Makkah berbicara kepadaku agar aku menyampaikan kepadanya permohonan mereka supaya Al Hasan bersedia meluangkan waktu untuk memberikan nasihat kepada mereka. Al Hasan lalu menjawab, \"Ya.\" Orang-orang lantas berkumpul dan Al Hasan berkhutbah di hadapan mereka, dan aku tidak pernah melihat seseorang berkhuthbah sebaik dirinya. kemudian ada seorang laki-laki berkata, \"Wahai Abu Sa'id, siapakah yang menciptakan setan?\" Al Hasan menjawab, \"Maha Suci Allah! Adakah pencipta selain Allah? Allah-lah yang menciptakan setan, kebaikan dan keburukkan.\" Laki-laki itu berkata lagi, \"Semoga Allah melaknat mereka semua, bagaimana mungkin mereka mendustai penjelasan syaikh ini.\""
            },
            {
                "number": 4003,
                "arab": "حَدَّثَنَا ابْنُ كَثِيرٍ قَالَ أَخْبَرَنَا سُفْيَانُ عَنْ حُمَيْدٍ الطَّوِيلِ عَنْ الْحَسَنِ { كَذَلِكَ نَسْلُكُهُ فِي قُلُوبِ الْمُجْرِمِينَ } قَالَ الشِّرْكُ",
                "id": "Telah menceritakan kepada kami Ibnu Katsir ia berkata: telah mengabarkan kepada kami Sufyan dari Humaid Ath Thawil dari Al Hasan Tentang firman Allah: {Demikianlah kami memasukkan (rasa ingkar dan memperolok-olok itu) ke dalam hati orang-orang yang berdosa (orang-orang kafir)} (Al Hijr: 12) Ia berkata: \"Itu adalah syirik.\""
            },
            {
                "number": 4004,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ قَالَ أَخْبَرَنَا سُفْيَانُ عَنْ رَجُلٍ قَدْ سَمَّاهُ غَيْرِ ابْنِ كَثِيرٍ عَنْ سُفْيَانَ عَنْ عُبَيْدٍ الصِّيدِ عَنْ الْحَسَنِفِي قَوْلِ اللَّهِ عَزَّ وَجَلَّ{ وَحِيلَ بَيْنَهُمْ وَبَيْنَ مَا يَشْتَهُونَ }قَالَ بَيْنَهُمْ وَبَيْنَ الْإِيمَانِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] ia berkata; telah mengabarkan kepada kami [Sufyan] dari [seorang laki-laki] yang banyak disebut namanya kecuali Ibnu Katsir, dari [Sufyan] dari [Ubaid Ash Shaid] dari [Al hasan] tentang firman Allah Azza Wa Jalla: '(Dan dihalangi antara mereka dengan apa yang mereka ingini….) ' -Qs. Saba: 54- ia berkata, \"Yaitu antara mereka dengan keimanan.\""
            },
            {
                "number": 4005,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ حَدَّثَنَا سُلَيْمٌ عَنْ ابْنِ عَوْنٍ قَالَكُنْتُ أَسِيرُ بِالشَّامِ فَنَادَانِي رَجُلٌ مِنْ خَلْفِي فَالْتَفَتُّ فَإِذَا رَجَاءُ بْنُ حَيْوَةَ فَقَالَ يَا أَبَا عَوْنٍ مَا هَذَا الَّذِي يَذْكُرُونَ عَنْ الْحَسَنِ قَالَ قُلْتُ إِنَّهُمْ يَكْذِبُونَ عَلَى الْحَسَنِ كَثِيرًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ubaid] berkata, telah menceritakan kepada kami [Sulaim] dari [Ibnu Aun] ia berkata, \"Ketika aku berjalan menuju Syam, seseorang memanggilku dari belakang, saat aku menoleh ke belakang ternyata orang itu adalah Raja` bin Haiwah. Ia lalu berkata, \"Wahai Abu Aun, apa yang diceritakan orang tentang Al Hasan?\" Aku menjawab, \"Mereka banyak mendustakan Al Hasan.\""
            },
            {
                "number": 4006,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ قَالَ حَدَّثَنَا حَمَّادٌ قَالَ سَمِعْتُ أَيُّوبَ يَقُولُكَذَبَ عَلَى الْحَسَنِ ضَرْبَانِ مِنْ النَّاسِ قَوْمٌ الْقَدَرُ رَأْيُهُمْ وَهُمْ يُرِيدُونَ أَنْ يُنَفِّقُوا بِذَلِكَ رَأْيَهُمْ وَقَوْمٌ لَهُ فِي قُلُوبِهِمْ شَنَآنٌ وَبُغْضٌ يَقُولُونَ أَلَيْسَ مِنْ قَوْلِهِ كَذَا أَلَيْسَ مِنْ قَوْلِهِ كَذَا",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] ia berkata; telah menceritakan kepada kami [Hammad] ia berkata; Aku mendengar [Ayyub] berkata, \"Ada dua kelompok yang mendustakan Al Hasan; kelompok yang mengatakan bahwa takdir adalah kreasi mereka sendiri, mereka ingin menyebarkan fitnah kemunafikkan dengan pernyataan mereka itu; kelompok yang hatinya benci kepada Al Hasan. Mereka berkata, \"Bukahkah Al Hasan mengatakan begini? Bukankah Al Hasan mengatakan begini?\""
            },
            {
                "number": 4007,
                "arab": "حَدَّثَنَا ابْنُ الْمُثَنَّى أَنَّ يَحْيَى بْنَ كَثِيرٍ الْعَنْبَرِيَّ حَدَّثَهُمْ قَالَ كَانَ قُرَّةُ بْنُ خَالِدٍ يَقُولُ لَنَا يَا فِتْيَانُ لَا تُغْلَبُوا عَلَى الْحَسَنِ فَإِنَّهُ كَانَ رَأْيُهُ السُّنَّةَ وَالصَّوَابَ",
                "id": "Telah menceritakan kepada kami Ibnu Al Mutsanna bahwa Yahya bin Katsir Al 'Anbari menceritakan kepada mereka, ia berkata: Qurrrah bin Khalid berkata kepada kami: \"Wahai para pemuda, janganlah kalian terkelabui terhadap Al Hasan, karena sesungguhnya pendapat Al Hasan adalah sunnah dan kebenaran.\""
            },
            {
                "number": 4008,
                "arab": "حَدَّثَنَا ابْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُؤَمَّلُ بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ ابْنِ عَوْنٍ قَالَ لَوْ عَلِمْنَا أَنَّ كَلِمَةَ الْحَسَنِ تَبْلُغُ مَا بَلَغَتْ لَكَتَبْنَا بِرُجُوعِهِ كِتَابًا وَأَشْهَدْنَا عَلَيْهِ شُهُودًا وَلَكِنَّا قُلْنَا كَلِمَةٌ خَرَجَتْ لَا تُحْمَلُ",
                "id": "Telah menceritakan kepada kami Ibnu Al Mutsanna dan Ibnu Basysyar, keduanya berkata: telah menceritakan kepada kami Muammal bin Isma'il telah menceritakan kepada kami Hammad bin Zaid dari Ibnu 'Aun ia berkata: \"Seandainya kami mengetahui bahwa ucapan Al Hasan akan sampai seperti yang telah terjadi, tentu kami akan menuliskan ralat darinya dan mempersaksikannya dengan para saksi. Namun kami menganggap itu hanyalah ucapan yang telah terlanjur keluar.\""
            },
            {
                "number": 4009,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ قَالَ قَالَ لِي الْحَسَنُ مَا أَنَا بِعَائِدٍ إِلَى شَيْءٍ مِنْهُ أَبَدًا",
                "id": "Telah menceritakan kepada kami Sulaiman bin Harb ia berkata: telah menceritakan kepada kami Hammad bin Zaid dari Ayyub ia berkata: Al Hasan berkata kepadaku: \"Aku tidak akan pernah kembali menarik pendapatku itu selama-lamanya.\""
            },
            {
                "number": 4010,
                "arab": "حَدَّثَنَا هِلَالُ بْنُ بِشْرٍ قَالَ حَدَّثَنَا عُثْمَانُ بْنُ عُثْمَانَ عَنْ عُثْمَانَ الْبَتِّيِّ قَالَ مَا فَسَّرَ الْحَسَنُ آيَةً قَطُّ إِلَّا عَنْ الْإِثْبَاتِ",
                "id": "Telah menceritakan kepada kami Hilal bin Bisyr ia berkata: telah menceritakan kepada kami Utsman bin Utsman dari Utsman Al Batti ia berkata: \"Al Hasan tidak pernah menafsirkan satu ayat pun kecuali dengan penuh keyakinan dan penetapan.\""
            },
            {
                "number": 4011,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَكُنَّا نَقُولُ فِي زَمَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نَعْدِلُ بِأَبِي بَكْرٍ أَحَدًا ثُمَّ عُمَرَ ثُمَّ عُثْمَانَ ثُمَّ نَتْرُكُ أَصْحَابَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نُفَاضِلُ بَيْنَهُمْ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Aswad bin Amir] berkata, telah menceritakan kepada kami [Abdul Aziz bin Abu Salamah] dari [Ubaidullah] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Pada masa Nabi shallallahu 'alaihi wasallam kami berkata, 'Kami tidak membandingkan antara Abu Bakar dengan seorang pun, begitu juga dengan Umar dan Utsman. Dan kami tidak pernah membanding-bandingkan antara para sahabat Nabi.\""
            },
            {
                "number": 4012,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا عَنْبَسَةُ حَدَّثَنَا يُونُسُ عَنْ ابْنِ شِهَابٍ قَالَ قَالَ سَالِمُ بْنُ عَبْدِ اللَّهِ إِنَّ ابْنَ عُمَرَ قَالَكُنَّا نَقُولُ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَيٌّ أَفْضَلُ أُمَّةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَهُ أَبُو بَكْرٍ ثُمَّ عُمَرُ ثُمَّ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُمْ أَجْمَعِينَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] berkata, telah menceritakan kepada kami [Anbasah] berkata, telah menceritakan kepada kami [Yunus] dari [Ibnu Syihab] ia berkata; [Salim bin Abdullah] berkata; [Ibnu Umar] berkata, \"Kami pernah mengatakan sesuatu saat Nabi shallallahu 'alaihi wasallam masih hidup, \"Yang paling utama di antara umat Nabi shallallahu 'alaihi wasallam setelah beliau adalah Abu Bakar, lalu Umar, lalu Utsman. Semoga Allah meridhai mereka semua.\""
            },
            {
                "number": 4013,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ حَدَّثَنَا سُفْيَانُ حَدَّثَنَا جَامِعُ بْنُ أَبِي رَاشِدٍ حَدَّثَنَا أَبُو يَعْلَى عَنْ مُحَمَّدِ ابْنِ الْحَنَفِيَّةِ قَالَ قُلْتُ لِأَبِيأَيُّ النَّاسِ خَيْرٌ بَعْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَبُو بَكْرٍ قَالَ قُلْتُ ثُمَّ مَنْ قَالَ ثُمَّ عُمَرُ قَالَ ثُمَّ خَشِيتُ أَنْ أَقُولَ ثُمَّ مَنْ فَيَقُولَ عُثْمَانُ فَقُلْتُ ثُمَّ أَنْتَ يَا أَبَةِ قَالَ مَا أَنَا إِلَّا رَجُلٌ مِنْ الْمُسْلِمِينَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] berkata, telah menceritakan kepada kami [Sufyan] berkata, telah menceritakan kepada kami [Jami' bin Abu Rasyid] berkata, telah menceritakan kepada kami [Abu Ya'la] dari [Muhammad bin Al Hanafiyah] ia berkata, \"Aku bertanya kepada [bapakku], \"Siapakah manusia yang paling baik setelah Rasulullah shallallahu 'alaihi wasallam?\"Iia menjawab, \"Abu Bakar.\" Aku bertanya lagi, \"Kemudian siapa lagi?\" Ia menjawab, \"Umar.\" Muhammad bin Al hanafiyah berkata, \"Lalu timbul kecemasan jika aku bertanya 'lalu siapa lagi, kemudian ia menjawab 'Utsman'.\" Aku lalu bertanya, \"Apakah setelah itu engkau wahai bapakku?\" Ia menjawab, \"Aku hanyalah seorang laki-laki dari kaum muslimin.\""
            },
            {
                "number": 4014,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مِسْكِينٍ حَدَّثَنَا مُحَمَّدٌ يَعْنِي الْفِرْيَابِيَّ قَالَ سَمِعْتُ سُفْيَانَ يَقُولُمَنْ زَعَمَ أَنَّ عَلِيًّا عَلَيْهِ السَّلَام كَانَ أَحَقَّ بِالْوِلَايَةِ مِنْهُمَا فَقَدْ خَطَّأَ أَبَا بَكْرٍ وَعُمَرَ وَالْمُهَاجِرِينَ وَالْأَنْصَارَ وَمَا أُرَاهُ يَرْتَفِعُ لَهُ مَعَ هَذَا عَمَلٌ إِلَى السَّمَاءِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Miskin] berkata, telah menceritakan kepada kami [Muhammad] -maksudnya Muhammad Al Firyabi- ia berkata; Aku mendengar [Sufyan] berkata, \"Siapa yang menyakini bahwa Ali Alaihis Salam lebih berhak untuk menjadi penguasa dari keduanya (Abu Bakar dan Umar), maka ia telah menyalahi Abu Bakar, Umar dan kaum Muhajirin dan Anshar. Dengan keyakinan dia seperti itu, maka aku melihat bahwa amalan baiknya tidak akan naik ke langit.\""
            },
            {
                "number": 4015,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ حَدَّثَنَا قَبِيصَةُ حَدَّثَنَا عَبَّادٌ السَّمَّاكُ قَالَ سَمِعْتُ سُفْيَانَ الثَّوْرِيَّ يَقُولُالْخُلَفَاءُ خَمْسَةٌ أَبُو بَكْرٍ وَعُمَرُ وَعُثْمَانُ وَعَلِيٌّ وَعُمَرُ بْنُ عَبْدِ الْعَزِيزِ رَضِيَ اللَّهُ عَنْهُمْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris] berkata, telah menceritakan kepada kami [Qabishah] berkata, telah menceritakan kepada kami [Abbad As Sammak] ia berkata, \"Aku mendengar [Sufyan Ats Tsauri] berkata, \"Khalifah (pemimpin) itu ada lima; Abu Bakar, Umar, Utsman, Ali dan Umar bin Abdul Aziz radliallahu 'anhum (semoga Allah meridhoi mereka).\""
            },
            {
                "number": 4016,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ مُحَمَّدٌ كَتَبْتُهُ مِنْ كِتَابِهِ قَالَ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ قَالَ كَانَ أَبُو هُرَيْرَةَ يُحَدِّثُأَنَّ رَجُلًا أَتَى إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنِّي أَرَى اللَّيْلَةَ ظُلَّةً يَنْطِفُ مِنْهَا السَّمْنُ وَالْعَسَلُ فَأَرَى النَّاسَ يَتَكَفَّفُونَ بِأَيْدِيهِمْ فَالْمُسْتَكْثِرُ وَالْمُسْتَقِلُّ وَأَرَى سَبَبًا وَاصِلًا مِنْ السَّمَاءِ إِلَى الْأَرْضِ فَأَرَاكَ يَا رَسُولَ اللَّهِ أَخَذْتَ بِهِ فَعَلَوْتَ بِهِ ثُمَّ أَخَذَ بِهِ رَجُلٌ آخَرُ فَعَلَا بِهِ ثُمَّ أَخَذَ بِهِ رَجُلٌ آخَرُ فَعَلَا بِهِ ثُمَّ أَخَذَ بِهِ رَجُلٌ آخَرُ فَانْقَطَعَ ثُمَّ وُصِلَ فَعَلَا بِهِ قَالَ أَبُو بَكْرٍ بِأَبِي وَأُمِّي لَتَدَعَنِّي فَلَأُعَبِّرَنَّهَا فَقَالَ اعْبُرْهَا قَالَ أَمَّا الظُّلَّةُ فَظُلَّةُ الْإِسْلَامِ وَأَمَّا مَا يَنْطِفُ مِنْ السَّمْنِ وَالْعَسَلِ فَهُوَ الْقُرْآنُ لِينُهُ وَحَلَاوَتُهُ وَأَمَّا الْمُسْتَكْثِرُ وَالْمُسْتَقِلُّ فَهُوَ الْمُسْتَكْثِرُ مِنْ الْقُرْآنِ وَالْمُسْتَقِلُّ مِنْهُ وَأَمَّا السَّبَبُ الْوَاصِلُ مِنْ السَّمَاءِ إِلَى الْأَرْضِ فَهُوَ الْحَقُّ الَّذِي أَنْتَ عَلَيْهِ تَأْخُذُ بِهِ فَيُعْلِيكَ اللَّهُ ثُمَّ يَأْخُذُ بِهِ بَعْدَكَ رَجُلٌ فَيَعْلُو بِهِ ثُمَّ يَأْخُذُ بِهِ رَجُلٌ آخَرُ فَيَعْلُو بِهِ ثُمَّ يَأْخُذُ بِهِ رَجُلٌ آخَرُ فَيَنْقَطِعُ ثُمَّ يُوصَلُ لَهُ فَيَعْلُو بِهِ أَيْ رَسُولَ اللَّهِ لَتُحَدِّثَنِّي أَصَبْتُ أَمْ أَخْطَأْتُ فَقَالَ أَصَبْتَ بَعْضًا وَأَخْطَأْتَ بَعْضًا فَقَالَ أَقْسَمْتُ يَا رَسُولَ اللَّهِ لَتُحَدِّثَنِّي مَا الَّذِي أَخْطَأْتُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُقْسِمْحَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ حَدَّثَنَا سُلَيْمَانُ بْنُ كَثِيرٍ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذِهِ الْقِصَّةِ قَالَ فَأَبَى أَنْ يُخْبِرَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris] berkata, telah menceritakan kepada kami [Abdurrazaq] -Muhammad berkata; aku pernah menulis dari dalam bukunya- ia berkata; telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Ubaidullah bin Abdullah] dari [Ibnu Abbas] ia berkata, \" [Abu Hurairah] pernah menceritakan bahwa ada seorang laki-laki datang menemui Rasulullah shallallahu 'alaihi wasallam seraya berkata, \"Pada suatu malam aku bermimpi melihat suatu naungan yang mengeluarkan minyak dan madu. Lalu aku melihat orang-orang saling berebut untuk mengambilnya dengan tangan, ada yang mendapat banyak dan ada yang mendapat sedikit. Kemudian aku melihat ada sesuatu yang membentang dari langit ke bumi, dan ternyata itu adalah engkau wahai Rasulullah. Engkau mengambilnya hingga engkau menjadi mulia, lalu ada seorang laki-laki lain yang mengambilnya dan ia pun menjadi mulia, lalu ada seorang laki-laki lain yang mengambilnya dan ia pun menjadi mulia karenanya. Kemudian ada seorang laki-laki lain yang mengambilnya dan terputuslah kemuliaan itu. Setelah itu disambungkan lagi hingga ia menjadi mulia karenanya.\" Abu Bakar berkata, \"Demi bapak dan ibuku, biarkan aku menafsirkan mimpi itu?\" beliau bersabda: \"Silahkan.\" Abu Bakar berkata, \"Naungan itu adalah Islam, minyak dan madu itu adalah kelembutan dan manisnya Al-Qur'an. Orang yang mendapat sedikit dan banyak dalam mimpi itu adalah orang yang sedikit atau banyaknya dalam membaca Al-Qur'an. Dan yang menjadi wasilah (perantara) antara langit dan bumi adalah kebenaran yang engkau ada padannya engkau mengambilnya hingga Allah meninggikan dan memuliakanmu. Lalu setelahmu ada seorang laki-laki yang mengambilnya dan ia menjadi mulia, lalu setelah itu ada seorang laki-laki lain yang mengambilnya dan ia juga menjadi mulia. Kemudian ada lagi laki-laki lain yang mengambilnya, namun kemuliaan itu terputus. Allah lalu menyambungnya kembali hingga laki-laki itu pun menjadi mulia. Wahai Rasulullah, katakanlah kepadaku, benar atau salah yang aku katakan ini?\" beliau menjawab: \"Sebagian benar dan sebagian salah.\" Abu Bakar berkata lagi, \"Wahai Rasulullah, aku bersumpah, tolong anda katakan apa yang salah?\" Nabi shallallahu 'alaihi wasallam lalu bersabda: \"Janganlah kamu bersumpah.\" Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris] berkata, telah menceritakan kepada kami [Muhammad bin Katsir] berkata, telah menceritakan kepada kami [Sulaiman bin Katsir] dari [Az Zuhri] dari [Ubaidullah bin Abdullah] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam, dengan kisah seperti ini. Ia berkata, \"Beliau menolak untuk mengabarkannya (Tafsiran Abu Bakar yang salah).\""
            },
            {
                "number": 4017,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْأَنْصَارِيُّ حَدَّثَنَا الْأَشْعَثُ عَنْ الْحَسَنِ عَنْ أَبِي بَكْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ذَاتَ يَوْمٍ مَنْ رَأَى مِنْكُمْ رُؤْيَا فَقَالَ رَجُلٌ أَنَا رَأَيْتُ كَأَنَّ مِيزَانًا نَزَلَ مِنْ السَّمَاءِ فَوُزِنْتَ أَنْتَ وَأَبُو بَكْرٍ فَرَجَحْتَ أَنْتَ بِأَبِي بَكْرٍ وَوُزِنَ عُمَرُ وَأَبُو بَكْرٍ فَرَجَحَ أَبُو بَكْرٍ وَوُزِنَ عُمَرُ وَعُثْمَانُ فَرَجَحَ عُمَرُ ثُمَّ رُفِعَ الْمِيزَانُ فَرَأَيْنَا الْكَرَاهِيَةَ فِي وَجْهِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ عَلِيِّ بْنِ زَيْدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ عَنْ أَبِيهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ذَاتَ يَوْمٍ أَيُّكُمْ رَأَى رُؤْيَا فَذَكَرَ مَعْنَاهُ وَلَمْ يَذْكُرْ الْكَرَاهِيَةَ قَالَ فَاسْتَاءَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْنِي فَسَاءَهُ ذَلِكَ فَقَالَ خِلَافَةُ نُبُوَّةٍ ثُمَّ يُؤْتِي اللَّهُ الْمُلْكَ مَنْ يَشَاءُ",
                "id": "Telah menceritakan kepada kami Muhammad Ibnul Mutsanna berkata: telah menceritakan kepada kami Muhammad bin Abdullah Al Anshari berkata: telah menceritakan kepada kami Al Asy'ats dari Al Hasan dari Abu Bakrah bahwa pada suatu hari Nabi shallallahu 'alaihi wa sallam bersabda: \"Siapakah di antara kalian yang bermimpi?\" seorang laki-laki berkata: \"Aku bermimpi melihat seakan-akan sebuah timbangan turun dari langit, lalu engkau ditimbang bersama Abu Bakr. Tetapi timbanganmu lebih berat dari timbangan Abu Bakr. Lalu Umar ditimbang bersama Abu Bakar, tetapi timbangan Abu Bakar lebih berat. Lalu Umar ditimbang bersama Utsman, tetapi timbangan Umar lebih berat, kemudian timbangan itu diangkat.\" Maka saat itu aku melihat ada tanda kebencian pada wajah Rasulullah shallallahu 'alaihi wa sallam. Telah menceritakan kepada kami Musa bin Isma'il berkata: telah menceritakan kepada kami Hammad dari Ali bin Zaid dari 'Abdurrahman bin Abu Bakrah dari Bapaknya bahwasanya pada suatu hari Nabi shallallahu 'alaihi wa sallam bersabda: \"Siapakah dari kalian yang bermimpi?\" lalu ia menyebutkan makna hadits tersebut, namun ia tidak menyebutkan tentang tanda kebencian pada wajah Rasulullah shallallahu 'alaihi wa sallam. Namun ia menyantumkan: Hal yang demikian membuat Rasulullah shallallahu 'alaihi wa sallam merasa tidak nyaman. Setelah itu Rasulullah shallallahu 'alaihi wa sallam bersabda: \"Itulah khilafah kenabian, setelah itu Allah menjadikan kerajaan dan memberikan kepada siapa saja yang Dia kehendaki.\""
            },
            {
                "number": 4018,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ عَنْ الزُّبَيْدِيِّ عَنْ ابْنِ شِهَابٍ عَنْ عَمْرِو بْنِ أَبَانَ بْنِ عُثْمَانَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّهُ كَانَ يُحَدِّثُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أُرِيَ اللَّيْلَةَ رَجُلٌ صَالِحٌ أَنَّ أَبَا بَكْرٍ نِيطَ بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنِيطَ عُمَرُ بِأَبِي بَكْرٍ وَنِيطَ عُثْمَانُ بِعُمَرَ قَالَ جَابِرٌ فَلَمَّا قُمْنَا مِنْ عِنْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُلْنَا أَمَّا الرَّجُلُ الصَّالِحُ فَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَمَّا تَنَوُّطُ بَعْضِهِمْ بِبَعْضٍ فَهُمْ وُلَاةُ هَذَا الْأَمْرِ الَّذِي بَعَثَ اللَّهُ بِهِ نَبِيَّهُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَقَالَ أَبُو دَاوُد وَرَوَاهُ يُونُسُ وَشُعَيْبٌ لَمْ يَذْكُرَا عَمْرَو بْنَ أَبَانَ",
                "id": "Telah menceritakan kepada kami [Amru bin Utsman] berkata, telah menceritakan kepada kami [Muhammad bin Harb] dari [Az Zubaidi] dari [Ibnu Syihab] dari [Amru bin Aban bin Utsman] dari [Jabir bin Abdullah] ia bercerita bahwa Rasulullah shallallahu 'alaihi wasallam pernah bersabda: \"Seorang laki-laki shalih bermimpi bahwa Abu Bakr dipautkan bersama Rasulullah shallallahu 'alaihi wasallam, Umar dipautkan bersama Abu Bakar dan Utsman juga dipautkan bersama Umar.\" Jabir berkata, \"Ketika kami bangkit dari sisi Rasulullah shallallahu 'alaihi wasallam, maka kami katakan, \"Laki-laki shalih itu adalah Rasulullah shallallahu 'alaihi wasallam. adapun keterpautan mereka satu sama lain itu adalah para pemimpin urusan ini (Islam) yang Allah utus kepada Nabi-Nya shallallahu 'alaihi wasallam.\" Abu Dawud berkata, \"Hadits ini diriwayatkan oleh [Yunus] dan [Syu'aib], namun keduanya tidak menyebutkan Amru bin Aban.\""
            },
            {
                "number": 4019,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنِي عَفَّانُ بْنُ مُسْلِمٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ أَشْعَثَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ سَمُرَةَ بْنِ جُنْدُبٍأَنَّ رَجُلًا قَالَ يَا رَسُولَ اللَّهِ إِنِّي رَأَيْتُ كَأَنَّ دَلْوًا دُلِّيَ مِنْ السَّمَاءِ فَجَاءَ أَبُو بَكْرٍ فَأَخَذَ بِعَرَاقِيهَا فَشَرِبَ شُرْبًا ضَعِيفًا ثُمَّ جَاءَ عُمَرُ فَأَخَذَ بِعَرَاقِيهَا فَشَرِبَ حَتَّى تَضَلَّعَ ثُمَّ جَاءَ عُثْمَانُ فَأَخَذَ بِعَرَاقِيهَا فَشَرِبَ حَتَّى تَضَلَّعَ ثُمَّ جَاءَ عَلِيٌّ فَأَخَذَ بِعَرَاقِيهَا فَانْتَشَطَتْ وَانْتَضَحَ عَلَيْهِ مِنْهَا شَيْءٌ",
                "id": "Telah menceritakan kepada kami [Muhammad Ibnul Mutsanna] ia berkata; telah menceritakan kepadaku [Affan bin Muslim] berkata, telah menceritakan kepada kami [Hammad bin Salamah] dari [Asy'ats bin 'Abdurrahman] dari [Bapaknya] dari [Samurah bin Jundub] berkata, \"Seorang laki-laki berkata, \"Wahai Rasulullah, aku melihat seakan ada sebuah ember yang diulurkan dari atas langit, Abu Bakar lantas datang mengambil kayu pengaitnya lalu minum dengan sedikit, kemudian datang Umar mengambil kayu pengaitnya lalu minum dengan puas, kemudian datang Utsman mengambil kayu pengaitnya lalu minum dengan puas, kemudian datang Ali mengambil kayu pengaitnya lalu minum secara berlebihan hingga ia terkena air tersebut.\""
            },
            {
                "number": 4020,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ سَهْلٍ الرَّمْلِيُّ حَدَّثَنَا الْوَلِيدُ حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الْعَزِيزِ عَنْ مَكْحُولٍ قَالَلَتَمْخُرَنَّ الرُّومُ الشَّامَ أَرْبَعِينَ صَبَاحًا لَا يَمْتَنِعُ مِنْهَا إِلَّا دِمَشْقَ وَعَمَّانَ",
                "id": "Telah menceritakan kepada kami [Ali bin Sahl Ar Ramli] berkata, telah menceritakan kepada kami [Al Walid] berkata, telah menceritakan kepada kami [Sa'id bin Abdul Aziz] dari [Makhul] ia berkata, \"Sungguh, Rum benar-benar akan memasuki Syam (mambawa fitnah) selama empat puluh hari, tidak ada yang selamat darinya selain Damaskus dan Amman.\""
            },
            {
                "number": 4021,
                "arab": "حَدَّثَنَا مُوسَى بْنُ عَامِرٍ الْمُرِّيُّ حَدَّثَنَا الْوَلِيدُ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْعَلَاءِ أَنَّهُ سَمِعَ أَبَا الْأَعْيَسِ عَبْدَ الرَّحْمَنِ بْنَ سَلْمَانَ يَقُولُ سَيَأْتِي مَلِكٌ مِنْ مُلُوكِ الْعَجَمِ يَظْهَرُ عَلَى الْمَدَائِنِ كُلِّهَا إِلَّا دِمَشْقَ",
                "id": "Telah menceritakan kepada kami Musa bin Amir Al Murri berkata: telah menceritakan kepada kami Al Walid berkata: telah menceritakan kepada kami Abdul Aziz Ibnul 'Ala Bahwasanya ia mendengar Abul A'yas 'Abdurrahman bin Salman berkata: \"Akan datang suatu masa dimana kekuasaan dipegang oleh pemimpin dari luar Arab, kekuasaannya meliputi semua kota selain Damaskus.\""
            },
            {
                "number": 4022,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ حَدَّثَنَا بُرْدٌ أَبُو الْعَلَاءِ عَنْ مَكْحُولٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَوْضِعُ فُسْطَاطِ الْمُسْلِمِينَ فِي الْمَلَاحِمِ أَرْضٌ يُقَالُ لَهَا الْغُوطَةُ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Hammad] berkata, telah menceritakan kepada kami [Burd Abul 'Ala] dari [Makhul] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kota kaum muslimin saat terjadi peperangan yang besar terletak pada sebuah wilayah yang bernama Al Ghuthah.\""
            },
            {
                "number": 4023,
                "arab": "حَدَّثَنَا أَبُو ظَفَرٍ عَبْدُ السَّلَامِ حَدَّثَنَا جَعْفَرٌ عَنْ عَوْفٍ قَالَ سَمِعْتُ الْحَجَّاجَ يَخْطُبُ وَهُوَ يَقُولُإِنَّ مَثَلَ عُثْمَانَ عِنْدَ اللَّهِ كَمَثَلِ عِيسَى ابْنِ مَرْيَمَ ثُمَّ قَرَأَ هَذِهِ الْآيَةَ يَقْرَؤُهَا وَيُفَسِّرُهَا{ إِذْ قَالَ اللَّهُ يَا عِيسَى إِنِّي مُتَوَفِّيكَ وَرَافِعُكَ إِلَيَّ وَمُطَهِّرُكَ مِنْ الَّذِينَ كَفَرُوا }يُشِيرُ إِلَيْنَا بِيَدِهِ وَإِلَى أَهْلِ الشَّامِ",
                "id": "Telah menceritakan kepada kami [Abu Zhafar Abdussalam] berkata, telah menceritakan kepada kami [Ja'far] dari [Auf] ia berkata; Aku mendengar [Al Hajjaj] berkhutbah, ia mengatakan, \"Permisalan Utsman di sisi Allah seperti Isa putra Maryam, lalu ia membaca ayat ini dan mentafsirkannya: '(Ingatlah), ketika Allah berfirman: \"Hai Isa, sesungguhnya Aku akan menyampaikan kamu kepada akhir ajalmu dan mengangkat kamu kepada-Ku serta membersihkan kamu dari orang-orang yang kafir…) ' -Qs. Ali Imran: 55- lalu dengan tangannya ia menunjuk ke arah kami dan ke arah penduduk Syam.\""
            },
            {
                "number": 4024,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ إِسْمَعِيلَ الطَّالَقَانِيُّ حَدَّثَنَا جَرِيرٌ ح و حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرٌ عَنْ الْمُغِيرَةِ عَنْ الرَّبِيعِ بْنِ خَالِدٍ الضَّبِّيِّ قَالَ سَمِعْتُ الْحَجَّاجَ يَخْطُبُ فَقَالَ فِي خُطْبَتِهِرَسُولُ أَحَدِكُمْ فِي حَاجَتِهِ أَكْرَمُ عَلَيْهِ أَمْ خَلِيفَتُهُ فِي أَهْلِهِ فَقُلْتُ فِي نَفْسِي لِلَّهِ عَلَيَّ أَلَّا أُصَلِّيَ خَلْفَكَ صَلَاةً أَبَدًا وَإِنْ وَجَدْتُ قَوْمًا يُجَاهِدُونَكَ لَأُجَاهِدَنَّكَ مَعَهُمْ زَادَ إِسْحَقُ فِي حَدِيثِهِ قَالَ فَقَاتَلَ فِي الْجَمَاجِمِ حَتَّى قُتِلَ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Isma'il Ath Thalaqani] berkata, telah menceritakan kepada kami [Jarir]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Zuhair bin Harb] berkata, telah menceritakan kepada kami [Jarir] dari [Al Mughirah] dari [Ar Rabi' bin Khalid Adh Dlabbi] ia berkata; Aku mendengar [Al Hajjaj] berkhutbah, dalam khutbahnya ia mengatakan, \"Utusan salah seorang dari kalian untuk memenuhi kebutuhannya lebih mulia dari dirinya atau lebih mulia dari orang yang diserahi untuk menjaga keluarganya?\" Maka aku pun berucap dalam diriku, \"Demi Allah, sungguh selamanya aku tidak akan shalat di belakangmu. Jika aku mendapati suatu kaum memerangimu maka aku akan ikut bergabung bersama mereka.\" Ishaq menambahkan dalam haditsnya, \" Ia berkata, \"Lalu Ar rabi' memerangi Al Hajaj di Jamajim hingga ia terbunuh.\""
            },
            {
                "number": 4025,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا أَبُو بَكْرٍ عَنْ عَاصِمٍ قَالَ سَمِعْتُ الْحَجَّاجَ وَهُوَ عَلَى الْمِنْبَرِ يَقُولُ اتَّقُوا اللَّهَ مَا اسْتَطَعْتُمْ لَيْسَ فِيهَا مَثْنَوِيَّةٌ وَاسْمَعُوا وَأَطِيعُوا لَيْسَ فِيهَا مَثْنَوِيَّةٌ لِأَمِيرِ الْمُؤْمِنِينَ عَبْدِ الْمَلِكِ وَاللَّهِ لَوْ أَمَرْتُ النَّاسَ أَنْ يَخْرُجُوا مِنْ بَابٍ مِنْ أَبْوَابِ الْمَسْجِدِ فَخَرَجُوا مِنْ بَابٍ آخَرَ لَحَلَّتْ لِي دِمَاؤُهُمْ وَأَمْوَالُهُمْ وَاللَّهِ لَوْ أَخَذْتُ رَبِيعَةَ بِمُضَرَ لَكَانَ ذَلِكَ لِي مِنْ اللَّهِ حَلَالًا وَيَا عَذِيرِي مِنْ عَبْدِ هُذَيْلٍ يَزْعُمُ أَنَّ قِرَاءَتَهُ مِنْ عِنْدِ اللَّهِ وَاللَّهِ مَا هِيَ إِلَّا رَجَزٌ مِنْ رَجَزِ الْأَعْرَابِ مَا أَنْزَلَهَا اللَّهُ عَلَى نَبِيِّهِ عَلَيْهِ السَّلَام وَعَذِيرِي مِنْ هَذِهِ الْحَمْرَاءِ يَزْعُمُ أَحَدُهُمْ أَنَّهُ يَرْمِي بِالْحَجَرِ فَيَقُولُ إِلَى أَنْ يَقَعَ الْحَجَرُ قَدْ حَدَثَ أَمْرٌ فَوَاللَّهِ لَأَدَعَنَّهُمْ كَالْأَمْسِ الدَّابِرِ قَالَ فَذَكَرْتُهُ لِلْأَعْمَشِ فَقَالَ أَنَا وَاللَّهِ سَمِعْتُهُ مِنْهُ",
                "id": "Telah menceritakan kepada kami Muhammad Ibnul 'Ala berkata: telah menceritakan kepada kami Abu Bakar dari Ashim ia berkata: Aku mendengar Al Hajjaj berkhutbah di atas mimbar, ia mengatakan: \"Bertakwalah kalian kepada Allah semampu kalian tanpa terkecuali. Hendaklah kalian mendengar dan taat kepada Amirul Mukminin Abdul Malik, tanpa terkecuali. Demi Allah, jika aku perintahkan manusia untuk keluar dari salah satu pintu masjid, lalu mereka keluar melalui pintu lain, maka darah dan harta mereka telah halal bagiku. Demi Allah, jika aku hukum Rabi'ah di Mudlar, sungguh Allah akan memberikan kehalalan itu kepadaku. Wahai orang yang memberiku udzur dari Abdu Hudzail -maksudnya adalah Abdullah bin Mas'ud Al Hadzali- ia mengaku bahwa bacaannya berasal dari Allah. Maka demi Allah, bacaan-bacaan itu tidak lebih dari sekedar syair-syair Arab yang Allah tidak menurunkannya kepada Nabi-Nya Alaihissalam. Wahai orang yang memberiku udzur dari kaum hamra (yakni orang-orang Ajam atau selain arab), salah seorang dari mereka mengaku telah melempar batu dan berkata: \"Hingga batu itu jatuh akan terjadi sesuatu.\" Maka demi Allah aku benar-benar akan meninggalkan mereka seperti hari sebelumnya (yakni meninggalkan mereka dalam keadaan hancur).\" Ia (perawi) berkata: \"Aku lantas menyebutkan hal itu kepada Al A'masy, ia lalu berkata: \"Demi Allah, aku mendengar itu darinya.\""
            },
            {
                "number": 4026,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا ابْنُ إِدْرِيسَ عَنْ الْأَعْمَشِ قَالَ سَمِعْتُ الْحَجَّاجَ يَقُولُ عَلَى الْمِنْبَرِهَذِهِ الْحَمْرَاءُ هَبْرٌ هَبْرٌ أَمَا وَاللَّهِ لَوْ قَدْ قَرَعْتُ عَصًا بِعَصًا لَأَذَرَنَّهُمْ كَالْأَمْسِ الذَّاهِبِ يَعْنِي الْمَوَالِيَ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Ibnu Idris] dari [Al A'masy] ia berkata, \"Aku mendengar [Al Hajjaj] berkata di atas mimbar, \"Orang-orang Hamra (para badui) ini telah berhak untuk dipotong tangannya. Demi Allah, sekiranya aku menginginkan kebinasaan mereka, maka aku akan biarkan mereka seperti hari-hari kemarin.\" Maksudnya adalah orang-orang asing di luar Arab. "
            },
            {
                "number": 4027,
                "arab": "حَدَّثَنَا قَطَنُ بْنُ نُسَيْرٍ حَدَّثَنَا جَعْفَرٌ يَعْنِي ابْنَ سُلَيْمَانَ حَدَّثَنَا دَاوُدُ بْنُ سُلَيْمَانَ عَنْ شَرِيكٍ عَنْ سُلَيْمَانَ الْأَعْمَشِ قَالَ جَمَّعْتُ مَعَ الْحَجَّاجِ فَخَطَبَ فَذَكَرَ حَدِيثَ أَبِي بَكْرِ بْنِ عَيَّاشٍ قَالَ فِيهَافَاسْمَعُوا وَأَطِيعُوا لِخَلِيفَةِ اللَّهِ وَصَفِيِّهِ عَبْدِ الْمَلِكِ بْنِ مَرْوَانَ وَسَاقَ الْحَدِيثَ قَالَ وَلَوْ أَخَذْتُ رَبِيعَةَ بِمُضَرَ وَلَمْ يَذْكُرْ قِصَّةَ الْحَمْرَاءِ",
                "id": "Telah menceritakan kepada kami [Qathan bin Nusair] berkata, telah menceritakan kepada kami [Ja'far] -maksudnya Ja'far bin Sulaiman- berkata, telah menceritakan kepada kami [Dawud bin Sulaiman] dari [Syarik] dari [Sulaiman Al A'masy] ia berkata, \"Aku shalat jum'at bersama [Al Hajjaj], lalu ia berkhutbah…. kemudian ia menyebutkan hadits Abu Bakar bin Ayyasy. Al Hajjaj mengatakan dalam khutbahnya, \"Dengarkan dan patuhilah khalifah dan kekasih Allah, Abdul Malik bin Marwan. Kemudian perawi menyebutkan hadits selanjutnya, \"Al Hajjaj berkata, \"Sekiranya aku hukum Rabi'ah di Mudhar…dan ia tidak menyebutkan kisah Al Hamra.\""
            },
            {
                "number": 4028,
                "arab": "حَدَّثَنَا سَوَّارُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ عَنْ سَعِيدِ بْنِ جُمْهَانَ عَنْ سَفِينَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خِلَافَةُ النُّبُوَّةِ ثَلَاثُونَ سَنَةً ثُمَّ يُؤْتِي اللَّهُ الْمُلْكَ أَوْ مُلْكَهُ مَنْ يَشَاءُقَالَ سَعِيدٌ قَالَ لِي سَفِينَةُ أَمْسِكْ عَلَيْكَ أَبَا بَكْرٍ سَنَتَيْنِ وَعُمَرُ عَشْرًا وَعُثْمَانُ اثْنَتَيْ عَشْرَةَ وَعَلِيٌّ كَذَا قَالَ سَعِيدٌ قُلْتُ لِسَفِينَةَ إِنَّ هَؤُلَاءِ يَزْعُمُونَ أَنَّ عَلِيًّا عَلَيْهِ السَّلَام لَمْ يَكُنْ بِخَلِيفَةٍ قَالَ كَذَبَتْ أَسْتَاهُ بَنِي الزَّرْقَاءِ يَعْنِي بَنِي مَرْوَانَ",
                "id": "Telah menceritakan kepada kami [Sawwar bin Abdullah] berkata, telah menceritakan kepada kami [Abdul Warits bin Sa'id] dari [Sa'id bin Jumhan] dari [Safinah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Khilafah kenabian itu selama tiga puluh tahun, kemudian Allah memberikan kekuasaan-Nya kepada siapa yang ia kehendaki.\" Sa'id berkata, \"Safinah berkata kepadaku, \"Hendaklah engkau tetap bersama Abu Bakar selama selama dua tahun, bersama Umar selama sepuluh tahun, bersama Utsman selama dua belas tahun, demikian juga dengan Ali.\" Sa'id berkata, \"Aku bertanya kepada Safinah, \"Mereka menganggap bahwa Ali bukan seorang khalifah?\" Ia menjawab, \"Keturunan Bani Az Zarqa, yaitu bani Marwan telah berdusta.\""
            },
            {
                "number": 4029,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ حَدَّثَنَا هُشَيْمٌ عَنْ الْعَوَّامِ بْنِ حَوْشَبٍ عَنْ سَعِيدِ بْنِ جُمْهَانَ عَنْ سَفِينَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خِلَافَةُ النُّبُوَّةِ ثَلَاثُونَ سَنَةً ثُمَّ يُؤْتِي اللَّهُ الْمُلْكَ مَنْ يَشَاءُ أَوْ مُلْكَهُ مَنْ يَشَاءُ",
                "id": "Telah menceritakan kepada kami Amru bin Aun telah menceritakan kepada kami Husyaim dari Al ‘Awwam bin Hausyab dari Sa’id bin Jumhan dari Safinah ia berkata: Rasulullah shallallahu ‘alaihi wa sallam bersabda: “Khilafah kenabian berlangsung selama tiga puluh tahun, kemudian Allah memberikan kekuasaan kepada siapa yang Dia kehendaki.”"
            },
            {
                "number": 4030,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ عَنْ ابْنِ إِدْرِيسَ أَخْبَرَنَا حُصَيْنٌ عَنْ هِلَالِ بْنِ يَسَافٍ عَنْ عَبْدِ اللَّهِ بْنِ ظَالِمٍ وَسُفْيَانُ عَنْ مَنْصُورٍ عَنْ هِلَالِ بْنِ يَسَافٍ عَنْ عَبْدِ اللَّهِ بْنِ ظَالِمٍ الْمَازِنِيِّ ذَكَرَ سُفْيَانُ رَجُلًا فِيمَا بَيْنَهُ وَبَيْنَ عَبْدِ اللَّهِ بْنِ ظَالِمٍ الْمَازِنِيِّ قَالَ سَمِعْتُ سَعِيدَ بْنَ زَيْدِ بْنِ عَمْرِو بْنِ نُفَيْلٍ قَالَ لَمَّا قَدِمَ فُلَانٌ إِلَى الْكُوفَةِ أَقَامَ فُلَانٌ خَطِيبًا فَأَخَذَ بِيَدِي سَعِيدُ بْنُ زَيْدٍ فَقَالَ أَلَا تَرَى إِلَى هَذَا الظَّالِمِ فَأَشْهَدُ عَلَى التِّسْعَةِ إِنَّهُمْ فِي الْجَنَّةِ وَلَوْ شَهِدْتُ عَلَى الْعَاشِرِ لَمْ إِيثَمْ ...",
                "id": "Telah menceritakan kepada kami Muhammad bin Al ‘Ala dari Ibnu Idris, ia berkata: telah mengabarkan kepada kami Hushain dari Hilal bin Yasaf dari Abdullah bin Zhalim, dan Sufyan dari Manshur dari Hilal bin Yasaf dari Abdullah bin Zhalim Al Mazini—Sufyan menyebutkan ada seorang laki-laki di antara dirinya dan Abdullah bin Zhalim—ia berkata: Aku mendengar Sa’id bin Zaid bin ‘Amru bin Nufail berkata: Ketika seseorang datang ke Kufah lalu berkhutbah, Sa’id bin Zaid memegang tanganku dan berkata: “Tidakkah kamu melihat orang zalim ini? Aku bersaksi bahwa sembilan orang berada di surga, dan seandainya aku bersaksi tentang yang kesepuluh, aku tidak berdosa.” Aku bertanya: “Siapa sembilan orang itu?” Ia menjawab: Rasulullah shallallahu ‘alaihi wa sallam bersabda ketika berada di atas Gunung Hira: “Tenanglah wahai Hira, di atasmu ada seorang Nabi, seorang Shiddiq, dan para syahid.” Mereka adalah Rasulullah shallallahu ‘alaihi wa sallam, Abu Bakr, Umar, Utsman, Ali, Thalhah, Az Zubair, Sa’d bin Abi Waqqash, dan ‘Abdurrahman bin Auf. Aku bertanya: “Siapa yang kesepuluh?” Ia terdiam sejenak lalu berkata: “Aku.” Abu Daud berkata: Hadits ini juga diriwayatkan oleh Al Asyja’i dari Sufyan dengan sanad yang serupa."
            },
            {
                "number": 4031,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ النَّمَرِيُّ حَدَّثَنَا شُعْبَةُ عَنْ الْحُرِّ بْنِ الصَّيَّاحِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَخْنَسِ ... وَلَوْ عُمِّرَ عُمُرَ نُوحٍ",
                "id": "Telah menceritakan kepada kami Hafsh bin Umar An Namari telah menceritakan kepada kami Syu’bah dari Al Hurr bin Ash Shayyah dari ‘Abdurrahman bin Al Akhnas, bahwa ia berada di masjid lalu seseorang menyebut-nyebut Ali, maka Sa’id bin Zaid berdiri dan berkata: Aku bersaksi atas Rasulullah shallallahu ‘alaihi wa sallam bahwa aku mendengar beliau bersabda: “Sepuluh orang berada di surga: Nabi di surga, Abu Bakr di surga, Umar di surga, Utsman di surga, Ali di surga, Thalhah di surga, Az Zubair bin Al ‘Awwam di surga, Sa’d bin Malik di surga, dan ‘Abdurrahman bin Auf di surga.” Jika aku mau, aku bisa menyebutkan yang kesepuluh. Mereka bertanya: “Siapa dia?” Ia menjawab: “Dia adalah Sa’id bin Zaid.” Dalam riwayat lain disebutkan bahwa kebersamaan salah seorang dari mereka bersama Rasulullah shallallahu ‘alaihi wa sallam, meskipun dengan wajah berdebu, lebih baik daripada seluruh amal seseorang sepanjang hidupnya walaupun ia diberi umur sepanjang umur Nabi Nuh."
            },
            {
                "number": 4032,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ ح و حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى الْمَعْنَى قَالَا حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ أَنَّ أَنَسَ بْنَ مَالِكٍ حَدَّثَهُمْ أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَعِدَ أُحُدًا فَتَبِعَهُ أَبُو بَكْرٍ وَعُمَرُ وَعُثْمَانُ فَرَجَفَ بِهِمْ فَضَرَبَهُ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِرِجْلِهِ وَقَالَ اثْبُتْ أُحُدُ نَبِيٌّ وَصِدِّيقٌ وَشَهِيدَانِ",
                "id": "Telah menceritakan kepada kami Musaddad telah menceritakan kepada kami Yazid bin Zurai’. Dalam jalur lain disebutkan: Telah menceritakan kepada kami Musaddad telah menceritakan kepada kami Yahya secara makna. Keduanya berkata: telah menceritakan kepada kami Sa’id bin Abi ‘Arubah dari Qatadah bahwa Anas bin Malik menceritakan kepada mereka bahwa Nabi shallallahu ‘alaihi wa sallam pernah menaiki Gunung Uhud, lalu Abu Bakr, Umar, dan Utsman ikut bersamanya. Gunung itu pun bergetar, maka Nabi shallallahu ‘alaihi wa sallam menghentakkan kakinya seraya bersabda: “Tenanglah wahai Uhud, sesungguhnya di atasmu ada seorang Nabi, seorang Shiddiq, dan dua orang Syahid.”"
            },
            {
                "number": 4033,
                "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ مُحَمَّدٍ الْمُحَارِبِيِّ عَنْ عَبْدِ السَّلَامِ بْنِ حَرْبٍ عَنْ أَبِي خَالِدٍ الدَّالَانِيِّ عَنْ أَبِي خَالِدٍ مَوْلَى آلِ جَعْدَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَانِي جِبْرِيلُ فَأَخَذَ بِيَدِي فَأَرَانِي بَابَ الْجَنَّةِ الَّذِي تَدْخُلُ مِنْهُ أُمَّتِي فَقَالَ أَبُو بَكْرٍ يَا رَسُولَ اللَّهِ وَدِدْتُ أَنِّي كُنْتُ مَعَكَ حَتَّى أَنْظُرَ إِلَيْهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَا إِنَّكَ يَا أَبَا بَكْرٍ أَوَّلُ مَنْ يَدْخُلُ الْجَنَّةَ مِنْ أُمَّتِي",
                "id": "Telah menceritakan kepada kami Hannad bin As Sari dari ‘Abdurrahman bin Muhammad Al Muharibi dari ‘Abdussalam bin Harb dari Abu Khalid Ad Dalani dari Abu Khalid, mantan budak keluarga Ja’dah, dari Abu Hurairah ia berkata: Rasulullah shallallahu ‘alaihi wa sallam bersabda: “Jibril datang kepadaku lalu memegang tanganku dan memperlihatkan kepadaku sebuah pintu surga yang akan dimasuki oleh umatku.” Abu Bakr berkata: “Wahai Rasulullah, aku berharap aku bersamamu hingga dapat melihat pintu itu.” Maka Rasulullah shallallahu ‘alaihi wa sallam bersabda: “Wahai Abu Bakr, engkaulah orang pertama dari umatku yang akan memasukinya.”"
            },
            {
                "number": 4034,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَيَزِيدُ بْنُ خَالِدٍ الرَّمْلِيُّ أَنَّ اللَّيْثَ حَدَّثَهُمْ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ لَا يَدْخُلُ النَّارَ أَحَدٌ مِمَّنْ بَايَعَ تَحْتَ الشَّجَرَةِ",
                "id": "Telah menceritakan kepada kami Qutaibah bin Sa’id dan Yazid bin Khalid Ar Ramli bahwa Al Laits menceritakan kepada mereka dari Abu Az Zubair dari Jabir dari Rasulullah shallallahu ‘alaihi wa sallam, beliau bersabda: “Tidak akan masuk neraka seorang pun dari orang-orang yang berbaiat di bawah pohon.”"
            },
            {
                "number": 4035,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ ح و حَدَّثَنَا أَحْمَدُ بْنُ سِنَانٍ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ عَاصِمٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مُوسَى فَلَعَلَّ اللَّهَ وَقَالَ ابْنُ سِنَانٍ اطَّلَعَ اللَّهُ عَلَى أَهْلِ بَدْرٍ فَقَالَ اعْمَلُوا مَا شِئْتُمْ فَقَدْ غَفَرْتُ لَكُمْ",
                "id": "Telah menceritakan kepada kami Musa bin Isma'il telah menceritakan kepada kami Hammad bin Salamah. Dalam jalur lain: Telah menceritakan kepada kami Ahmad bin Sinan telah menceritakan kepada kami Yazid bin Harun telah mengabarkan kepada kami Hammad bin Salamah dari ‘Ashim dari Abu Shalih dari Abu Hurairah ia berkata: Rasulullah shallallahu ‘alaihi wa sallam bersabda —Musa menyebutkan—: “Mungkin Allah…” dan Ibnu Sinan menyebutkan: “Allah telah melihat para pejuang Perang Badar lalu berfirman: ‘Berbuatlah sesuka kalian, sungguh Aku telah mengampuni kalian.’”"
            },
            {
                "number": 4036,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ أَنَّ مُحَمَّدَ بْنَ ثَوْرٍ حَدَّثَهُمْ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ الْمِسْوَرِ بْنِ مَخْرَمَةَ قَالَ خَرَجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَمَنَ الْحُدَيْبِيَةِ فَذَكَرَ الْحَدِيثَ قَالَ فَأَتَاهُ يَعْنِي عُرْوَةَ بْنَ مَسْعُودٍ فَجَعَلَ يُكَلِّمُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكُلَّمَا كَلَّمَهُ أَخَذَ بِلِحْيَتِهِ وَالْمُغِيرَةُ بْنُ شُعْبَةَ قَائِمٌ عَلَى رَأْسِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعَهُ السَّيْفُ وَعَلَيْهِ الْمِغْفَرُ فَضَرَبَ يَدَهُ بِنَعْلِ السَّيْفِ وَقَالَ أَخِّرْ يَدَكَ عَنْ لِحْيَتِهِ فَرَفَعَ عُرْوَةُ رَأْسَهُ فَقَالَ مَنْ هَذَا قَالُوا الْمُغِيرَةُ بْنُ شُعْبَةَ",
                "id": "Telah menceritakan kepada kami Muhammad bin ‘Ubaid bahwa Muhammad bin Tsaur menceritakan kepada mereka dari Ma‘mar dari Az Zuhri dari ‘Urwah bin Az Zubair dari Al Miswar bin Makhramah ia berkata: Nabi shallallahu ‘alaihi wa sallam keluar pada masa perjanjian Hudaibiyah —lalu ia menyebutkan hadits— kemudian datanglah ‘Urwah bin Mas‘ud dan berbicara dengan Nabi. Setiap kali berbicara, ia memegang janggut beliau. Al Mughirah bin Syu‘bah berdiri di sisi Nabi dengan membawa pedang dan mengenakan penutup kepala besi, lalu ia memukul tangan ‘Urwah dengan sarung pedangnya seraya berkata: “Jauhkan tanganmu dari janggut beliau!” Maka ‘Urwah mengangkat kepalanya dan bertanya: “Siapa ini?” Mereka menjawab: “Al Mughirah bin Syu‘bah.”"
            },
            {
                "number": 4037,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ أَبُو عُمَرَ الضَّرِيرُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ أَنَّ سَعِيدَ بْنَ إِيَاسٍ الْجُرَيْرِيَّ أَخْبَرَهُمْ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ الْعُقَيْلِيِّ عَنْ الْأَقْرَعِ مُؤَذِّنِ عُمَرَ بْنِ الْخَطَّابِ قَالَ بَعَثَنِي عُمَرُ إِلَى الْأُسْقُفِّ فَدَعَوْتُهُ فَقَالَ لَهُ عُمَرُ وَهَلْ تَجِدُنِي فِي الْكِتَابِ قَالَ نَعَمْ قَالَ كَيْفَ تَجِدُنِي قَالَ أَجِدُكَ قَرْنًا فَرَفَعَ عَلَيْهِ الدِّرَّةَ فَقَالَ قَرْنٌ مَهْ فَقَالَ قَرْنٌ حَدِيدٌ أَمِينٌ شَدِيدٌ قَالَ كَيْفَ تَجِدُ الَّذِي يَجِيءُ مِنْ بَعْدِي فَقَالَ أَجِدُهُ خَلِيفَةً صَالِحًا غَيْرَ أَنَّهُ يُؤْثِرُ قَرَابَتَهُ قَالَ عُمَرُ يَرْحَمُ اللَّهُ عُثْمَانَ ثَلَاثًا فَقَالَ كَيْفَ تَجِدُ الَّذِي بَعْدَهُ قَالَ أَجِدُهُ صَدَأَ حَدِيدٍ فَوَضَعَ عُمَرُ يَدَهُ عَلَى رَأْسِهِ فَقَالَ يَا دَفْرَاهُ يَا دَفْرَاهُ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ إِنَّهُ خَلِيفَةٌ صَالِحٌ وَلَكِنَّهُ يُسْتَخْلَفُ حِينَ يُسْتَخْلَفُ وَالسَّيْفُ مَسْلُولٌ وَالدَّمُ مُهْرَاقٌ قَالَ أَبُو دَاوُد الدَّفْرُ النَّتْنُ",
                "id": "Telah menceritakan kepada kami Hafsh bin Umar Abu Umar Adh Dharir telah menceritakan kepada kami Hammad bin Salamah bahwa Sa‘id bin Iyas Al Jurairi mengabarkan kepada mereka dari ‘Abdullah bin Syaqiq Al ‘Uqaili dari Al Aqra’, muadzin Umar bin Al Khaththab, ia berkata: Umar mengutusku menemui seorang uskup. Umar berkata kepadanya: “Apakah kamu mendapati aku di dalam Kitab?” Ia menjawab: “Ya.” Umar bertanya: “Bagaimana kamu mendapati aku?” Ia menjawab: “Aku mendapati engkau seperti benteng.” Umar mengangkat cambuknya seraya berkata: “Benteng apa?” Ia menjawab: “Benteng besi yang kuat dan amanah.” Umar bertanya: “Bagaimana orang setelahku?” Ia menjawab: “Seorang khalifah shalih, namun ia lebih mengutamakan kerabatnya.” Umar berkata: “Semoga Allah merahmati Utsman,” sebanyak tiga kali. Umar bertanya lagi: “Bagaimana orang setelahnya?” Ia menjawab: “Besi yang berkarat.” Maka Umar memegang kepalanya seraya berkata: “Alangkah buruknya.” Ia berkata: “Wahai Amirul Mukminin, sesungguhnya ia khalifah yang shalih, namun ia diangkat ketika pedang telah terhunus dan darah telah tertumpah.” Abu Dawud berkata: Ad-dafru berarti bau busuk."
            },
            {
                "number": 4038,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ قَالَ أَنْبَأَنَا ح و حَدَّثَنَا مُسَدَّدٌ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرُ أُمَّتِي الْقَرْنُ الَّذِينَ بُعِثْتُ فِيهِمْ ثُمَّ الَّذِينَ يَلُونَهُمْ ثُمَّ الَّذِينَ يَلُونَهُمْ وَاللَّهُ أَعْلَمُ أَذَكَرَ الثَّالِثَ أَمْ لَا ثُمَّ يَظْهَرُ قَوْمٌ يَشْهَدُونَ وَلَا يُسْتَشْهَدُونَ وَيَنْذِرُونَ وَلَا يُوفُونَ وَيَخُونُونَ وَلَا يُؤْتَمَنُونَ وَيَفْشُو فِيهِمْ السِّمَنُ",
                "id": "Telah menceritakan kepada kami [Amru bin Aun] ia berkata; telah memberitakan kepada kami. (dalam jalur lain disebutkan) [Musaddad] ia berkata; telah menceritakan kepada kami [Abu Awanah] dari [Qatadah] dari [Zurarah bin Aufa] dari [Imran bin Hushain] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sebaik-baik generasi adalah generasi saat aku diutus di dalamnya, kemudian generasi setelah mereka, kemudian generasi setelah mereka -Perawi berkata; 'Hanya Allah yang tahu, apakah beliau menyebutkan yang ketiga atau tidak'-. Setelah itu akan muncul orang-orang yang memberikan persaksian padahal mereka tidak diminta, berjanji namun tidak menepatinya, mereka suka melakukan khianat, tidak amanat dan menyebar di antara mereka kegemukan.\""
            },
            {
                "number": 4039,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي سَعِيدٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَسُبُّوا أَصْحَابِي فَوَالَّذِي نَفْسِي بِيَدِهِ لَوْ أَنْفَقَ أَحَدُكُمْ مِثْلَ أُحُدٍ ذَهَبًا مَا بَلَغَ مُدَّ أَحَدِهِمْ وَلَا نَصِيفَهُ",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Abu Awanah] dari [Al A'masy] dari [Abu Shalih] dari [Abu Sa'id] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlan kalian mencela sahabatku. Demi Dzat yang jiwaku ada dalam tangan-Nya, sekiranya salah seorang dari kalian bersedekah dengan emas sebesar gunung uhud, maka itu tidak akan bisa menyamai sedekah mereka meski hanya satu mud atau pun setengahnya.\""
            },
            {
                "number": 4040,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زَائِدَةُ بْنُ قُدَامَةَ الثَّقَفِيُّ حَدَّثَنَا عُمَرُ بْنُ قَيْسٍ الْمَاصِرُ عَنْ عَمْرِو بْنِ أَبِي قُرَّةَ قَالَكَانَ حُذَيْفَةُ بِالْمَدَائِنِ فَكَانَ يَذْكُرُ أَشْيَاءَ قَالَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأُنَاسٍ مِنْ أَصْحَابِهِ فِي الْغَضَبِ فَيَنْطَلِقُ نَاسٌ مِمَّنْ سَمِعَ ذَلِكَ مِنْ حُذَيْفَةَ فَيَأْتُونَ سَلْمَانَ فَيَذْكُرُونَ لَهُ قَوْلَ حُذَيْفَةَ فَيَقُولُ سَلْمَانُ حُذَيْفَةُ أَعْلَمُ بِمَا يَقُولُ فَيَرْجِعُونَ إِلَى حُذَيْفَةَ فَيَقُولُونَ لَهُ قَدْ ذَكَرْنَا قَوْلَكَ لِسَلْمَانَ فَمَا صَدَّقَكَ وَلَا كَذَّبَكَ فَأَتَى حُذَيْفَةُ سَلْمَانَ وَهُوَ فِي مَبْقَلَةٍ فَقَالَ يَا سَلْمَانُ مَا يَمْنَعُكَ أَنْ تُصَدِّقَنِي بِمَا سَمِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ سَلْمَانُ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَغْضَبُ فَيَقُولُ فِي الْغَضَبِ لِنَاسٍ مِنْ أَصْحَابِهِ وَيَرْضَى فَيَقُولُ فِي الرِّضَا لِنَاسٍ مِنْ أَصْحَابِهِ أَمَا تَنْتَهِي حَتَّى تُوَرِّثَ رِجَالًا حُبَّ رِجَالٍ وَرِجَالًا بُغْضَ رِجَالٍ وَحَتَّى تُوقِعَ اخْتِلَافًا وَفُرْقَةً وَلَقَدْ عَلِمْتَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطَبَ فَقَالَ أَيُّمَا رَجُلٍ مِنْ أُمَّتِي سَبَبْتُهُ سَبَّةً أَوْ لَعَنْتُهُ لَعْنَةً فِي غَضَبِي فَإِنَّمَا أَنَا مِنْ وَلَدِ آدَمَ أَغْضَبُ كَمَا يَغْضَبُونَ وَإِنَّمَا بَعَثَنِي رَحْمَةً لِلْعَالَمِينَ فَاجْعَلْهَا عَلَيْهِمْ صَلَاةً يَوْمَ الْقِيَامَةِوَاللَّهِ لَتَنْتَهِيَنَّ أَوْ لَأَكْتُبَنَّ إِلَى عُمَرَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus] berkata, telah menceritakan kepada kami [Zaidah bin Qudamah Ats Tsaqafi] berkata, telah menceritakan kepada kami [Umar bin Qais Al Mashiri] dari [Amru bin Abu Qurrah] ia berkata, \"Saat berada di Madain, [Hudzaifah] menyebutkan sesuatu yang dikatakan oleh Rasulullah shallallahu 'alaihi wasallam kepada para sahabatnya dengan marah. Orang-orang yang mendengar hal itu dari Hudzaifah langsung pergi dan mendatangi Salman. Mereka kemudian menceritakan apa yang dikatakan oleh Hudzaifah kepada Salman, namun Salaman justru berkata, \"Hudzaifah lebih tahu dengan apa yang ia katakan.\" Orang-orang itu akhirnya kembali lagi menemui Hudzaifah dan berkata, \"Ucapanmu tadi telah kami sampaikan kepada Salman, tetapi ia tidak membenarkan atau mendustakan kamu!\" Hudzifah lantas pergi mendatangi Salman saat ia berada di Mabqalah, Hudzaifah berkata, \"Wahai Salman, apa yang menghalangimu untuk membenarkan aku atas apa yang telah aku dengar dari Rasulullah shallallahu 'alaihi wasallam?\" Salman menjawab, \"Rasulullah shallallahu 'alaihi wasallam pernah marah dan berbicara dengan para sahabat dalam keadaam marah, tetapi beliau juga bisa ridha sehingga beliau berbicara dengan para sahabatnya dalam keadaan ridha. Tidakkah sebaiknya kamu tidak menceritakan apa yang telah kamu dengar hingga yang demikian itu dapat menjadikan sebagian cinta kepada sebagian dan benci kepada sebagian yang lain; agar tidak terjadi perpecahan. Engkau telah mendengar Rasulullah shallallahu 'alaihi wasallam berkhutbah: \"Laki-laki manapun dari umatku yang pernah aku cela atau laknat saat dalam kondisi marah, sesungguhnya aku hanyalah anak turun Adam, hingga aku pun dapat marah sebagaimana mereka marah. Hanya saja aku diutus sebagai rahmat bagi seluruh alam, (Ya Allah) jadikanlah celaanku itu sebagai rahmat bagi mereka pada hari kiamat.\" Demi Allah, engkau segera berhenti dari melakukan hal yang demikian itu atau aku akan menulis surat kepada Umar.\""
            },
            {
                "number": 4041,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ قَالَ حَدَّثَنِي الزُّهْرِيُّ حَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ زَمْعَةَ قَالَلَمَّا اسْتُعِزَّ بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا عِنْدَهُ فِي نَفَرٍ مِنْ الْمُسْلِمِينَ دَعَاهُ بِلَالٌ إِلَى الصَّلَاةِ فَقَالَ مُرُوا مَنْ يُصَلِّي لِلنَّاسِ فَخَرَجَ عَبْدُ اللَّهِ بْنُ زَمْعَةَ فَإِذَا عُمَرُ فِي النَّاسِ وَكَانَ أَبُو بَكْرٍ غَائِبًا فَقُلْتُ يَا عُمَرُ قُمْ فَصَلِّ بِالنَّاسِ فَتَقَدَّمَ فَكَبَّرَ فَلَمَّا سَمِعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَوْتَهُ وَكَانَ عُمَرُ رَجُلًا مُجْهِرًا قَالَ فَأَيْنَ أَبُو بَكْرٍ يَأْبَى اللَّهُ ذَلِكَ وَالْمُسْلِمُونَ يَأْبَى اللَّهُ ذَلِكَ وَالْمُسْلِمُونَ فَبَعَثَ إِلَى أَبِي بَكْرٍ فَجَاءَ بَعْدَ أَنْ صَلَّى عُمَرُ تِلْكَ الصَّلَاةَ فَصَلَّى بِالنَّاسِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili] berkata, telah menceritakan kepada kami [Muhammad bin Salamah] dari [Muhammad bin Ishaq] ia berkata; telah menceritakan kepadaku [Az Zuhri] berkata, telah menceritakan kepadaku [Abdul Malik bin Abu Bakr bin 'Abdurrahman Ibnul Harits bin Hisaym] dari [Bapaknya] dari [Abdullah bin Zam'ah] ia berkata, \"Ketika Rasulullah shallallahu 'alaihi wasallam sakit keras, aku bersama beberapa kaum muslimin berada di sisi beliau, Bilal datang dan menyerunya untuk shalat. Beliau bersabda: \"Perintahkanlah seseorang untuk menjadi imam shalat.\" Abdullah bin Zam'ah lalu keluar, dan ternyata Umar tengah berada di antara orang-orang, sementara Abu Bakar tidak ada. Aku lalu berkata, \"Wahai Umar, berdiri dan imamilah orang-orang untuk melaksanakan shalat.\" Umar lalu berdiri dan bertakbir. Ketika Rasulullah shallallahu 'alaihi wasallam mendengar suaranya -umar adalah lelaki yang suaranya keras-, beliau bersabda: \"Di mana Abu Bakar? Sesungguhnya Allah dan kaum muslimin tidak menyukai yang seperti itu, sesungguhnya Allah dan kaum muslimin tidak menyukai yang seperti itu.\" Beliau lalu mengutus untuk mencarinya, kemudian Abu bakar ketika Umar telah selesai melaksanakan shalat, maka Abu Bakar pun shalat bersama orang-orang.\""
            },
            {
                "number": 4042,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ قَالَ حَدَّثَنِي مُوسَى بْنُ يَعْقُوبَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ إِسْحَقَ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ أَنَّ عَبْدَ اللَّهِ بْنَ زَمْعَةَ أَخْبَرَهُ بِهَذَا الْخَبَرِ قَالَلَمَّا سَمِعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَوْتَ عُمَرَ قَالَ ابْنُ زَمْعَةَ خَرَجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى أَطْلَعَ رَأْسَهُ مِنْ حُجْرَتِهِ ثُمَّ قَالَ لَا لَا لَا لِيُصَلِّ لِلنَّاسِ ابْنُ أَبِي قُحَافَةَ يَقُولُ ذَلِكَ مُغْضَبًا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] berkata, telah menceritakan kepada kami [Ibnu Abu Fudaik] ia berkata; telah menceritakan kepadaku [Musa bin Ya'qub] dari [Abdur Rahman bin Ishaq] dari [Ibnu Syihab] dari [Ubaidullah bin Abdullah bin Utbah] bahwa [Abdullah bin Zam'ah] mengabarkan kepadanya dengan kabar tersebut. Ia berkata, \"Ketika Nabi shallallahu 'alaihi wasallam mendengar suara Umar, Ibnu Zam'ah berkata, \"Nabi shallallahu 'alaihi wasallam keluar hingga kepalanya terlihat dari balik kamarnya. Beliau lantas bersabda: \"Tidak, tidak, tidak. Hendaklah yang memimpin shalat adalah Ibnu Abu Quhafah.\" Beliau ucapkan itu dengan marah.\""
            },
            {
                "number": 4043,
                "arab": "حَدَّثَنَا مُسَدَّدٌ وَمُسْلِمُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ عَلِيِّ بْنِ زَيْدٍ عَنْ الْحَسَنِ عَنْ أَبِي بَكْرَةَ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ الْأَنْصَارِيِّ قَالَ حَدَّثَنِي الْأَشْعَثُ عَنْ الْحَسَنِ عَنْ أَبِي بَكْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلْحَسَنِ بْنِ عَلِيٍّ إِنَّ ابْنِي هَذَا سَيِّدٌ وَإِنِّي أَرْجُو أَنْ يُصْلِحَ اللَّهُ بِهِ بَيْنَ فِئَتَيْنِ مِنْ أُمَّتِي وَقَالَ فِي حَدِيثِ حَمَّادٍ وَلَعَلَّ اللَّهَ أَنْ يُصْلِحَ بِهِ بَيْنَ فِئَتَيْنِ مِنْ الْمُسْلِمِينَ عَظِيمَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Musaddad] dan [Muslim bin Ibrahim] ia berkata; telah menceritakan kepada kami [Hammad] dari [Ali bin Zaid] dari [Al Hasan] dari [Abu Bakrah]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad Ibnul Mutsanna] dari [Muhammad bin Abdullah Al Anshari] ia berkata; telah menceritakan kepadaku [Al Asy'ats] dari [Al Hasan] dari [Abu Bakrah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda untuk Al Hasan bin Ali: \"Sesungguhnya putraku ini adalah seorang pemimpin, aku berharap ia akan mendamaikan antara dua kelompok dari umatku yang bertikai.\" Dan dalam hadits Hammad, beliau mengatakan: \"Semoga dengan perantara anak ini Allah akan mendamaikan antara dua kelompok besar dari umatku yang bertikai.\""
            },
            {
                "number": 4044,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا يَزِيدُ أَخْبَرَنَا هِشَامٌ عَنْ مُحَمَّدٍ قَالَ قَالَ حُذَيْفَةُمَا أَحَدٌ مِنْ النَّاسِ تُدْرِكُهُ الْفِتْنَةُ إِلَّا أَنَا أَخَافُهَا عَلَيْهِ إِلَّا مُحَمَّدُ بْنُ مَسْلَمَةَ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تَضُرُّكَ الْفِتْنَةُ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali] berkata, telah menceritakan kepada kami [Yazid] berkata, telah mengabarkan kepada kami [Hisyam] dari [Muhammad] ia berkata; [Hudzaifah] berkata, \"Tidak seorang pun dari manusia yang menemui fitnah kecuali aku akan mencemaskannya, kecuali Muhammad bin Maslamah. Sungguh aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Fitnah tidak akan membahayakanmu.\""
            },
            {
                "number": 4045,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ مَرْزُوقٍ أَخْبَرَنَا شُعْبَةُ عَنْ الْأَشْعَثِ بْنِ سُلَيْمٍ عَنْ أَبِي بُرْدَةَ عَنْ ثَعْلَبَةَ بْنِ ضُبَيْعَةَ قَالَدَخَلْنَا عَلَى حُذَيْفَةَ فَقَالَ إِنِّي لَأَعْرِفُ رَجُلًا لَا تَضُرُّهُ الْفِتَنُ شَيْئًا قَالَ فَخَرَجْنَا فَإِذَا فُسْطَاطٌ مَضْرُوبٌ فَدَخَلْنَا فَإِذَا فِيهِ مُحَمَّدُ بْنُ مَسْلَمَةَ فَسَأَلْنَاهُ عَنْ ذَلِكَ فَقَالَ مَا أُرِيدُ أَنْ يَشْتَمِلَ عَلَيَّ شَيْءٌ مِنْ أَمْصَارِكُمْ حَتَّى تَنْجَلِيَ عَمَّا انْجَلَتْحَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ أَشْعَثَ بْنِ سُلَيْمٍ عَنْ أَبِي بُرْدَةَ عَنْ ضُبَيْعَةَ بْنِ حُصَيْنٍ الثَّعْلَبِيِّ بِمَعْنَاهُ",
                "id": "Telah menceritakan kepada kami [Amru bin Marzuq] berkata, telah mengabarkan kepada kami [Syu'bah] dari [Al Asy'ast bin Sulaim] dari [Abu Burdah] dari [Tsa'labah bin Dlubai'ah] ia berkata, \"Kami masuk menemui [Hudzaifah], ia lalu berkata, \"Sungguh, aku mengetahui seorang laki-laki yang tidak akan terkena buruknya fitnah sedikitpun.\" Tsa'labah berkata, \"Kami lalu pergi hingga mendapati sebuah tenda yang terpasang. Ketika kami masuk ternyata di dalamnya ada Muhammad bin Maslamah. Maka kami pun menanyakan hal itu (perkataan Hudzaifah) kepadanya, ia berkata, \"Aku tidak ingin tinggal bersama di kota kalian hingga jelas fitnah yang terjadi.\" Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Abu Awanah] dari [Asy'ats bin Sulaim] dari [Abu burdah] dari [Dlubai'ah bin Hushain Ats Tsa'labi] dengan makna yang sama.\""
            },
            {
                "number": 4046,
                "arab": "حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ الْهُذَلِيُّ حَدَّثَنَا ابْنُ عُلَيَّةَ عَنْ يُونُسَ عَنْ الْحَسَنِ عَنْ قَيْسِ بْنِ عَبَّادٍ قَالَقُلْتُ لِعَلِيٍّ رَضِيَ اللَّهُ عَنْهُ أَخْبِرْنَا عَنْ مَسِيرِكَ هَذَا أَعَهْدٌ عَهِدَهُ إِلَيْكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمْ رَأْيٌ رَأَيْتَهُ فَقَالَ مَا عَهِدَ إِلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشَيْءٍ وَلَكِنَّهُ رَأْيٌ رَأَيْتُهُ",
                "id": "Telah menceritakan kepada kami [Isma'il bin Ibrahim Al hudzali] berkata, telah menceritakan kepada kami [Ibnu Ulayyah] dari [Yunus] dari [Al Hasan] dari [Qais bin Abbad] ia berkata, \"Aku berkata kepada [Ali radliallahu 'anhu], \"Kabarkanlah kepada kami tentang perjalananmu ini (ke Irak untuk memerangi Mu'awiyah), apakah itu nasihat yang Rasulullah shallallahu 'alaihi wasallam berikan kepadamu atau hanya sekedar pendapatmu saja?\" Ali menjawab, \"Rasulullah shallallahu 'alaihi wasallam tidak pernah memberikan nasihat kepadaku hal itu, tetapi itu hanyalah pendapatku semata.\""
            },
            {
                "number": 4047,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا الْقَاسِمُ بْنُ الْفَضْلِ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَمْرُقُ مَارِقَةٌ عِنْدَ فُرْقَةٍ مِنْ الْمُسْلِمِينَ يَقْتُلُهَا أَوْلَى الطَّائِفَتَيْنِ بِالْحَقِّ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] berkata, telah menceritakan kepada kami [Al Qasim Ibnul Fadhl] dari [Abu Nadhrah] dari [Abu Sa'id] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Akan ada sekelompok orang dari kaum muslimin keluar dengan cepat saat terjadi perpecahan, dan mereka akan dibunuh oleh kelompok yang lebih berhak dengan kebenaran di antara dua kelompok yang ada.\""
            },
            {
                "number": 4048,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا عَمْرٌو يَعْنِي ابْنَ يَحْيَى عَنْ أَبِيهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُخَيِّرُوا بَيْنَ الْأَنْبِيَاءِ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Wuhaib] berkata, telah menceritakan kepada kami [Amru] -maksudnya Amru bin Yahya- dari [Bapaknya] dari [Abu Sa'id Al Khudri] ia berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Jangan kalian membeda-bedakan antara para Nabi.\""
            },
            {
                "number": 4049,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ أَبِي الْعَالِيَةِ عَنْ ابْنِ عَبَّاسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا يَنْبَغِي لِعَبْدٍ أَنْ يَقُولَ إِنِّي خَيْرٌ مِنْ يُونُسَ بْنِ مَتَّى",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar] berkata, telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Abu Al 'Aliyah] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak pantas bagi seorang hamba mengatakan: \"Sesungguhnya aku lebih baik dari Yunus bin Mata.\""
            },
            {
                "number": 4050,
                "arab": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ يَحْيَى الْحَرَّانِيُّ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ سَلَمَةَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ إِسْمَعِيلَ بْنِ أَبِي حَكِيمٍ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا يَنْبَغِي لِنَبِيٍّ أَنْ يَقُولَ إِنِّي خَيْرٌ مِنْ يُونُسَ بْنِ مَتَّى",
                "id": "Telah menceritakan kepada kami [Abdul Aziz bin Yahya Al Harrani] ia berkata; telah menceritakan kepadaku [Muhammad bin Salamah] dari [Muhammad bin Ishaq] dari [Isma'il bin Abu Hakim] dari [Al Qasim bin Muhammad] dari [Abdullah bin Ja'far] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak layak bagi seorang Nabi berkata: \"Aku lebih baik dari Yunus bin Mata.\""
            },
            {
                "number": 4051,
                "arab": "حَدَّثَنَا حَجَّاجُ بْنُ أَبِي يَعْقُوبَ وَمُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ قَالَا حَدَّثَنَا يَعْقُوبُ قَالَ حَدَّثَنَا أَبِي عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ وَعَبْدِ الرَّحْمَنِ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَجُلٌ مِنْ الْيَهُودِ وَالَّذِي اصْطَفَى مُوسَى فَرَفَعَ الْمُسْلِمُ يَدَهُ فَلَطَمَ وَجْهَ الْيَهُودِيِّ فَذَهَبَ الْيَهُودِيُّ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرَهُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُخَيِّرُونِي عَلَى مُوسَى فَإِنَّ النَّاسَ يُصْعَقُونَ فَأَكُونُ أَوَّلَ مَنْ يُفِيقُ فَإِذَا مُوسَى بَاطِشٌ فِي جَانِبِ الْعَرْشِ فَلَا أَدْرِي أَكَانَ مِمَّنْ صَعِقَ فَأَفَاقَ قَبْلِي أَوْ كَانَ مِمَّنْ اسْتَثْنَى اللَّهُ عَزَّ وَجَلَّقَالَ أَبُو دَاوُد وَحَدِيثُ ابْنِ يَحْيَى أَتَمُّ",
                "id": "Telah menceritakan kepada kami [Hajjaj bin Abu Ya'qub] dan [Muhammad bin Yahya bin Faris] keduanya berkata; telah menceritakan kepada kami [Ya'qub] ia berkata; telah menceritakan kepada kami [Bapakku] dari [Ibnu Syihab] dari [Abu Salamah bin 'Abdurrahman] dan ['Abdurrahman Al A'raj] dari [Abu Hurairah] ia berkata, \"Seorang laki-laki Yahudi berkata 'Demi Dzat Yang mengutus Musa', lalu seorang laki-laki muslim mengangkat tangannya seraya menampar laki-laki Yahudi tersebut. Yahudi tersebut pergi menemui Rasulullah shallallahu 'alaihi wasallam dan mengabarkan hal tersebut kepada beliau. Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian melebih-lebihkan aku di atas Musa. (Pada hari kiamat) manusia akan pingsan, dan aku adalah orang yang paling pertama sadar. Namun ternyata Musa telah berpegangan di sisi Al Arsy, aku tidak tahu apakah beliau termasuk orang yang pingsan lalu sadar sebelum aku atau termasuk orang yang Allah kecualikan.\" Abu Dawud berkata, \"Hadits Ibnu Yahya lebih sempurna.\""
            },
            {
                "number": 4052,
                "arab": "حَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ مُخْتَارِ بْنِ فُلْفُلٍ يَذْكُرُ عَنْ أَنَسٍ قَالَقَالَ رَجُلٌ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا خَيْرَ الْبَرِيَّةِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاكَ إِبْرَاهِيمُ",
                "id": "Telah menceritakan kepada kami [Ziyad bin Ayyub] berkata, telah menceritakan kepada kami [Abdullah bin Idris] dari [Mukhtar bin Fulful] ia menyebutkan dari [Anas] ia berkata, \"Seorang laki-laki berkata kepada Rasulullah shallallahu 'alaihi wasallam, \"Wahai sebaik-baik manusia!\" Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Itu adalah Ibrahim.\""
            },
            {
                "number": 4053,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ حَدَّثَنَا الْوَلِيدُ عَنْ الْأَوْزَاعِيِّ عَنْ أَبِي عَمَّارٍ عَنْ عَبْدِ اللَّهِ بْنِ فَرُّوخَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَا سَيِّدُ وَلَدِ آدَمَ وَأَوَّلُ مَنْ تَنْشَقُّ عَنْهُ الْأَرْضُ وَأَوَّلُ شَافِعٍ وَأَوَّلُ مُشَفَّعٍ",
                "id": "Telah menceritakan kepada kami [Amru bin Utsman] berkata, telah menceritakan kepada kami [Al Walid] dari [Al Auza'i] dari [Abu Ammar] dari [Abdullah bin Farrukh] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku adalah pemimpin anak Adam, orang yang pertama kali keluar dari perut bumi (dibangkitkan) dan orang yang pertama kali memberi syafaat dan mendapat izin untuk memberikannya.\""
            },
            {
                "number": 4054,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُتَوَكِّلِ الْعَسْقَلَانِيُّ وَمَخْلَدُ بْنُ خَالِدٍ الشَّعِيرِيُّ الْمَعْنَى قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أَدْرِي أَتُبَّعٌ لَعِينٌ هُوَ أَمْ لَا وَمَا أَدْرِي أَعُزَيْرٌ نَبِيٌّ هُوَ أَمْ لَا",
                "id": "Telah menceritakan kepada kami [Muhammad Ibnul Mutawakkil Al Asqalani] dan [Muhammad bin Khalid Asy Sya'iri] secara makna, ia berkata; telah menceritakan kepada kami [Abdurrazaq] berkata, telah mengabarkan kepada kami [Ma'mar] dari [Ibnu Abu Dzi'b] dari [Sa'id bin Abu Sa'id] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku tidak tahu apakah Tubba' adalah orang yang terlaknat atau tidak, dan aku tidak tahu apakah Uzair adalah seorang Nabi atau bukan.\""
            },
            {
                "number": 4055,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ أَنَّ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ أَخْبَرَهُ أَنَّ أَبَا هُرَيْرَةَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ أَنَا أَوْلَى النَّاسِ بِابْنِ مَرْيَمَ الْأَنْبِيَاءُ أَوْلَادُ عَلَّاتٍ وَلَيْسَ بَيْنِي وَبَيْنَهُ نَبِيٌّ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] berkata, telah menceritakan kepada kami [Ibnu Wahb] ia berkata; telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] bahwa [Abu Salamah bin 'Abdurrahman] mengabarkan kepadanya bahwa [Abu Hurairah] berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku adalah orang yang paling berhak dengan diri Isa bin Maryam, para Nabi adalah saudara, dan antara aku dengan Isa tidak ada seorang Nabi pun.\""
            },
            {
                "number": 4056,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا سُهَيْلُ بْنُ أَبِي صَالِحٍ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْإِيمَانُ بِضْعٌ وَسَبْعُونَ أَفْضَلُهَا قَوْلُ لَا إِلَهَ إِلَّا اللَّهُ وَأَدْنَاهَا إِمَاطَةُ الْعَظْمِ عَنْ الطَّرِيقِ وَالْحَيَاءُ شُعْبَةٌ مِنْ الْإِيمَانِ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Hammad] berkata, telah mengabarkan kepada kami [Suhail bin Abu Shalih] dari [Abdullah bin Dinar] dari [Abu Shalih] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Iman itu ada tujuh puluh cabang, yang paling tinggi adalah ucapan LAA ILAAHA ILLAALLAH dan yang paling rendah adalah menyingkirkan tulang dari jalan, dan malu adalah bagian dari keimanan.\""
            },
            {
                "number": 4057,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنِي يَحْيَى بْنُ سَعِيدٍ عَنْ شُعْبَةَ حَدَّثَنِي أَبُو جَمْرَةَ قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ قَالَإِنَّ وَفْدَ عَبْدِ الْقَيْسِ لَمَّا قَدِمُوا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَهُمْ بِالْإِيمَانِ بِاللَّهِ قَالَ أَتَدْرُونَ مَا الْإِيمَانُ بِاللَّهِ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ شَهَادَةُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ وَإِقَامُ الصَّلَاةِ وَإِيتَاءُ الزَّكَاةِ وَصَوْمُ رَمَضَانَ وَأَنْ تُعْطُوا الْخُمْسَ مِنْ الْمَغْنَمِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] berkata, telah menceritakan kepadaku [Yahya bin Sa'id] dari [Syu'bah] berkata, telah menceritakan kepadaku [Abu Hamzah] ia berkata; Aku mendengar [Ibnu Abbas] ia berkata, \"Ketika utusan Abdu Qais datang kepada Rasulullah shallallahu 'alaihi wasallam, beliau memerintahkan mereka untuk beriman kepada Allah. Beliau bertanya: \"Tahukah kalian yang dimaksud dengan iman kepada Allah?\" para sahabat menjawab, \"Allah dan Rasul-Nya lebih tahu.\" Beliau bersabda: \"Bersaksi bahwa tidak ada tuhan -yang berhak untuk disembah- selain Allah dan Muhammad adalah Rasulullah, melaksanakan shalat, menunaikan zakat, puasa ramadhan dan engkau keluarkan seperlima ghanimah.\""
            },
            {
                "number": 4058,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ الْعَبْدِ وَبَيْنَ الْكُفْرِ تَرْكُ الصَّلَاةِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] berkata, telah menceritakan kepada kami [Waki'] berkata, telah menceritakan kepada kami [Sufyan] dari [Abu Az Zubair] dari [Jabir] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pemisah antara seorang hamba dengan kekafiran ada meninggalkan shalat.\""
            },
            {
                "number": 4059,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ بَكْرِ بْنِ مُضَرَ عَنْ ابْنِ الْهَادِ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ قَالَ مَا رَأَيْتُ مِنْ نَاقِصَاتِ عَقْلٍ وَلَا دِينٍ أَغْلَبَ لِذِي لُبٍّ مِنْكُنَّ قَالَتْ وَمَا نُقْصَانُ الْعَقْلِ وَالدِّينِ قَالَ أَمَّا نُقْصَانُ الْعَقْلِ فَشَهَادَةُ امْرَأَتَيْنِ شَهَادَةُ رَجُلٍ وَأَمَّا نُقْصَانُ الدِّينِ فَإِنَّ إِحْدَاكُنَّ تُفْطِرُ رَمَضَانَ وَتُقِيمُ أَيَّامًا لَا تُصَلِّي",
                "id": "Telah menceritakan kepada kami [Ahmad bin Amru bin As Sarh] berkata, telah menceritakan kepada kami [Ibnu Wahb] dari [Bakr bin Mudhar] dari [Ibnul Had] dari [Abdullah bin Dinar] dari [Abdullah bin Umar] bahwa Rasulullah bersabda: \"Aku tidak pernah melihat seorang yang mempunyai hati, yang agama dan akalnya kurang selain kalian (para wanita).\" Seorang wanita bertanya, \"Apakah kekurangan para wanita dalam hal agama dan akal?\" beliau bersabda: \"Kurangnya akal itu adalah, bahwa persaksian dua orang wanita sebanding dengan persaksian seorang laki-laki. Sedangkan kurangnya agama kalian adalah, bahwa salah seorang dari kalian berbuka di sebagian ramadhan (karena haidh atau menyusui) dan tidak mengerjakan shalat selama beberapa hari.\""
            },
            {
                "number": 4060,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ الْمَعْنَى قَالَا حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ سِمَاكٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَلَمَّا تَوَجَّهَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْكَعْبَةِ قَالُوا يَا رَسُولَ اللَّهِ فَكَيْفَ الَّذِينَ مَاتُوا وَهُمْ يُصَلُّونَ إِلَى بَيْتِ الْمَقْدِسِ فَأَنْزَلَ اللَّهُ تَعَالَى{ وَمَا كَانَ اللَّهُ لِيُضِيعَ إِيمَانَكُمْ }",
                "id": "Telah menceritakan kepada kami [Muhammad bin Sulaiman Al Anbari] dan [Utsman bin Abu Syaibah] secara makna, keduanya berkata; telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Simak] dari [Ikrimah] dari [Ibnu Abbas] ia berkata, \"Ketika Nabi shallallahu 'alaihi wasallam (Shalat) menghadap ke arah Ka'bah orang-orang bertanya, \"Wahai Rasulullah, bagaimana dengan orang-orang yang telah meninggal, sementara mereka (dahulu) shalat menghadap ke arah Baitul Maqdis?\" Maka Allah Azza Wa Jalla kemudian menurunkan ayat: '(dan Allah tidak akan menyia-nyiakan imanmu) ' -Qs. Al Baqarah: 143-"
            },
            {
                "number": 4061,
                "arab": "حَدَّثَنَا مُؤَمَّلُ بْنُ الْفَضْلِ حَدَّثَنَا مُحَمَّدُ بْنُ شُعَيْبِ بْنِ شَابُورَ عَنْ يَحْيَى بْنِ الْحَارِثِ عَنْ الْقَاسِمِ عَنْ أَبِي أُمَامَةَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ مَنْ أَحَبَّ لِلَّهِ وَأَبْغَضَ لِلَّهِ وَأَعْطَى لِلَّهِ وَمَنَعَ لِلَّهِ فَقَدْ اسْتَكْمَلَ الْإِيمَانَ",
                "id": "Telah menceritakan kepada kami [Muammal Ibnul Fadhl] berkata, telah menceritakan kepada kami [Muhammad bin Syu'aib bin Syabur] dari [Yahya Ibnul Harits] dari [Al Qasim] dari [Abu Umamah] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa mencintai karena Allah, membenci karena Allah, memberi karena Allah dan melarang (menahan) karena Allah, maka sempurnalah imannya.\""
            },
            {
                "number": 4062,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَكْمَلُ الْمُؤْمِنِينَ إِيمَانًا أَحْسَنُهُمْ خُلُقًا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] berkata, telah menceritakan kepada kami [Yahya bin Sa'id] dari [Muhammad bin Amru] dari [Abu Salamah] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kaum mukminin yang paling baik imannya adalah yang paling baik akhlaknya.\""
            },
            {
                "number": 4063,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ حَدَّثَنَا مُحَمَّدُ بْنُ ثَوْرٍ عَنْ مَعْمَرٍ قَالَ وَأَخْبَرَنِي الزُّهْرِيُّ عَنْ عَامِرِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ عَنْ أَبِيهِ قَالَأَعْطَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رِجَالًا وَلَمْ يُعْطِ رَجُلًا مِنْهُمْ شَيْئًا فَقَالَ سَعْدٌ يَا رَسُولَ اللَّهِ أَعْطَيْتَ فُلَانًا وَفُلَانًا وَلَمْ تُعْطِ فُلَانًا شَيْئًا وَهُوَ مُؤْمِنٌ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْ مُسْلِمٌ حَتَّى أَعَادَهَا سَعْدٌ ثَلَاثًا وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ أَوْ مُسْلِمٌ ثُمَّ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي أُعْطِي رِجَالًا وَأَدَعُ مَنْ هُوَ أَحَبُّ إِلَيَّ مِنْهُمْ لَا أُعْطِيهِ شَيْئًا مَخَافَةَ أَنْ يُكَبُّوا فِي النَّارِ عَلَى وُجُوهِهِمْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ubaid] berkata, telah menceritakan kepada kami [Muhammad bin Tsaur] dari [Ma'mar] ia berkata; telah mengabarkan kepadaku [Az Zuhri] dari [Amir bin Sa'd bin Abu Waqash] dari [Bapaknya] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah memberikan sesuatu kepada beberapa laki-laki, namun tidak memberikan kepada seseorang dari mereka. sa'd lalu berkata, \"Wahai Rasulullah, engkau memberikan kepada si fulan dan si fulan, tetapi engkau tidak memberikan sesuatu pun kepada si fulan yang lain, padahal ia seorang mukmin?\" Nabi shallallahu 'alaihi wasallam lalu bersabda: \"Ataukah ia hanya seorang muslim?\" ucapan itu Sa'd ulangi hingga tiga kali, dan Nabi shallallahu 'alaihi wasallam selalu mengatakan: \"Ataukah ia hanya seorang muslim?\" setelah itu Nabi shallallahu 'alaihi wasallam bersabda: \"Aku memberikan kepada beberapa orang dan tidak memberikan kepada sebagian lain yang (dia) lebih aku sukai dari pada mereka, karena kawatir wajah mereka akan dibenamkan ke dalam api.\""
            },
            {
                "number": 4064,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ حَدَّثَنَا ابْنُ ثَوْرٍ عَنْ مَعْمَرٍ قَالَ وَقَالَ الزُّهْرِيُّ { قُلْ لَمْ تُؤْمِنُوا وَلَكِنْ قُولُوا أَسْلَمْنَا } قَالَ نَرَى أَنَّ الْإِسْلَامَ الْكَلِمَةُ وَالْإِيمَانَ الْعَمَلُ",
                "id": "Telah menceritakan kepada kami Muhammad bin Ubaid berkata: telah menceritakan kepada kami Ibnu Tsaur dari Ma'mar ia berkata: Az zuhri berkata tentang firman Allah: {katakanlah (kepada mereka): 'Kamu belum beriman, tetapi katakanlah, 'Kami telah tunduk'} (Al Hujurat: 14) ia mengatakan: \"Kami berpandangan bahwa Islam itu adalah ucapan sedangkan iman adalah pengamalan.\""
            },
            {
                "number": 4065,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ ح و حَدَّثَنَا إِبْرَاهِيمُ بْنُ بَشَّارٍ حَدَّثَنَا سُفْيَانُ الْمَعْنَى قَالَا حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ عَامِرِ بْنِ سَعْدٍ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَسَمَ بَيْنَ الْمُسْلِمِينَ قَسْمًا فَقُلْتُ أَعْطِ فُلَانًا فَإِنَّهُ مُؤْمِنٌ قَالَ أَوْ مُسْلِمٌ إِنِّي لَأُعْطِي الرَّجُلَ الْعَطَاءَ وَغَيْرُهُ أَحَبُّ إِلَيَّ مِنْهُ مَخَافَةَ أَنْ يُكَبَّ عَلَى وَجْهِهِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] berkata, telah menceritakan kepada kami [Abdurrazaq]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ibrahim bin Basysyar] berkata, telah menceritakan kepada kami [Sufyan] secara makna, keduanya berkata; telah menceritakan kepada kami [Ma'mar] dari [Az Zuhri] dari [Amir bin Sa'd] dari [Bapaknya] ia berkata, \"Nabi shallallahu 'alaihi wasallam membagi-bagikan sesuatu kepada kaum muslimin.\" Aku (Sa'd) lalu berkata, \"Berilah si fulan, sebab ia seorang mukmin.\" Beliau bersabda: \"Ataukah ia hanya seorang muslim? Sungguh, aku memberikan pemberian kepada seorang laki-laki, sementara yang lain (yang tidak diberi) lebih aku sukai darinya; hal itu karena kawatir jika wajahnya akan dibenamkan ke dalam (neraka).\""
            },
            {
                "number": 4066,
                "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا شُعْبَةُ قَالَ وَاقِدُ بْنُ عَبْدِ اللَّهِ أَخْبَرَنِي عَنْ أَبِيهِ أَنَّهُ سَمِعَ ابْنَ عُمَرَ يُحَدِّثُعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ لَا تَرْجِعُوا بَعْدِي كُفَّارًا يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ",
                "id": "Telah menceritakan kepada kami [Abu Al Walid Ath Thayalisi] berkata, telah menceritakan kepada kami [Syu'bah] berkata; [Waqid bin Abdullah] telah mengabarkan kepadaku dari [Bapaknya] bahwasanya ia mendengar [Ibnu Umar] menceritakan dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Janganlah kalian kembali kepada kakafiran sepeninggalku, lalu saling bunuh di antara kalian.\""
            },
            {
                "number": 4067,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ فُضَيْلِ بْنِ غَزْوَانَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّمَا رَجُلٍ مُسْلِمٍ أَكْفَرَ رَجُلًا مُسْلِمًا فَإِنْ كَانَ كَافِرًا وَإِلَّا كَانَ هُوَ الْكَافِرُ",
                "id": "Telah menceritakan kepada kami Utsman bin Abu Syaibah berkata: telah menceritakan kepada kami Jarir dari Fudhail bin Ghazwan dari Nafi' dari Ibnu Umar ia berkata: Rasulullah shallallahu 'alaihi wa sallam bersabda: \"Seorang muslim yang mengkafirkan saudaranya sesama muslim, jika memang benar maka ia kafir. Tetapi jika tidak benar, maka kekafiran itu akan kembali kepada dirinya (orang yang menuduh).\""
            },
            {
                "number": 4068,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ حَدَّثَنَا الْأَعْمَشُ عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ عَنْ مَسْرُوقٍ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْبَعٌ مَنْ كُنَّ فِيهِ فَهُوَ مُنَافِقٌ خَالِصٌ وَمَنْ كَانَتْ فِيهِ خَلَّةٌ مِنْهُنَّ كَانَ فِيهِ خَلَّةٌ مِنْ نِفَاقٍ حَتَّى يَدَعَهَا إِذَا حَدَّثَ كَذَبَ وَإِذَا وَعَدَ أَخْلَفَ وَإِذَا عَاهَدَ غَدَرَ وَإِذَا خَاصَمَ فَجَرَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abdullah bin Numair] berkata, telah menceritakan kepada kami [Al A'masy] dari [Abdullah bin Murrah] dari [Masruq] dari [Abdullah bin Amru] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang pada dirinya ada empat hal, maka ia adalah seorang munafik tulen, namun jika hanya ada sebagian, maka pada dirinya ada sebagian sifat munafik hingga ia meninggalkannya; jika berbicara berdusta, jika berjanji mengingkari, jika diberi amanah khianat dan jika berselisih berlaku curang.\""
            },
            {
                "number": 4069,
                "arab": "حَدَّثَنَا أَبُو صَالِحٍ الْأَنْطَاكِيُّ أَخْبَرَنَا أَبُو إِسْحَقَ الْفَزَارِيُّ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَزْنِي الزَّانِي حِينَ يَزْنِي وَهُوَ مُؤْمِنٌ وَلَا يَسْرِقُ حِينَ يَسْرِقُ وَهُوَ مُؤْمِنٌ وَلَا يَشْرَبُ الْخَمْرَ حِينَ يَشْرَبُهَا وَهُوَ مُؤْمِنٌ وَالتَّوْبَةُ مَعْرُوضَةٌ بَعْدُ",
                "id": "Telah menceritakan kepada kami [Abu Shalih Al Anthaki] berkata, telah mengabarkan kepada kami [Abu Ishaq Al Fazari] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang yang berzina tidak disebut mukmin saat berzina, seorang pencuri tidak disebut mukmin saat mencuri, seorang peminum khamer tidak disebut mukmin saat minum khamer, dan pintu taubat akan selalu dibuka setelahnya.\""
            },
            {
                "number": 4070,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ سُوَيْدٍ الرَّمْلِيُّ حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ أَخْبَرَنَا نَافِعٌ يَعْنِي ابْنَ زَيْدٍ قَالَ حَدَّثَنِي ابْنُ الْهَادِ أَنَّ سَعِيدَ بْنَ أَبِي سَعِيدٍ الْمَقْبُرِيَّ حَدَّثَهُ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا زَنَى الرَّجُلُ خَرَجَ مِنْهُ الْإِيمَانُ كَانَ عَلَيْهِ كَالظُّلَّةِ فَإِذَا انْقَطَعَ رَجَعَ إِلَيْهِ الْإِيمَانُ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Suwaid Ar Ramli] berkata, telah menceritakan kepada kami [Ibnu Abu Maryam] berkata, telah mengabarkan kepada kami [Nafi'] -maksudnya Nafi' bin Zaid- ia berkata; telah menceritakan kepadaku [Ibnul Had] bahwa [Sa'id bin Abu Sa'id Al Maqburi] menceritakan kepadanya, Bahwasanya ia pernah mendengar [Abu Hurairah] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika seorang laki-laki berzina maka keimanan yang ada pada dirinya keluar seperti perginya awan, jika telah selesai maka keimanan tersebut kembali kepadanya.\""
            },
            {
                "number": 4071,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ قَالَ حَدَّثَنِي بِمِنًى عَنْ أَبِيهِ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْقَدَرِيَّةُ مَجُوسُ هَذِهِ الْأُمَّةِ إِنْ مَرِضُوا فَلَا تَعُودُوهُمْ وَإِنْ مَاتُوا فَلَا تَشْهَدُوهُمْ",
                "id": "Telah menceritakan kepada kami Musa bin Isma'il berkata: telah menceritakan kepada kami Abdul Aziz bin Abu Hazim ia berkata: ia telah menceritakan kepadaku di Mina, dari Bapaknya dari Ibnu Umar dari Nabi shallallahu 'alaihi wa sallam, beliau bersabda: \"Kaum Qadariyah adalah majusinya umat ini, jika sakit maka jangan kalian jenguk mereka, dan jika mati maka jangan kalian iringi jenazahnya.\""
            },
            {
                "number": 4072,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ عُمَرَ بْنِ مُحَمَّدٍ عَنْ عُمَرَ مَوْلَى غُفْرَةَ عَنْ رَجُلٍ مِنْ الْأَنْصَارِ عَنْ حُذَيْفَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِكُلِّ أُمَّةٍ مَجُوسٌ وَمَجُوسُ هَذِهِ الْأُمَّةِ الَّذِينَ يَقُولُونَ لَا قَدَرَ مَنْ مَاتَ مِنْهُمْ فَلَا تَشْهَدُوا جَنَازَتَهُ وَمَنْ مَرِضَ مِنْهُمْ فَلَا تَعُودُوهُمْ وَهُمْ شِيعَةُ الدَّجَّالِ وَحَقٌّ عَلَى اللَّهِ أَنْ يُلْحِقَهُمْ بِالدَّجَّالِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abu Katsir] berkata, telah mengabarkan kepada kami [Sufyan] dari [Umar bin Muhammad] dari [Umar] -mantan budak (yang telah dimerdekakan oleh) Ghufrah- dari [seorang laki-laki] Anshar, dari [Hudzaifah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Setiap umat ada majusinya, dan majusinya umat ini adalah orang-orang yang mengatakan 'tidak ada takdir'. Jika ada yang meninggal dari mereka maka jangan kalian jenguk jenazahnya, dan jika ada yang sakit dari mereka maka jangan kalian jengguk. Mereka adalah kelompoknya Dajjal, maka telah menjadi hak Allah untuk menggabungkan mereka dengan Dajjal.\""
            },
            {
                "number": 4073,
                "arab": "حَدَّثَنَا مُسَدَّدٌ أَنَّ يَزِيدَ بْنَ زُرَيْعٍ وَيَحْيَى بْنَ سَعِيدٍ حَدَّثَاهُمْ قَالَا حَدَّثَنَا عَوْفٌ قَالَ حَدَّثَنَا قَسَامَةُ بْنُ زُهَيْرٍ قَالَ حَدَّثَنَا أَبُو مُوسَى الْأَشْعَرِيُّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ خَلَقَ آدَمَ مِنْ قَبْضَةٍ قَبَضَهَا مِنْ جَمِيعِ الْأَرْضِ فَجَاءَ بَنُو آدَمَ عَلَى قَدْرِ الْأَرْضِ جَاءَ مِنْهُمْ الْأَحْمَرُ وَالْأَبْيَضُ وَالْأَسْوَدُ وَبَيْنَ ذَلِكَ وَالسَّهْلُ وَالْحَزْنُ وَالْخَبِيثُ وَالطَّيِّبُ زَادَ فِي حَدِيثِ يَحْيَى وَبَيْنَ ذَلِكَوَالْإِخْبَارُ فِي حَدِيثِ يَزِيدَ",
                "id": "Telah menceritakan kepada kami [Musaddad] bahwa [Yazid bin Zurai'] dan [Yahya bin Sa'id] menceritakan kepada mereka, keduanya berkata; telah menceritakan kepada kami [Auf] ia berkata; telah menceritakan kepada kami [Qasamah bin Zuhair] ia berkata; telah menceritakan kepada kami [Abu Musa Al Asy'ari] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah menciptakan Adam dari segenggam tanah dari semua jenis tanah. Kemudian keturunannya datang beragam sesuai dengan unsur tanahnya. Ada di antara mereka yang berkulit merah, putih, hitam, dan antara warna-warna itu. Ada yang lembut dan ada yang kasar, ada yang buruk dan ada yang baik.\" Dan ada tambahan dalam hadits Yahya; \"dan ada pula di antara (sifat) itu\", adapun lafadz (redaksi) hadits di atas adalah riwayat Yazid. "
            },
            {
                "number": 4074,
                "arab": "حَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ حَدَّثَنَا الْمُعْتَمِرُ قَالَ سَمِعْتُ مَنْصُورَ بْنَ الْمُعْتَمِرِ يُحَدِّثُ عَنْ سَعْدِ بْنِ عُبَيْدَةَ عَنْ عَبْدِ اللَّهِ بْنِ حَبِيبٍ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ عَنْ عَلِيٍّ عَلَيْهِ السَّلَام قَالَ كُنَّا فِي جَنَازَةٍ فِيهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِبَقِيعِ الْغَرْقَدِ فَجَاءَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَلَسَ وَمَعَهُ مِخْصَرَةٌ فَجَعَلَ يَنْكُتُ بِالْمِخْصَرَةِ فِي الْأَرْضِ ثُمَّ رَفَعَ رَأْسَهُ فَقَالَ مَا مِنْكُمْ مِنْ أَحَدٍ مَا مِنْ نَفْسٍ مَنْفُوسَةٍ إِلَّا كَتَبَ اللَّهُ مَكَانَهَا مِنْ النَّارِ أَوْ مِنْ الْجَنَّةِ إِلَّا قَدْ كُتِبَتْ شَقِيَّةً أَوْ سَعِيدَةً قَالَ فَقَالَ رَجُلٌ مِنْ الْقَوْمِ يَا نَبِيَّ اللَّهِ أَفَلَا نَمْكُثُ عَلَى كِتَابِنَا وَنَدَعُ الْعَمَلَ فَمَنْ كَانَ مِنْ أَهْلِ السَّعَادَةِ لَيَكُونَنَّ إِلَى السَّعَادَةِ وَمَنْ كَانَ مِنْ أَهْلِ الشِّقْوَةِ لَيَكُونَنَّ إِلَى الشِّقْوَةِ قَالَ اعْمَلُوا فَكُلٌّ مُيَسَّرٌ أَمَّا أَهْلُ السَّعَادَةِ فَيُيَسَّرُونَ لِلسَّعَادَةِ وَأَمَّا أَهْلُ الشِّقْوَةِ فَيُيَسَّرُونَ لِلشِّقْوَةِ ثُمَّ قَالَ نَبِيُّ اللَّهِ { فَأَمَّا مَنْ أَعْطَى وَاتَّقَى وَصَدَّقَ بِالْحُسْنَى فَسَنُيَسِّرُهُ لِلْيُسْرَى وَأَمَّا مَنْ بَخِلَ وَاسْتَغْنَى وَكَذَّبَ بِالْحُسْنَى فَسَنُيَسِّرُهُ لِلْعُسْرَى }",
                "id": "Telah menceritakan kepada kami Musaddad bin Musarhad berkata: telah menceritakan kepada kami Al Mu'tamir ia berkata: Aku mendengar Manshur Ibnul Mu'tamir menceritakan dari Sa'd bin Ubaidah dari Abdullah bin Habib, Abu 'Abdurrahman As Sulami dari Ali Alaihis Salam ia berkata: \"Kami pernah berada di pemakaman Baqi Gharqad dan saat itu ada Rasulullah shallallahu 'alaihi wa sallam. Rasulullah shallallahu 'alaihi wa sallam lantas mendekat dan duduk sambil membawa sebatang tongkat. Beliau kemudian membuat garis dengan tongkatnya seraya mengangkat kepala, beliau bersabda: \"Tidak seorang pun di antara kalian kecuali Allah telah menentukan tempatnya, di neraka atau di surga. Dan tidak seorang pun dari kalian kecuali Allah telah menentukan apakah ia menjadi bahagia atau sengsara.\" Seorang laki-laki lalu bertanya: \"Tidakkah sebaiknya jika kita berdiam diri saja mengikuti apa yang telah digariskan oleh takdir kita dan meninggalkan untuk beramal. Karena Jika ia termasuk orang yang digariskan mendapat kebahagiaan maka ia akan bahagia, dan jika ia termasuk orang yang digariskan mendapat kesengsaraan maka ia akan sengsara.\" Beliau bersabda: \"Hendaklah kalian tetap beramal, sebab setiap orang akan diberi kemudahan (untuk meniti takdirnya). Orang yang ditakdirkan untuk bahagia maka ia akan dimudahkan untuk mendapatkan kebahagiaan itu, dan orang yang ditakdirkan untuk sengsara maka ia akan dimudahkan untuk mendapatkan kesengsaraan.\" Kemudian beliau membaca: {Adapun orang yang memberikan (hartanya di jalan Allah) dan bertakwa, dan membenarkan adanya pahala yang terbaik (surga), maka Kami kelak akan menyiapkan baginya jalan yang mudah. Dan adapun orang-orang yang bakhil dan merasa dirinya cukup, serta mendustakan pahala terbaik. maka kelak Kami akan menyiapkan baginya (jalan) yang sukar} (Al Lail: 5-10)."
            },
            {
                "number": 4075,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا كَهْمَسٌ عَنْ ابْنِ بُرَيْدَةَ عَنْ يَحْيَى بْنِ يَعْمَرَ قَالَ كَانَ أَوَّلَ مَنْ تَكَلَّمَ فِي الْقَدَرِ بِالْبَصْرَةِ مَعْبَدٌ الْجُهَنِيُّ فَانْطَلَقْتُ أَنَا وَحُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ الْحِمْيَرِيُّ حَاجَّيْنِ أَوْ مُعْتَمِرَيْنِ فَقُلْنَا لَوْ لَقِينَا أَحَدًا مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلْنَاهُ عَمَّا يَقُولُ هَؤُلَاءِ فِي الْقَدَرِ فَوَفَّقَ اللَّهُ لَنَا عَبْدَ اللَّهِ بْنَ عُمَرَ دَاخِلًا فِي الْمَسْجِدِ فَاكْتَنَفْتُهُ أَنَا وَصَاحِبِي فَظَنَنْتُ أَنَّ صَاحِبِي سَيَكِلُ الْكَلَامَ إِلَيَّ فَقُلْتُ أَبَا عَبْدِ الرَّحْمَنِ إِنَّهُ قَدْ ظَهَرَ قِبَلَنَا نَاسٌ يَقْرَءُونَ الْقُرْآنَ وَيَتَفَقَّرُونَ الْعِلْمَ يَزْعُمُونَ أَنْ لَا قَدَرَ وَالْأَمْرَ أُنُفٌ فَقَالَ إِذَا لَقِيتَ أُولَئِكَ فَأَخْبِرْهُمْ أَنِّي بَرِيءٌ مِنْهُمْ وَهُمْ بُرَآءُ مِنِّي وَالَّذِي يَحْلِفُ بِهِ عَبْدُ اللَّهِ بْنُ عُمَرَ لَوْ أَنَّ لِأَحَدِهِمْ مِثْلَ أُحُدٍ ذَهَبًا فَأَنْفَقَهُ مَا قَبِلَهُ اللَّهُ مِنْهُ حَتَّى يُؤْمِنَ بِالْقَدَرِ ثُمَّ قَالَ حَدَّثَنِي عُمَرُ بْنُ الْخَطَّابِ قَالَبَيْنَمَا نَحْنُ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذْ طَلَعَ عَلَيْنَا رَجُلٌ شَدِيدُ بَيَاضِ الثِّيَابِ شَدِيدُ سَوَادِ الشَّعْرِ لَا يُرَى عَلَيْهِ أَثَرُ السَّفَرِ وَلَا نَعْرِفُهُ حَتَّى جَلَسَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَسْنَدَ رُكْبَتَيْهِ إِلَى رُكْبَتَيْهِ وَوَضَعَ كَفَّيْهِ عَلَى فَخِذَيْهِ وَقَالَ يَا مُحَمَّدُ أَخْبِرْنِي عَنْ الْإِسْلَامِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْإِسْلَامُ أَنْ تَشْهَدَ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ وَتُقِيمَ الصَّلَاةَ وَتُؤْتِيَ الزَّكَاةَ وَتَصُومَ رَمَضَانَ وَتَحُجَّ الْبَيْتَ إِنْ اسْتَطَعْتَ إِلَيْهِ سَبِيلًا قَالَ صَدَقْتَ قَالَ فَعَجِبْنَا لَهُ يَسْأَلُهُ وَيُصَدِّقُهُ قَالَ فَأَخْبِرْنِي عَنْ الْإِيمَانِ قَالَ أَنْ تُؤْمِنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ وَالْيَوْمِ الْآخِرِ وَتُؤْمِنَ بِالْقَدَرِ خَيْرِهِ وَشَرِّهِ قَالَ صَدَقْتَ قَالَ فَأَخْبِرْنِي عَنْ الْإِحْسَانِ قَالَ أَنْ تَعْبُدَ اللَّهَ كَأَنَّكَ تَرَاهُ فَإِنْ لَمْ تَكُنْ تَرَاهُ فَإِنَّهُ يَرَاكَ قَالَ فَأَخْبِرْنِي عَنْ السَّاعَةِ قَالَ مَا الْمَسْئُولُ عَنْهَا بِأَعْلَمَ مِنْ السَّائِلِ قَالَ فَأَخْبِرْنِي عَنْ أَمَارَاتِهَا قَالَ أَنْ تَلِدَ الْأَمَةُ رَبَّتَهَا وَأَنْ تَرَى الْحُفَاةَ الْعُرَاةَ الْعَالَةَ رِعَاءَ الشَّاءِ يَتَطَاوَلُونَ فِي الْبُنْيَانِ قَالَ ثُمَّ انْطَلَقَ فَلَبِثْتُ ثَلَاثًا ثُمَّ قَالَ يَا عُمَرُ هَلْ تَدْرِي مَنْ السَّائِلُ قُلْتُ اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ فَإِنَّهُ جِبْرِيلُ أَتَاكُمْ يُعَلِّمُكُمْ دِينَكُمْحَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ عُثْمَانَ بْنِ غِيَاثٍ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ عَنْ يَحْيَى بْنِ يَعْمَرَ وَحُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ قَالَا لَقِيَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ فَذَكَرْنَا لَهُ الْقَدَرَ وَمَا يَقُولُونَ فِيهِ فَذَكَرَ نَحْوَهُ زَادَ قَالَ وَسَأَلَهُ رَجُلٌ مِنْ مُزَيْنَةَ أَوْ جُهَيْنَةَ فَقَالَ يَا رَسُولَ اللَّهِ فِيمَا نَعْمَلُ أَفِي شَيْءٍ قَدْ خَلَا أَوْ مَضَى أَوْ فِي شَيْءٍ يُسْتَأْنَفُ الْآنَ قَالَ فِي شَيْءٍ قَدْ خَلَا وَمَضَى فَقَالَ الرَّجُلُ أَوْ بَعْضُ الْقَوْمِ فَفِيمَ الْعَمَلُ قَالَ إِنَّ أَهْلَ الْجَنَّةِ يُيَسَّرُونَ لِعَمَلِ أَهْلِ الْجَنَّةِ وَإِنَّ أَهْلَ النَّارِ يُيَسَّرُونَ لِعَمَلِ أَهْلِ النَّارِ حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ حَدَّثَنَا الْفِرْيَابِيُّ عَنْ سُفْيَانَ قَالَ حَدَّثَنَا عَلْقَمَةُ بْنُ مَرْثَدٍ عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ عَنْ ابْنِ يَعْمَرَ بِهَذَا الْحَدِيثِ يَزِيدُ وَيَنْقُصُ قَالَ فَمَا الْإِسْلَامُ قَالَ إِقَامُ الصَّلَاةِ وَإِيتَاءُ الزَّكَاةِ وَحَجُّ الْبَيْتِ وَصَوْمُ شَهْرِ رَمَضَانَ وَالِاغْتِسَالُ مِنْ الْجَنَابَةِ قَالَ أَبُو دَاوُد عَلْقَمَةُ مُرْجِئٌ",
                "id": "Telah menceritakan kepada kami [Ubaidullah bin Mu'adz] berkata, telah menceritakan kepada kami [Bapakku] berkata, telah menceritakan kepada kami [Kahmas] dari [Ibnu Buraidah] dari [Yahya bin Ya'mar] ia berkata, \"Orang yang pertama kali berbicara masalah takdir di kota Basrah adalah Ma'bad Al Juhani. Aku dan Humaid bin 'Abdurrahman Al Himyari pergi untuk berhaji atau umrah. Kami lalu bergumam, \"Jika nanti kami bertemu dengan salah seorang sahabat Rasulullah shallallahu 'alaihi wasallam, maka akan kami tanyakan kepadanya tentang apa yang dikatakan oleh orang-orang seputar takdir. Lalu Allah mentakdirkan kami bertemu dengan [Abdullah bin Umar] ketika ia akan masuk ke dalam masjid, sehingga aku dan sahabatku itu mendekatinya. Aku mengira sahabatku akan mewakilkan pembicaraan itu kepadaku, maka aku pun berkata, \"Wahai Abu 'Abdurrahman, di antara kami telah muncul orang-orang yang membaca Al-Qur'an dan tekun dalam menuntut ilmu, namun mereka menyakini bahwa tidak ada takdir, dan sesuatu itu terjadi begitu saja tanpa ada campur tangan takdir!\" Ibnu Umar lalu berkata, \"Jika kalian berjumpa dengan mereka maka katakanlah bahwa aku berlepas diri dari mereka dan mereka juga berlepas diri dariku. Dan demi Dzat yang Abdullah bin Umar bersumpah atas nama-Nya, sekiranya mereka memiliki emas sebesar gunung uhud, lalu mereka menginfakkannya, maka Allah tidak akan menerimanya hingga mereka beriman dengan takdir.\" Kemudian ia berkata, \" [Umar Ibnul Khaththab] menceritakan kepadaku, ia berkata, \"Sewaktu kami sedang bersama Rasulullah shallallahu 'alaihi wasallam, tiba-tiba datang seorang laki-laki yang mengenakan pakaian yang sangat putih dan rambutnya sangat hitam. Tidak ada tanda-tanda bahwa ia dalam perjalanan yang jauh, namun tidak seorang pun dari kami yang mengenalnya. Kemudian ia mendekati Rasulullah shallallahu 'alaihi wasallam, ia menyandarkan lututnya pada lutut Nabi dan meletakkan kedua telapak tangannya pada kedua paha beliau. Setelah itu ia berkata, \"Wahai Muhammad, kabarkanlah kepadaku tentang Islam?\" Rasulullah shallallahu 'alaihi wasallam lalu menjawab: \"Islam itu adalah engkau bersaksi bahwa tidak ada Tuhan yang berhak disembah selain Allah dan Muhammad adalah utusan-Nya. Engkau tegakkan shalat, engkau tunaikan zakat, engkau kerjakan puasa ramadhan dan berhaji ke Baitullah jika mampu.\" Laki-laki itu berkata, \"Engkau benar.\" Umar berkata, \"Kami pun merasa heran kepadanya, ia yang bertanya dan ia sendiri yang membenarkannya\". Laki-laki itu bertanya lagi, \"Kabarkanlah kepadaku tentang iman?\" beliau menjawab: \"Iman adalah engkau beriman kepada Allah, para malaikat-Nya, kitab-kitab-Nya, para Rasul-Nya, hari akhir dan beriman dengan takdir; yang buruk atau yang baik.\" Laki-laki itu berkata, \"Engkau benar.\" Laki-laki itu melanjutkan, \"Kabarkanlah kepadaku apa itu ihsan?\" beliau menjawab: \"Engkau beribadah kepada Allah seakan-akan melihat-Nya, jika engkau tidak dapat melihat-Nya, sesungguhnya Ia dapat melihatmu.\" Laki-laki itu bertanya lagi, \"Kabarkanlah kepadaku tentang hari kiamat?\" beliau menjawab: \"tidaklah orang yang ditanya lebih tahu dari pada yang bertanya.\" Laki-laki itu bertanya, \"Kalau begitu, kabarkanlah kepadaku tanda-tandanya?\" beliau menjawab: \"Jika seorang budak telah melahirkan tuannya, lalu engkau melihat orang-orang yang telanjang kaki (miskin) lagi pengembala domba telah berlomba-lomba membuat bangunan yang tinggi.\" Umar berkata, \"Laki-laki itu lalu pergi, dan aku tetap berdiam diri selama tiga hari. Kemudian beliau bersabda: \"Wahai Umar, tahukah kamu siapa laki-laki yang bertanya itu?\" Aku menjawab, \"Allah dan Rasul-Nya lebih tahu. Beliau bersabda: \"Itu adalah Jibril, ia datang kepada kalian untuk mengajarkan tentang perkara agama kalian.\" Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Yahya] dari [Utsman bin Ghiyats] ia berkata; telah menceritakan kepadaku [Abdullah bin Buraidah] dari [Yahya bin Ya'mar] dan [Humaid bin 'Abdurrahman] keduanya berkata, \"Kami bertemu dengan [Abdullah bin Umar], lalu kami ceritakan kepdanya tentang takdir dan apa yang orang-orang katakan tentang hal itu…. lalu ia menyebutkan sebagaimana hadits tersebut. Namun ia menambahkan, ia berkata \"Lalu ada seorang laki-laki dari Muzainah atau Juhainah bertanya kepada Nabi shallallahu 'alaihi wasallam, \"Wahai Rasulullah, bagaimana kita harus beramal? Apakah amalan itu berdasar pada takdir yang telah berlalu atau berdasar pada sesuatu yang baru?\" beliau menjawab: \"Berdasarkan pada sesuatu yang telah ditetapkan.\" Laki-laki itu, atau sebagian orang bertanya lagi, \"Lalu untuk apa kita beramal?\" beliau menjawab: \"Sesungguhnya ahli surga akan dimudahkan untuk beramal dengan amalan penduduk surga, dan ahli neraka akan dimudahkan untuk beramal dengan amalan penduduk neraka.\" Telah menceritakan kepada kami [Mahmud bin Khalid] berkata, telah menceritakan kepada kami [Al Firyabi] dari [Sufyan] ia berkata; telah menceritakan kepada kami [Alqamah bin Martsad] dari [Sulaiman bin Buraidah] dari [Ibnu Ya'mar] dengan hadits yang sama, \"bertambah dan berkurang.\" Ia bertanya, \"Lalu Islam itu apa?\" Beliau menjawab: \"Menegakkan shalat, menunaikan zakat, melaksanakan haji, puasa pada bulan ramadhan, dan mandi junub.\" Abu Dawud berkata, \"Alqamah adalah seorang murjiah.\""
            },
            {
                "number": 4076,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ أَبِي فَرْوَةَ الْهَمْدَانِيِّ عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ عَنْ أَبِي ذَرٍّ وَأَبِي هُرَيْرَةَ قَالَاكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَجْلِسُ بَيْنَ ظَهْرَيْ أَصْحَابِهِ فَيَجِيءُ الْغَرِيبُ فَلَا يَدْرِي أَيُّهُمْ هُوَ حَتَّى يَسْأَلَ فَطَلَبْنَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَجْعَلَ لَهُ مَجْلِسًا يَعْرِفُهُ الْغَرِيبُ إِذَا أَتَاهُ قَالَ فَبَنَيْنَا لَهُ دُكَّانًا مِنْ طِينٍ فَجَلَسَ عَلَيْهِ وَكُنَّا نَجْلِسُ بِجَنْبَتَيْهِ وَذَكَرَ نَحْوَ هَذَا الْخَبَرِ فَأَقْبَلَ رَجُلٌ فَذَكَرَ هَيْئَتَهُ حَتَّى سَلَّمَ مِنْ طَرَفِ السِّمَاطِ فَقَالَ السَّلَامُ عَلَيْكَ يَا مُحَمَّدُ قَالَ فَرَدَّ عَلَيْهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Jarir] dari [Abu Farwah Al Hamdani] dari [Abu Zur'ah bin Amru bin Jarir] dari [Abu Dzar] dan [Abu Hurairah] keduanya berkata, \"Ketika Rasulullah shallallahu 'alaihi wasallam duduk bersama para sahabatnya, tiba-tiba datang orang asing dan tidak seorang pun dari kami yang mengenalnya, hingga ia minta untuk bertemu (beliau). Lalu kami minta izin kepada beliau untuk membuat tempat duduk, hingga orang-orang asing dapat berjumpa dengannya. Kemudian kami membuatkan beliau tempat duduk dari tanah liat yang agak tinggi, lalu beliau duduk di atasnya sementara kami duduk di sampingnya… Lalu ia menyebutkan sebagaimana hadits tersebut. Kemudian datanglah seorang laki-laki…lalu ia menyebutkan keadaan laki-laki itu hingga ia pun mengucapkan salam dari ujung para jama'ah, ia mengucapkan, \"Semoga keselamatan atas kamu wahai Muhammad.\" Ia (perawi) berkata, \"Nabi shallallahu 'alaihi wasallam lalu manjawab salamnya.\""
            },
            {
                "number": 4077,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ أَبِي سِنَانٍ عَنْ وَهْبِ بْنِ خَالِدٍ الْحِمْصِيِّ عَنْ ابْنِ الدَّيْلَمِيِّ قَالَ أَتَيْتُ أُبَيَّ بْنَ كَعْبٍ فَقُلْتُ لَهُوَقَعَ فِي نَفْسِي شَيْءٌ مِنْ الْقَدَرِ فَحَدِّثْنِي بِشَيْءٍ لَعَلَّ اللَّهَ أَنْ يُذْهِبَهُ مِنْ قَلْبِي قَالَ لَوْ أَنَّ اللَّهَ عَذَّبَ أَهْلَ سَمَاوَاتِهِ وَأَهْلَ أَرْضِهِ عَذَّبَهُمْ وَهُوَ غَيْرُ ظَالِمٍ لَهُمْ وَلَوْ رَحِمَهُمْ كَانَتْ رَحْمَتُهُ خَيْرًا لَهُمْ مِنْ أَعْمَالِهِمْ وَلَوْ أَنْفَقْتَ مِثْلَ أُحُدٍ ذَهَبًا فِي سَبِيلِ اللَّهِ مَا قَبِلَهُ اللَّهُ مِنْكَ حَتَّى تُؤْمِنَ بِالْقَدَرِ وَتَعْلَمَ أَنَّ مَا أَصَابَكَ لَمْ يَكُنْ لِيُخْطِئَكَ وَأَنَّ مَا أَخْطَأَكَ لَمْ يَكُنْ لِيُصِيبَكَ وَلَوْ مُتَّ عَلَى غَيْرِ هَذَا لَدَخَلْتَ النَّارَقَالَ ثُمَّ أَتَيْتُ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ فَقَالَ مِثْلَ ذَلِكَ قَالَ ثُمَّ أَتَيْتُ حُذَيْفَةَ بْنَ الْيَمَانِ فَقَالَ مِثْلَ ذَلِكَ قَالَ ثُمَّ أَتَيْتُ زَيْدَ بْنَ ثَابِتٍ فَحَدَّثَنِي عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] berkata, telah mengabarkan kepada kami [Sufyan] dari [Abu Sinan] dari [Wahb bin Khalid Al Himshi] dari [Ibnu Ad Dailami] ia berkata, \"Aku mendatangi [Ubay bin Ka'b], lalu aku katakan kepadanya, \"Ada sesuatu yang mengganjal dalam hatiku tentang perkara takdir, maka ceritakanlah kepadaku tentang sesuatu semoga Allah menghilangkan keresahan itu dari dalam hatiku.\" Ia menjawab, \"Jika Allah menyiksa semua makluk yang ada di langit dan di bumi, maka itu bukanlah suatu kezhaliman yang Dia lakukan atas mereka, dan sekiranya Dia memberikan rahmat kepada mereka, sesungguhnya rahmat-Nya adalah lebih baik dari amalan yang telah mereka lakukan. Jika engkau bersedekah dengan emas sebesar gunung uhud di jalan Allah, maka Allah tidak akan menerimanya hingga engkau beriman dengan takdir. Dan engkau mengetahui bahwa apa saja yang ditakdirkan menjadi bagianmu tidak akan meleset darimu, dan apa yang tidak ditakdirkan untuk menjadi bagianmu tidak akan engkau dapatkan. Jika engkau meninggal bukan di atas keyakinan yang demikian ini, maka engkau akan masuk neraka.\" Abu Ad Dailami berkata, \"Kemudian aku mendatangi [Abdullah bin Mas'ud], lalu ia mengatakan seperti itu pula. Aku lalu mendatangi [Hudzaifah Ibnul Yaman], lalu ia mengatakan seperti itu pula. Kemudian aku mendatangi [Zaid bin Tsabit], lalu ia menceritakan kepadaku sebuah hadits Nabi shallallahu 'alaihi wasallam seperti itu pula.\""
            },
            {
                "number": 4078,
                "arab": "حَدَّثَنَا جَعْفَرُ بْنُ مُسَافِرٍ الْهُذَلِيُّ حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ حَدَّثَنَا الْوَلِيدُ بْنُ رَبَاحٍ عَنْ إِبْرَاهِيمَ بْنِ أَبِي عَبْلَةَ عَنْ أَبِي حَفْصَةَ قَالَ قَالَ عُبَادَةُ بْنُ الصَّامِتِ لِابْنِهِ يَا بُنَيَّ إِنَّكَ لَنْ تَجِدَ طَعْمَ حَقِيقَةِ الْإِيمَانِ حَتَّى تَعْلَمَ أَنَّ مَا أَصَابَكَ لَمْ يَكُنْ لِيُخْطِئَكَ وَمَا أَخْطَأَكَ لَمْ يَكُنْ لِيُصِيبَكَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ أَوَّلَ مَا خَلَقَ اللَّهُ الْقَلَمَ فَقَالَ لَهُ اكْتُبْ قَالَ رَبِّ وَمَاذَا أَكْتُبُ قَالَ اكْتُبْ مَقَادِيرَ كُلِّ شَيْءٍ حَتَّى تَقُومَ السَّاعَةُ يَا بُنَيَّ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ مَاتَ عَلَى غَيْرِ هَذَا فَلَيْسَ مِنِّي",
                "id": "Telah menceritakan kepada kami Ja'far bin Musafir Al Hudzali berkata: telah menceritakan kepada kami Yahya bin Hassan berkata: telah menceritakan kepada kami Al Walid bin Rabah dari Ibrahim bin Abu Ablah dari Abu Hafshah ia berkata: Ubadah bin Ash Shamit berkata kepada anaknya: \"Wahai anakku, sesungguhnya engkau tidak akan dapat merasakan lezatnya iman hingga engkau bisa memahami bahwa apa yang ditakdirkan menjadi bagianmu tidak akan meleset darimu, dan apa yang tidak ditakdirkan untuk menjadi bagianmu tidak akan engkau dapatkan. Aku pernah mendengar Rasulullah shallallahu 'alaihi wa sallam bersabda: \"Pertama kali yang Allah ciptakan adalah pena, lalu Allah berfirman kepadanya: \"Tulislah!\" pena itu menjawab: \"Wahai Rabb, apa yang harus aku tulis?\" Allah menjawab: \"Tulislah semua takdir yang akan terjadi hingga datangnya hari kiamat.\" Wahai anakku, aku pernah mendengar Rasulullah shallallahu 'alaihi wa sallam bersabda: \"Barangsiapa meninggal tidak di atas keyakinan seperti ini maka ia bukan dari golonganku.\""
            },
            {
                "number": 4079,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا سُفْيَانُ ح و حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ الْمَعْنَى قَالَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرِو بْنِ دِينَارٍ سَمِعَ طَاوُسًا يَقُولُ سَمِعْتُ أَبَا هُرَيْرَةَ يُخْبِرُعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ احْتَجَّ آدَمُ وَمُوسَى فَقَالَ مُوسَى يَا آدَمُ أَنْتَ أَبُونَا خَيَّبْتَنَا وَأَخْرَجْتَنَا مِنْ الْجَنَّةِ فَقَالَ آدَمُ أَنْتَ مُوسَى اصْطَفَاكَ اللَّهُ بِكَلَامِهِ وَخَطَّ لَكَ التَّوْرَاةَ بِيَدِهِ تَلُومُنِي عَلَى أَمْرٍ قَدَّرَهُ عَلَيَّ قَبْلَ أَنْ يَخْلُقَنِي بِأَرْبَعِينَ سَنَةً فَحَجَّ آدَمُ مُوسَىقَالَ أَحْمَدُ بْنُ صَالِحٍ عَنْ عَمْرٍو عَنْ طَاوُسٍ سَمِعَ أَبَا هُرَيْرَةَ",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Sufyan]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ahmad bin Shalih] secara makna, ia berkata; telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Amru bin Dinar] ia mendengar [Thawus] berkata; Aku mendengar [Abu Hurairah] mengabarkan dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Adam dan Musa saling berargumentasi. Musa berkata, \"Wahai Adam, engkau adalah bapak kami, engkau telah merugikan kami dan engkau telah menjadikan kami keluar dari surga! Adam menjawab, \"Wahai Musa, Allah telah memilih dan memberimu kitab Taurat, kenapa engaku menyalahkan aku atas suatu perkara yang Allah telah tetapkan terhadapku empat puluh tahun sebelum aku diciptakan?\" Maka Adam dapat mengalahkan Musa.\" Ahmad bin Shalih menyebutkan dari Amru, dari Thawus, ia mendengar dari Abu Hurairah. "
            },
            {
                "number": 4080,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي هِشَامُ بْنُ سَعْدٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ أَبِيهِ أَنَّ عُمَرَ بْنَ الْخَطَّابِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ مُوسَى قَالَ يَا رَبِّ أَرِنَا آدَمَ الَّذِي أَخْرَجَنَا وَنَفْسَهُ مِنْ الْجَنَّةِ فَأَرَاهُ اللَّهُ آدَمَ فَقَالَ أَنْتَ أَبُونَا آدَمُ فَقَالَ لَهُ آدَمُ نَعَمْ قَالَ أَنْتَ الَّذِي نَفَخَ اللَّهُ فِيكَ مِنْ رُوحِهِ وَعَلَّمَكَ الْأَسْمَاءَ كُلَّهَا وَأَمَرَ الْمَلَائِكَةَ فَسَجَدُوا لَكَ قَالَ نَعَمْ قَالَ فَمَا حَمَلَكَ عَلَى أَنْ أَخْرَجْتَنَا وَنَفْسَكَ مِنْ الْجَنَّةِ فَقَالَ لَهُ آدَمُ وَمَنْ أَنْتَ قَالَ أَنَا مُوسَى قَالَ أَنْتَ نَبِيُّ بَنِي إِسْرَائِيلَ الَّذِي كَلَّمَكَ اللَّهُ مِنْ وَرَاءِ الْحِجَابِ لَمْ يَجْعَلْ بَيْنَكَ وَبَيْنَهُ رَسُولًا مِنْ خَلْقِهِ قَالَ نَعَمْ قَالَ أَفَمَا وَجَدْتَ أَنَّ ذَلِكَ كَانَ فِي كِتَابِ اللَّهِ قَبْلَ أَنْ أُخْلَقَ قَالَ نَعَمْ قَالَ فِيمَ تَلُومُنِي فِي شَيْءٍ سَبَقَ مِنْ اللَّهِ تَعَالَى فِيهِ الْقَضَاءُ قَبْلِي قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَ ذَلِكَ فَحَجَّ آدَمُ مُوسَى فَحَجَّ آدَمُ مُوسَى",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] ia berkata; telah menceritakan kepada kami [Ibnu Wahb] ia berkata; telah mengabarkan kepadaku [Hisyam bin Sa'd] dari [Zaid bin Aslam] dari [Bapaknya] bahwa [Umar Ibnul Khaththab] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Musa berkata, \"Wahai Rabb, perlihatkanlah kepadaku Adam, orang yang telah mengeluarkan kami dan dirinya dari surga.\" Lalu Allah memperlihatkan Adam kepadanya, Musa pun berkata, \"Engkau Adam bapak kami!\" Adam menjawab, \"Benar.\" Musa berkata lagi, \"Engkaukah orang yang telah ditiupkan ruh oleh Allah, diberikan pengetahuan tentang nama-nama segala sesuatu, dan Allah memerintahkan para malaikat untuk sujud, lalu mereka sujud kepadamu?\" Adam menjawab, \"Benar.\" Musa bertanya, \"Lalu apa yang mendorongmu untuk mengeluarkan kami serta dirimu dari surga?\" Adam balik bertanya, \"Lalu kamu sendiri siapa?\" Musa menjawab, \"Aku adalah Musa.\" Adam bertanya, \"Kamukah Nabi dari kalangan bani Isra'il yang Allah telah mengajakmu berbicara dari balik tabir tanpa ada seorang perantara?\" Musa menjawab, \"Benar.\" Adam bertanya, \"Tidakkah engkau mengerti bahwa itu semua sudah ditentukan oleh Allah dalam kitab-Nya (Al Lauhul Mahfudh) sebelum aku diciptakan?\" Musa menjawab, \"Benar.\" Adam bertanya, \"Lalu kenapa engkau menyalahkanku atas sesuatu yang telah ditentukan Allah sebelum aku (diciptakan)?\" Ketika itu Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Adam mengalahkan Musa, Adam mengalahkan Musa.\""
            },
            {
                "number": 4081,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ زَيْدِ بْنِ أُنَيْسَةَ أَنَّ عَبْدَ الْحَمِيدِ بْنَ عَبْدِ الرَّحْمَنِ بْنِ زَيْدِ بْنِ الْخَطَّابِ أَخْبَرَهُ عَنْ مُسْلِمِ بْنِ يَسَارٍ الْجُهَنِيِّ أَنَّ عُمَرَ بْنَ الْخَطَّابِ سُئِلَ عَنْ هَذِهِ الْآيَةِ { وَإِذْ أَخَذَ رَبُّكَ مِنْ بَنِي آدَمَ مِنْ ظُهُورِهِمْ } قَالَ قَرَأَ الْقَعْنَبِيُّ الْآيَةَ فَقَالَ عُمَرُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنْهَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ عَزَّ وَجَلَّ خَلَقَ آدَمَ ثُمَّ مَسَحَ ظَهْرَهُ بِيَمِينِهِ فَاسْتَخْرَجَ مِنْهُ ذُرِّيَّةً فَقَالَ خَلَقْتُ هَؤُلَاءِ لِلْجَنَّةِ وَبِعَمَلِ أَهْلِ الْجَنَّةِ يَعْمَلُونَ ثُمَّ مَسَحَ ظَهْرَهُ فَاسْتَخْرَجَ مِنْهُ ذُرِّيَّةً فَقَالَ خَلَقْتُ هَؤُلَاءِ لِلنَّارِ وَبِعَمَلِ أَهْلِ النَّارِ يَعْمَلُونَ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ فَفِيمَ الْعَمَلُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ عَزَّ وَجَلَّ إِذَا خَلَقَ الْعَبْدَ لِلْجَنَّةِ اسْتَعْمَلَهُ بِعَمَلِ أَهْلِ الْجَنَّةِ حَتَّى يَمُوتَ عَلَى عَمَلٍ مِنْ أَعْمَالِ أَهْلِ الْجَنَّةِ فَيُدْخِلَهُ بِهِ الْجَنَّةَ وَإِذَا خَلَقَ الْعَبْدَ لِلنَّارِ اسْتَعْمَلَهُ بِعَمَلِ أَهْلِ النَّارِ حَتَّى يَمُوتَ عَلَى عَمَلٍ مِنْ أَعْمَالِ أَهْلِ النَّارِ فَيُدْخِلَهُ بِهِ النَّارَ حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى حَدَّثَنَا بَقِيَّةُ قَالَ حَدَّثَنِي عُمَرُ بْنُ جُعْثُمٍ الْقُرَشِيُّ قَالَ حَدَّثَنِي زَيْدُ بْنُ أَبِي أُنَيْسَةَ عَنْ عَبْدِ الْحَمِيدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ مُسْلِمِ بْنِ يَسَارٍ عَنْ نُعَيْمِ بْنِ رَبِيعَةَ قَالَ كُنْتُ عِنْدَ عُمَرَ بْنِ الْخَطَّابِ بِهَذَا الْحَدِيثِ وَحَدِيثُ مَالِكٍ أَتَمُّ",
                "id": "Telah menceritakan kepada kami Abdullah Al Qa'nabi dari Malik dari Zaid bin Unaisah bahwa Abdul Hamid bin 'Abdurrahman bin Zaid Ibnul Khaththab ia mengabarkan kepadanya dari Muslim bin Yasar Al Juhani bahwa Umar Ibnul Khaththab pernah ditanya tentang ayat ini: {Dan ingatlah ketika Tuhanmu mengeluarkan keturunan anak-anak Adam dari sulbi mereka} (Al A'raf: 172) Al Qa'nabi membaca ayat tersebut, lalu Umar berkata: \"Aku juga pernah mendengar Rasulullah shallallahu 'alaihi wa sallam ditanya tentang ayat itu, lalu beliau menjawab: \"Sesungguhnya Allah menciptakan Adam, lalu Allah mengusap punggungnya dengan tangan kanan-Nya hingga keluarlah keturunan Adam dari punggungnya. Kemudian Allah berfirman: \"Aku menciptakan mereka untuk masuk surga, dan mereka akan beramal dengan amalan-amalan penduduk Surga.\" kemudian Allah kembali mengusap punggung Adam hingga keluarlah keturunan Adam dari punggungnya. Setelah itu Allah berfirman: \"Aku menciptakan mereka untuk masuk neraka, dan mereka akan beramal dengan amalan-amalan penduduk Neraka.\" Seorang laki-laki bertanya: \"Wahai Rasulullah, lalu untuk apa gunanya beramal?\" Rasulullah shallallahu 'alaihi wa sallam bersabda: \"Sesungguhnya jika Allah menciptakan seorang hamba untuk masuk ke dalam Surga maka Ia akan menjadikannya beramal dengan amalan penduduk Surga, sehingga ia mati dengan amalan penduduk Surga lalu memasukkannya ke dalam surga. Dan jika Allah menciptakan seorang hamba untuk masuk ke dalam Neraka maka Ia akan menjadikannya beramal dengan amalan penduduk Neraka, sehingga ia mati dengan amalan penduduk Neraka lalu memasukkannya ke dalam Neraka.\" Telah menceritakan kepada kami Muhammad Ibnul Mushaffa berkata: telah menceritakan kepada kami Baqiyyah ia berkata: telah menceritakan kepadaku Umar bin Ju'tsum Al Qurasyi ia berkata: telah menceritakan kepadaku Zaid bin Abu Unaisah dari Abdul Hamid bin 'Abdurrahman dari Muslim bin Yasar dari Nu'iam bin Rabi'ah ia berkata: \"Aku sependapat dengan Umar Ibnul Khaththab dengan hadits ini, namun hadits Malik lebih lengkap.\""
            },
            {
                "number": 4082,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ حَدَّثَنَا الْمُعْتَمِرُ عَنْ أَبِيهِ عَنْ رَقَبَةَ بْنِ مَصْقَلَةَ عَنْ أَبِي إِسْحَقَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ عَنْ أُبَيِّ بْنِ كَعْبٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْغُلَامُ الَّذِي قَتَلَهُ الْخَضِرُ طُبِعَ كَافِرًا وَلَوْ عَاشَ لَأَرْهَقَ أَبَوَيْهِ طُغْيَانًا وَكُفْرًا",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] berkata, telah menceritakan kepada kami [Al Mu'tamir] dari [Bapaknya] dari [Raqabah bin Mashqalah] dari [Abu Ishaq] dari [Sa'id bin Jubair] dari [Ibnu Abbas] dari [Ubay bin Ka'b] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Anak kecil yang dibunuh oleh Khidhir ditakdirkan untuk menjadi kafir, jika ia tetap hidup maka ia akan berlaku zhalim kepada kedua orang tuanya dan berlaku kufur.\""
            },
            {
                "number": 4083,
                "arab": "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ حَدَّثَنَا الْفِرْيَابِيُّ عَنْ إِسْرَائِيلَ حَدَّثَنَا أَبُو إِسْحَقَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَ حَدَّثَنَا أُبَيُّ بْنُ كَعْبٍ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي قَوْلِهِ{ وَأَمَّا الْغُلَامُ فَكَانَ أَبَوَاهُ مُؤْمِنَيْنِ }وَكَانَ طُبِعَ يَوْمَ طُبِعَ كَافِرًا",
                "id": "Telah menceritakan kepada kami [Mahmud bin Khalid] berkata, telah menceritakan kepada kami [Al firyabi] dari [Isra'il] berkata, telah menceritakan kepada kami [Abu Ishaq] dari [Sa'id bin Jubair] dari [Ibnu Abbas] ia berkata; Telah menceritakan kepada kami [Ubay bin Ka'b] ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda tentang firman Allah: (dan adapun anak itu, maka kedua orangtuanya adalah orang-orang mukmin) -Qs. Al Kahfi: 80-. Beliau mengatakan: \"Anak itu telah ditakdirkan untuk menjadi kafir.\""
            },
            {
                "number": 4084,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مِهْرَانَ الرَّازِيُّ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرٍو عَنْ سَعِيدِ بْنِ جُبَيْرٍ قَالَ قَالَ ابْنُ عَبَّاسٍ حَدَّثَنِي أُبَيُّ بْنُ كَعْبٍعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَبْصَرَ الْخَضِرُ غُلَامًا يَلْعَبُ مَعَ الصِّبْيَانِ فَتَنَاوَلَ رَأْسَهُ فَقَلَعَهُ فَقَالَ مُوسَى{ أَقَتَلْتَ نَفْسًا زَكِيَّةً }الْآيَةَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Mihran Ar Razi] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Amru] dari [Sa'id bin Jubair] ia berkata; [Ibnu Abbas] berkata; telah menceritakan kepadaku [Ubay bin Ka'b] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Khidhir melihat seorang anak kecil yang sedang bermain dengan anak-anak yang lainnya, lalu ia memegang kepala anak tersebut dan membunuhnya. Musa bertanya, \"Mengapa kamu bunuh jiwa yang bersih?\" -Qs. Al Kahfi: 74-. "
            },
            {
                "number": 4085,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ النَّمَرِيُّ حَدَّثَنَا شُعْبَةُ ح و حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ الْمَعْنَى وَاحِدٌ وَالْإِخْبَارُ فِي حَدِيثِ سُفْيَانَ عَنْ الْأَعْمَشِ قَالَ حَدَّثَنَا زَيْدُ بْنُ وَهْبٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ الصَّادِقُ الْمَصْدُوقُ إِنَّ خَلْقَ أَحَدِكُمْ يُجْمَعُ فِي بَطْنِ أُمِّهِ أَرْبَعِينَ يَوْمًا ثُمَّ يَكُونُ عَلَقَةً مِثْلَ ذَلِكَ ثُمَّ يَكُونُ مُضْغَةً مِثْلَ ذَلِكَ ثُمَّ يُبْعَثُ إِلَيْهِ مَلَكٌ فَيُؤْمَرُ بِأَرْبَعِ كَلِمَاتٍ فَيُكْتَبُ رِزْقُهُ وَأَجَلُهُ وَعَمَلُهُ ثُمَّ يُكْتَبُ شَقِيٌّ أَوْ سَعِيدٌ ثُمَّ يُنْفَخُ فِيهِ الرُّوحُ فَإِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ حَتَّى مَا يَكُونُ بَيْنَهُ وَبَيْنَهَا إِلَّا ذِرَاعٌ أَوْ قِيدُ ذِرَاعٍ فَيَسْبِقُ عَلَيْهِ الْكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ فَيَدْخُلُهَا وَإِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ حَتَّى مَا يَكُونُ بَيْنَهُ وَبَيْنَهَا إِلَّا ذِرَاعٌ أَوْ قِيدُ ذِرَاعٍ فَيَسْبِقُ عَلَيْهِ الْكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ فَيَدْخُلُهَا",
                "id": "Telah menceritakan kepada kami Hafsh bin Umar An Namari telah menceritakan kepada kami Syu'bah. Dalam jalur lain: Muhammad bin Katsir telah mengabarkan kepada kami Sufyan —dengan makna yang sama— dari Al A‘masy, ia berkata: telah menceritakan kepada kami Zaid bin Wahb dari Abdullah bin Mas‘ud, ia berkata: Rasulullah shallallahu ‘alaihi wa sallam menceritakan kepada kami —dan beliau adalah orang yang benar lagi dipercaya— bahwa penciptaan salah seorang dari kalian dikumpulkan di perut ibunya selama empat puluh hari, kemudian menjadi segumpal darah selama itu, lalu menjadi segumpal daging selama itu, kemudian diutus seorang malaikat yang diperintahkan menulis empat perkara: rezekinya, ajalnya, amalnya, dan celaka atau bahagianya. Kemudian ditiupkan ruh ke dalamnya. Sungguh salah seorang dari kalian beramal dengan amalan ahli surga hingga jarak antara dirinya dan surga hanya sejengkal, namun ketetapan takdir mendahuluinya, lalu ia beramal dengan amalan ahli neraka dan memasukinya. Dan sungguh salah seorang dari kalian beramal dengan amalan ahli neraka hingga jarak antara dirinya dan neraka hanya sejengkal, namun ketetapan takdir mendahuluinya, lalu ia beramal dengan amalan ahli surga dan memasukinya."
            },
            {
                "number": 4086,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ يَزِيدَ الرِّشْكِ قَالَ حَدَّثَنَا مُطَرِّفٌ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَ قِيلَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا رَسُولَ اللَّهِ أَعُلِمَ أَهْلُ الْجَنَّةِ مِنْ أَهْلِ النَّارِ قَالَ نَعَمْ قَالَ فَفِيمَ يَعْمَلُ الْعَامِلُونَ قَالَ كُلٌّ مُيَسَّرٌ لِمَا خُلِقَ لَهُ",
                "id": "Telah menceritakan kepada kami Musaddad telah menceritakan kepada kami Hammad bin Zaid dari Yazid Ar Risyki, ia berkata: telah menceritakan kepada kami Mutharrif dari Imran bin Hushain, ia berkata: Rasulullah shallallahu ‘alaihi wa sallam ditanya: “Wahai Rasulullah, apakah penduduk surga dan penduduk neraka telah diketahui?” Beliau menjawab: “Ya.” Ditanyakan lagi: “Lalu untuk apa orang-orang beramal?” Beliau menjawab: “Setiap orang dimudahkan untuk apa yang telah diciptakan baginya.”"
            },
            {
                "number": 4087,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ الْمُقْرِيُّ أَبُو عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنِي سَعِيدُ بْنُ أَبِي أَيُّوبَ حَدَّثَنِي عَطَاءُ بْنُ دِينَارٍ عَنْ حَكِيمِ بْنِ شَرِيكٍ الْهُذَلِيِّ عَنْ يَحْيَى بْنِ مَيْمُونٍ الْحَضْرَمِيِّ عَنْ رَبِيعَةَ الْجُرَشِيِّ عَنْ أَبِي هُرَيْرَةَ عَنْ عُمَرَ بْنِ الْخَطَّابِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُجَالِسُوا أَهْلَ الْقَدَرِ وَلَا تُفَاتِحُوهُمْ",
                "id": "Telah menceritakan kepada kami Ahmad bin Hanbal telah menceritakan kepada kami Abdullah bin Yazid Al Muqri Abu ‘Abdurrahman, ia berkata: telah menceritakan kepadaku Sa‘id bin Abu Ayyub, ia berkata: telah menceritakan kepadaku ‘Atha bin Dinar dari Hakim bin Syarik Al Hudzali dari Yahya bin Maimun Al Hadhrami dari Rabi‘ah Al Jurasyi dari Abu Hurairah dari Umar bin Al Khaththab dari Nabi shallallahu ‘alaihi wa sallam, beliau bersabda: “Janganlah kalian duduk bersama orang-orang yang mengingkari takdir dan jangan pula membuka perdebatan dengan mereka.”"
            },
            {
                "number": 4088,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ أَبِي بِشْرٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنْ أَوْلَادِ الْمُشْرِكِينَ فَقَالَ اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Abu Awanah] dari [Abu Bisyr] dari [Sa'id bin Jubair] dari [ibnu Abbas] berkata, \"Nabi shallallahu 'alaihi wasallam pernah ditanya tentang anak-anak kaum musyrikin? Beliau lalu menjawab: \"Allah lebih tahu dengan yang mereka lakukan.\""
            },
            {
                "number": 4089,
                "arab": "حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ نَجْدَةَ حَدَّثَنَا بَقِيَّةُ ح و حَدَّثَنَا مُوسَى بْنُ مَرْوَانَ الرَّقِّيُّ وَكَثِيرُ بْنُ عُبَيْدٍ الْمَذْحِجِيُّ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ الْمَعْنَى عَنْ مُحَمَّدِ بْنِ زِيَادٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَيْسٍ عَنْ عَائِشَةَ قَالَتْقُلْتُ يَا رَسُولَ اللَّهِ ذَرَارِيُّ الْمُؤْمِنِينَ فَقَالَ هُمْ مِنْ آبَائِهِمْ فَقُلْتُ يَا رَسُولَ اللَّهِ بِلَا عَمَلٍ قَالَ اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ قُلْتُ يَا رَسُولَ اللَّهِ فَذَرَارِيُّ الْمُشْرِكِينَ قَالَ مِنْ آبَائِهِمْ قُلْتُ بِلَا عَمَلٍ قَالَ اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ",
                "id": "Telah menceritakan kepada kami [Abdul Wahhab bin Najdah] berkata, telah menceritakan kepada kami [Baqiyyah]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Musa bin Marwan Ar Raqqi] dan [Katsir bin Ubaid Al Madzhiji] keduanya berkata; telah menceritakan kepada kami [Muhammad bin Harb] secara makna, dari [Muhammad bin Ziyad] dari [Abdullah bin Abu Qais] dari ['Aisyah] ia berkata, \"Aku bertanya, \"Wahai Rasulullah, bagaimana nasib anak-anak kecil yang orang tua mereka mukmin?\" beliau menjawab: \"Mereka bagian dari bapak-bapak mereka.\" Aku bertanya lagi, \"Wahai Rasulullah, meskipun mereka tidak punya amal?\" beliau menjawab: \"Allah tahu dengan apa yang mereka lakukan.\" Aku bertanya lagi, \"Wahai Rasulullah, bagaimana dengan nasib anak-anak kaum musyrikin?\" beliau menjawab: \"Mereka bagian dari bapak-bapak mereka.\" Aku bertanya lagi, \"Wahai Rasulullah, meskipun mereka tidak punya amal?\" beliau menjawab: \"Allah tahu dengan apa yang mereka lakukan.\""
            },
            {
                "number": 4090,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ طَلْحَةَ بْنِ يَحْيَى عَنْ عَائِشَةَ بِنْتِ طَلْحَةَ عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ قَالَتْأُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِصَبِيٍّ مِنْ الْأَنْصَارِ يُصَلِّي عَلَيْهِ قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ طُوبَى لِهَذَا لَمْ يَعْمَلْ شَرًّا وَلَمْ يَدْرِ بِهِ فَقَالَ أَوْ غَيْرُ ذَلِكَ يَا عَائِشَةُ إِنَّ اللَّهَ خَلَقَ الْجَنَّةَ وَخَلَقَ لَهَا أَهْلًا وَخَلَقَهَا لَهُمْ وَهُمْ فِي أَصْلَابِ آبَائِهِمْ وَخَلَقَ النَّارَ وَخَلَقَ لَهَا أَهْلًا وَخَلَقَهَا لَهُمْ وَهُمْ فِي أَصْلَابِ آبَائِهِمْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] berkata, telah mengabarkan kepada kami [Sufyan] dari [Thalhah bin Yahya] dari ['Aisyah binti Thalhah] dari ['Aisyah] Ummul Mukminin, ia berkata, \"Anak anak kecil dari kaum Anshar (yang telah meninggal) dibawa ke hadapan Nabi shallallahu 'alaihi wasallam, lalu beliau menshalatinya. 'Aisyah berkata, \"Aku bertanya, \"Wahai Rasulullah, beruntung sekali anak kecil ini, ia belum pernah melakukan keburukan dan belum mengenalnya.\" Beliau balik berkata, \"Atau, bahkan tidak demikian wahai 'Aisyah. sesungguhnya Allah menciptakan surga dan menciptakan pula orang-orang yang bakal menghuninya. Allah menciptakan surga bagi mereka di saat mereka masih berada di dalam sulbi orang tua mereka. Allah menciptakan neraka dan menciptakan pula orang-orang yang bakal menghuninya. Allah menciptakan neraka bagi mereka di saat mereka masih berada di dalam sulbi orang tua mereka.\""
            },
            {
                "number": 4091,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُّ مَوْلُودٍ يُولَدُ عَلَى الْفِطْرَةِ فَأَبَوَاهُ يُهَوِّدَانِهِ وَيُنَصِّرَانِهِ كَمَا تَنَاتَجُ الْإِبِلُ مِنْ بَهِيمَةٍ جَمْعَاءَ هَلْ تُحِسُّ مِنْ جَدْعَاءَ قَالُوا يَا رَسُولَ اللَّهِ أَفَرَأَيْتَ مَنْ يَمُوتُ وَهُوَ صَغِيرٌ قَالَ اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Setiap bayi dilahirkan dalam keadaan fitrah, maka kedua orang tuannya-lah yang menjadikan ia yahudi atau nashrani. Sebagaimana unta melahirkan anaknya yang sehat, apakah kamu melihatnya memiliki aib?\" Para sahabat bertanya, \"Wahai Rasulullah, bagaimana dengan orang yang meninggal saat masih kecil?\" Beliau menjawab: \"Allah lebih tahu dengan yang mereka lakukan.\""
            },
            {
                "number": 4092,
                "arab": "قَالَ أَبُو دَاوُد قُرِئَ عَلَى الْحَارِثِ بْنِ مِسْكِينٍ وَأَنَا أَسْمَعُ أَخْبَرَكَ يُوسُفُ بْنُ عَمْرٍو أَخْبَرَنَا ابْنُ وَهْبٍ قَالَ سَمِعْتُ مَالِكًاقِيلَ لَهُ إِنَّ أَهْلَ الْأَهْوَاءِ يَحْتَجُّونَ عَلَيْنَا بِهَذَا الْحَدِيثِ قَالَ مَالِكٌ احْتَجَّ عَلَيْهِمْ بِآخِرِهِ قَالُوا أَرَأَيْتَ مَنْ يَمُوتُ وَهُوَ صَغِيرٌ قَالَ اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ",
                "id": "Abu Dawud berkata, \"Dibacakan dihadapan [Al Harits bin Miskin] -dan aku mendengar- berkata; [Yusuf bin Amru] mengabarkan kepadamu, ia berkata; telah mengabarkan kepada kami [Ibnu Wahb] ia berkata; Aku mendengar [Malik] ditanya, \"Sesungguhnya orang-orang yang mengikuti hawa nafsu menjadikan hadits ini sebagai hujah atas kami?\" Malik berkata, \"Bantahlah hujah mereka dengan kalimat terakhir dalam hadits tersebut.\" Mereka bertanya lagi, \"Apa pendapatmu dengan orang yang meninggal saat masih kecil?\" Malik menjawab, \"Allah lebih tahu dengan apa yang ia lakukan.\""
            },
            {
                "number": 4093,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا حَجَّاجُ بْنُ الْمِنْهَالِ قَالَ سَمِعْتُ حَمَّادَ بْنَ سَلَمَةَ يُفَسِّرُ حَدِيثَكُلُّ مَوْلُودٍ يُولَدُ عَلَى الْفِطْرَةِ قَالَ هَذَا عِنْدَنَا حَيْثُ أَخَذَ اللَّهُ عَلَيْهِمْ الْعَهْدَ فِي أَصْلَابِ آبَائِهِمْ حَيْثُ قَالَ{ أَلَسْتُ بِرَبِّكُمْ قَالُوا بَلَى }",
                "id": "Telah menceritakan kepada kami [Al hasan bin Ali] berkata, telah menceritakan kepada kami [Hajjaj Ibnul Minhal] ia berkata; Aku mendengar [Hammad bin Salamah] mentafsirkan hadits, 'Setiap bayi dilahirkan dalam keadaan fitrah', ia berkata, \"Menurut kami, ini adalah perjanjian yang Allah ambil saat mereka masih berada di tulang sulbi bapak-bapak mereka. Yaitu saat Allah berfirman: '(Bukankah Aku Tuhanmu, mereka menjawab, \"Betul, (Engkau Tuhan kami).\" -Qs. Al A'raf: 172-. "
            },
            {
                "number": 4094,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ قَالَ حَدَّثَنِي أَبِي عَنْ عَامِرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْوَائِدَةُ وَالْمَوْءُودَةُ فِي النَّارِقَالَ يَحْيَى بْنُ زَكَرِيَّا قَالَ أَبِي فَحَدَّثَنِي أَبُو إِسْحَقَ أَنَّ عَامِرًا حَدَّثَهُ بِذَلِكَ عَنْ عَلْقَمَةَ عَنْ ابْنِ مَسْعُودٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Musa Ar Razi] berkata, telah menceritakan kepada kami [Ibnu Abu Zaidah] ia berkata; telah menceritakan kepadaku [Bapakku] dari [Amir] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wanita yang mengubur anaknya hidup-hidup dan yang dikubur masuk ke dalam neraka.\" [Yahya bin Zakariya] berkata; [Bapakku] berkata; [Abu Ishaq] menceritakan kepadaku bahwa [Amir] menceritakan hal itu kepadanya, dari [Alqamah], dari [Ibnu Mas'ud], dari Nabi shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 4095,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ ثَابِتٍ عَنْ أَنَسٍأَنَّ رَجُلًا قَالَ يَا رَسُولَ اللَّهِ أَيْنَ أَبِي قَالَ أَبُوكَ فِي النَّارِ فَلَمَّا قَفَّى قَالَ إِنَّ أَبِي وَأَبَاكَ فِي النَّارِ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Hammad] dari [Tsabit] dari [Anas] berkata, \"Seorang laki-laki berkata, \"Wahai Rasulullah, dimanakah bapakku?\" beliau menjawab: \"Bapakmu ada di neraka.\" Ketika laki-laki itu berlalu pergi, beliau bersabda: \"Sesungguhnya bapakku dan bapakmu ada di dalam neraka.\""
            },
            {
                "number": 4096,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ ثَابِتٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَقَالَ رَسُولُ اللَّهِ إِنَّ الشَّيْطَانَ يَجْرِي مِنْ ابْنِ آدَمَ مَجْرَى الدَّمِ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Hammad] dari [Tsabit] dari [Anas bin Malik] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya setan mengalir dalam pembuluh anak Adam layaknya aliran darah.\""
            },
            {
                "number": 4097,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ الْهَمْدَانِيُّ أَخْبَرَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي ابْنُ لَهِيعَةَ وَعَمْرُو بْنُ الْحَارِثِ وَسَعِيدُ بْنُ أَبِي أَيُّوبَ عَنْ عَطَاءِ بْنِ دِينَارٍ عَنْ حَكِيمِ بْنِ شَرِيكٍ الْهُذَلِيِّ عَنْ يَحْيَى بْنِ مَيْمُونٍ عَنْ رَبِيعَةَ الْجُرَشِيِّ عَنْ أَبِي هُرَيْرَةَ عَنْ عُمَرَ بْنِ الْخَطَّابِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُجَالِسُوا أَهْلَ الْقَدَرِ وَلَا تُفَاتِحُوهُمْ الْحَدِيثَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Sa'id Al hamdani] berkata, telah mengabarkan kepada kami [Ibnu Wahb] ia berkata; telah mengabarkan kepadaku [Ibnu Lahi'ah] dan [Amru bin Al harits] dan [Sa'id bin Abu Ayyub] dari [Atha bin Dinar] dari [Hakim bin Syarik Al Hudzali] dari [Yahya bin Maimun] dari [Rabi'ah Al jurasyi] dari [Abu Hurairah] dari [Umar Ibnul Khaththab] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian duduk bersama orang-orang yang menolak takdir dan jangan kalian serahkan perkara itu kepada hakim mereka.\""
            },
            {
                "number": 4098,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ حَدَّثَنَا سُفْيَانُ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَزَالُ النَّاسُ يَتَسَاءَلُونَ حَتَّى يُقَالَ هَذَا خَلَقَ اللَّهُ الْخَلْقَ فَمَنْ خَلَقَ اللَّهَ فَمَنْ وَجَدَ مِنْ ذَلِكَ شَيْئًا فَلْيَقُلْ آمَنْتُ بِاللَّهِ",
                "id": "Telah menceritakan kepada kami [Harun bin Ma'ruf] berkata, telah menceritakan kepada kami [Sufyan] dari [Hisyam] dari [Bapaknya] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Manusia akan selalu bertanya-tanya hingga dikatakan, 'Ini makhluk yang Allah telah menciptakannya, lalu siapakan yang menciptakan Allah? ' Maka siapa saja yang mengalami hal semacam itu, hendaklah ia mengatakan 'aku beriman kepada Allah'.\""
            },
            {
                "number": 4099,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو حَدَّثَنَا سَلَمَةُ يَعْنِي ابْنَ الْفَضْلِ قَالَ حَدَّثَنِي مُحَمَّدٌ يَعْنِي ابْنَ إِسْحَقَ قَالَ حَدَّثَنِي عُتْبَةُ بْنُ مُسْلِمٍ مَوْلَى بَنِي تَيْمٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فَذَكَرَ نَحْوَهُ قَالَ فَإِذَا قَالُوا ذَلِكَ فَقُولُوا اللَّهُ أَحَدٌ اللَّهُ الصَّمَدُ لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ ثُمَّ لِيَتْفُلْ عَنْ يَسَارِهِ ثَلَاثًا وَلْيَسْتَعِذْ مِنْ الشَّيْطَانِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Amru] berkata, telah menceritakan kepada kami [Salamah] -maksudnya Salamah Fadhl- ia berkata; telah menceritakan kepadaku [Muhammad] -maksudnya Muahammad bin Ishaq- ia berkata; telah menceritakan kepadaku [Utbah bin Muslim] -mantan budak (yang telah dimerdekakan oleh) Bani Taim- dari [Abu Salamah bin 'Abdurrahman] dari [Abu Hurairah] ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda, lalu ia menyebutkan seperti hadits tersebut. Beliau bersabda: \"Jika mereka mengucapkan demikian, maka ucapkanlah, \"(Dia-lah Allah, Yang Maha Esa, Allah adalah Tuhan yang bergantung kepada-Nya segala sesuatu. Dia tidak beranak dan tidak pula diperanakkan, dan tidak ada seorang pun yang setara dengan Dia.) ' Setelah itu hendaklah ia meludah ke arah kiri sebanyak tiga kali, dan memohon perlindungan kepada Allah dari setan.\""
            },
            {
                "number": 4100,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ الْبَزَّازُ حَدَّثَنَا الْوَلِيدُ بْنُ أَبِي ثَوْرٍ عَنْ سِمَاكٍ عَنْ عَبْدِ اللَّهِ بْنِ عَمِيرَةَ عَنْ الْأَحْنَفِ بْنِ قَيْسٍ عَنْ الْعَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ قَالَكُنْتُ فِي الْبَطْحَاءِ فِي عِصَابَةٍ فِيهِمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَرَّتْ بِهِمْ سَحَابَةٌ فَنَظَرَ إِلَيْهَا فَقَالَ مَا تُسَمُّونَ هَذِهِ قَالُوا السَّحَابَ قَالَ وَالْمُزْنَ قَالُوا وَالْمُزْنَ قَالَ وَالْعَنَانَ قَالُوا وَالْعَنَانَ قَالَ أَبُو دَاوُد لَمْ أُتْقِنْ الْعَنَانَ جَيِّدًا قَالَ هَلْ تَدْرُونَ مَا بُعْدُ مَا بَيْنَ السَّمَاءِ وَالْأَرْضِ قَالُوا لَا نَدْرِي قَالَ إِنَّ بُعْدَ مَا بَيْنَهُمَا إِمَّا وَاحِدَةٌ أَوْ اثْنَتَانِ أَوْ ثَلَاثٌ وَسَبْعُونَ سَنَةً ثُمَّ السَّمَاءُ فَوْقَهَا كَذَلِكَ حَتَّى عَدَّ سَبْعَ سَمَاوَاتٍ ثُمَّ فَوْقَ السَّابِعَةِ بَحْرٌ بَيْنَ أَسْفَلِهِ وَأَعْلَاهُ مِثْلُ مَا بَيْنَ سَمَاءٍ إِلَى سَمَاءٍ ثُمَّ فَوْقَ ذَلِكَ ثَمَانِيَةُ أَوْعَالٍ بَيْنَ أَظْلَافِهِمْ وَرُكَبِهِمْ مِثْلُ مَا بَيْنَ سَمَاءٍ إِلَى سَمَاءٍ ثُمَّ عَلَى ظُهُورِهِمْ الْعَرْشُ مَا بَيْنَ أَسْفَلِهِ وَأَعْلَاهُ مِثْلُ مَا بَيْنَ سَمَاءٍ إِلَى سَمَاءٍ ثُمَّ اللَّهُ تَبَارَكَ وَتَعَالَى فَوْقَ ذَلِكَحَدَّثَنَا أَحْمَدُ بْنُ أَبِي سُرَيْجٍ أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ سَعْدٍ وَمُحَمَّدُ بْنُ سَعِيدٍ قَالَا أَخْبَرَنَا عَمْرُو بْنُ أَبِي قَيْسٍ عَنْ سِمَاكٍ بِإِسْنَادِهِ وَمَعْنَاهُ حَدَّثَنَا أَحْمَدُ بْنُ حَفْصٍ قَالَ حَدَّثَنِي أَبِي حَدَّثَنَا إِبْرَاهِيمُ بْنُ طَهْمَانَ عَنْ سِمَاكٍ بِإِسْنَادِهِ وَمَعْنَى هَذَا الْحَدِيثِ الطَّوِيلِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah Al Bazzar] berkata, telah menceritakan kepada kami [Al Walid bin Abu Tsaur] dari [Simak] dari [Abdullah bin Amirah] dari [Al Ahnaf bin Qais] dari [Al Abbas bin Abdul Muthallib] ia berkata, \"Aku pernah berada di wilayah Bathha bersama rombongan yang di dalamnya terdapat Rasulullah shallallahu 'alaihi wasallam. Lalu ada awan yang melintasi mereka, beliau melihat awan itu lalu bersabda: \"Kalian menyebut apa ini?\" para sahabat menjawab, \"Awan.\" Beliau bersabda: \"Dan Al Muzn?\" mereka menjawab, \"Ya, (kami juga menyebutnya) Al Muzn.\" Beliau bersabda: \"Dan Al 'Anan?\" mereka menjawab, \"Ya, dan Al 'Anan.\" -Abu Dawud berkata, \"Aku tidak menghafal lafadz Al 'Anan dengan baik- Beliau lalu bertanya: \"Apakah kalian tahu berapa jarak antara langit dan bumi?\" mereka menjawab, \"Kami tidak tahu.\" Beliau bersabda: \"Sesungguhnya jarak antara keduanya adalah bisa tujuh puluh satu, atau tujuh puluh dua, atau tujuh puluh tiga tahun perjalanan -perawi masih ragu-. kemudian langit yang di atasnya juga seperti itu.\" Hingga beliau menyebutkan tujuh langit. Kemudian setelah langit ketujuh terdapat lautan, jarak antara bawah dan atasnya seperti jarak antara langit dengan langit (yang lain). Kemudian di atasnya terdapat delapan malaikat yang jarak antara telapak kaki dengan lututnya sejauh langit dengan langit yang lainnya. Dan di atas mereka terdapat Arsy, yang antara bagian bawah dengan atasnya sejauh antara langit satu dengan langit yang lainnya. Dan Allah Tabaraka Wa Ta'ala ada di atasnya.\" Telah menceritakan kepada kami [Ahmad bin Abu Suraij] berkata, telah mengabarkan kepada kami ['Abdurrahman bin Abdullah bin Sa'd] dan [Muhammad bin Sa'id] keduanya berkata; telah mengabarkan kepada kami [Amru bin Abu Qais] dari [Simak] dengan sanad dan makna yang sama. Telah menceritakan kepada kami [Ahmad bin Hafsh] ia berkata; telah menceritakan kepadaku [Bapakku] berkata, telah menceritakan kepada kami [Ibrahim bin Thahman] dari [Simak] dengan sanad yang sama dan makna hadits ini yang panjang. "
            },
            {
                "number": 4101,
                "arab": "حَدَّثَنَا عَبْدُ الْأَعْلَى بْنُ حَمَّادٍ وَمُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ وَأَحْمَدُ بْنُ سَعِيدٍ الرِّبَاطِيُّ قَالُوا حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ قَالَ أَحْمَدُ كَتَبْنَاهُ مِنْ نُسْخَتِهِ وَهَذَا لَفْظُهُ قَالَ حَدَّثَنَا أَبِي قَالَ سَمِعْتُ مُحَمَّدَ بْنَ إِسْحَقَ يُحَدِّثُ عَنْ يَعْقُوبَ بْنِ عُتْبَةَ عَنْ جُبَيْرِ بْنِ مُحَمَّدِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَأَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْرَابِيٌّ فَقَالَ يَا رَسُولَ اللَّهِ جُهِدَتْ الْأَنْفُسُ وَضَاعَتْ الْعِيَالُ وَنُهِكَتْ الْأَمْوَالُ وَهَلَكَتْ الْأَنْعَامُ فَاسْتَسْقِ اللَّهَ لَنَا فَإِنَّا نَسْتَشْفِعُ بِكَ عَلَى اللَّهِ وَنَسْتَشْفِعُ بِاللَّهِ عَلَيْكَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَيْحَكَ أَتَدْرِي مَا تَقُولُ وَسَبَّحَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَا زَالَ يُسَبِّحُ حَتَّى عُرِفَ ذَلِكَ فِي وُجُوهِ أَصْحَابِهِ ثُمَّ قَالَ وَيْحَكَ إِنَّهُ لَا يُسْتَشْفَعُ بِاللَّهِ عَلَى أَحَدٍ مِنْ خَلْقِهِ شَأْنُ اللَّهِ أَعْظَمُ مِنْ ذَلِكَ وَيْحَكَ أَتَدْرِي مَا اللَّهُ إِنَّ عَرْشَهُ عَلَى سَمَاوَاتِهِ لَهَكَذَا وَقَالَ بِأَصَابِعِهِ مِثْلَ الْقُبَّةِ عَلَيْهِ وَإِنَّهُ لَيَئِطُّ بِهِ أَطِيطَ الرَّحْلِ بِالرَّاكِبِ قَالَ ابْنُ بَشَّارٍ فِي حَدِيثِهِ إِنَّ اللَّهَ فَوْقَ عَرْشِهِ وَعَرْشُهُ فَوْقَ سَمَاوَاتِهِ وَسَاقَ الْحَدِيثَو قَالَ عَبْدُ الْأَعْلَى وَابْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ عَنْ يَعْقُوبَ بْنِ عُتْبَةَ وَجُبَيْرِ بْنِ مُحَمَّدِ بْنِ جُبَيْرٍ عَنْ أَبِيهِ عَنْ جَدِّهِ وَالْحَدِيثُ بِإِسْنَادِ أَحْمَدَ بْنِ سَعِيدٍ هُوَ الصَّحِيحُ وَافَقَهُ عَلَيْهِ جَمَاعَةٌ مِنْهُمْ يَحْيَى بْنُ مَعِينٍ وَعَلِيُّ بْنُ الْمَدِينِيِّ وَرَوَاهُ جَمَاعَةٌ عَنْ ابْنِ إِسْحَقَ كَمَا قَالَ أَحْمَدُ أَيْضًا وَكَانَ سَمَاعُ عَبْدِ الْأَعْلَى وَابْنِ الْمُثَنَّى وَابْنِ بَشَّارٍ مِنْ نُسْخَةٍ وَاحِدَةٍ فِيمَا بَلَغَنِي",
                "id": "Telah menceritakan kepada kami [Abdul A'la bin Hammad] dan [Muhammad Ibnul Mutsanna] dan [Muhammad bin Basysyar] dan [Ahmad bin Sa'id Ar Ribathi] mereka berkata; telah menceritakan kepada kami [Wahb bin Jarir] -Ahmad berkata, \"Kami menulisnya dari buku catatannya, dan ini adalah lafadznya.\"- ia berkata; telah menceritakan kepada kami [Bapakku] ia berkata; Aku mendengar [Muhammad bin Ishaq] ia menceritakan dari [Ya'qub bin Utbah] dari [Jubair bin Muhammad bin Jubair bin Muth'im] dari [Bapaknya] dari [Kakeknya] ia berkata, \"Seorang Arab badui mendatangi Rasulullah shallallahu 'alaihi wasallam dan bertanya, \"Wahai Rasulullah, jiwa-jiwa telah berat, keluarga telah lemah, harta berkurang, dan binatang ternak telah binasa. Maka mintalah hujan kepada Allah untuk kami, sesungguhnya kami meminta syafaat dengan perantaramu kepada Allah dan dengan perantara Allah kepadamu.\" Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Celaka kamu! Tidakkah kamu tahu apa yang telah kamu ucapkan?\" Rasulullah shallallahu 'alaihi wasallam kemudian bertasbih kepada Allah, dan beliau masih saja bertasbih hingga (kebencian beliau) bisa diketahui dari wajah para sahabatnya. Kemudian beliau bersabda lagi: \"Celaka kamu! Sesungguhnya Allah tidak boleh dijadikan sebagai perantara atas seorang pun dari hamba-Nya, Allah lebih agung dari untuk sekedar dijadikan sebagai wasilah tersebut. Celaka kamu! Tidak tahukah kamu bagaimana Allah itu? Sungguh, Arsy-Nya ada di atas semua langit-Nya seperti ini -lalu isyarat tangannya beliau mengatakan, 'Seperti Kubah, dan Arsy itu berteriak dan menyeru kepada Allah seperti tunggangan berteriak kepada pengendara karena berat-.\" Ibnu Basysyar menyebutkan dalam haditsnya, \"Sesungguhnya Allah berada di atas Arsy, dan Arsy-Nya ada di atas semua langit-Nya…lalu hadits tersebut disebutkan seluruhnya.\" [Abdul A'la], [Ibnul Mutsanna] dan [Ibnu Basysyar] menyebutkan dari [Ya'qub bin Utbah]. Dan [Jubair bin Muhammad bin Jubair] dari [bapaknya], dari [kakeknya]. Dan hadits ini diriwayatkan dengan sanad Ahmad bin Sa'id, dan inilah yang lebih shahih. hal ini telah disepakati oleh sekelompok ulama, seperti [Yahya bin Ma'in] dan [Ali Ibnul Madini]. Sekelompok ulama juga meriwayatkannya dari Ibnu Ishaq, ini menurut keterangan Ahmad. Dan menurut kabar yang sampai kepadaku bahwa riwayat Abdul A'la, Ibnul Mutsanna dan Ibnu Basysyar dari buku yang sama.\""
            },
            {
                "number": 4102,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَفْصِ بْنِ عَبْدِ اللَّهِ قَالَ حَدَّثَنِي أَبِي قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ طَهْمَانَ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أُذِنَ لِي أَنْ أُحَدِّثَ عَنْ مَلَكٍ مِنْ مَلَائِكَةِ اللَّهِ مِنْ حَمَلَةِ الْعَرْشِ إِنَّ مَا بَيْنَ شَحْمَةِ أُذُنِهِ إِلَى عَاتِقِهِ مَسِيرَةُ سَبْعِ مِائَةِ عَامٍ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hafsh bin Abdullah] ia berkata; telah menceritakan kepadaku [Bapakku] ia berkata; telah menceritakan kepadaku [Ibrahim bin Thahman] dari [Musa bin Uqbah] dari [Muhammad Ibnul Munkadir] dari [Jabir bin Abdullah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Aku telah diberi izin untuk menceritakan tentang sesosok malaikat dari malaikat Allah yang bertugas membawa Arsy. Sesungguhnya, jarak antara ujung telinga dengan bahunya adalah perjalanan tujuh ratus tahun.\""
            },
            {
                "number": 4103,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ نَصْرٍ وَمُحَمَّدُ بْنُ يُونُسَ النَّسَائِيُّ الْمَعْنَى قَالَا حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ الْمُقْرِئُ حَدَّثَنَا حَرْمَلَةُ يَعْنِي ابْنَ عِمْرَانَ حَدَّثَنِي أَبُو يُونُسَ سُلَيْمُ بْنُ جُبَيْرٍ مَوْلَى أَبِي هُرَيْرَةَ قَالَسَمِعْتُ أَبَا هُرَيْرَةَ يَقْرَأُ هَذِهِ الْآيَةَ{ إِنَّ اللَّهَ يَأْمُرُكُمْ أَنْ تُؤَدُّوا الْأَمَانَاتِ إِلَى أَهْلِهَا إِلَى قَوْلِهِ تَعَالَى سَمِيعًا بَصِيرًا }قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَضَعُ إِبْهَامَهُ عَلَى أُذُنِهِ وَالَّتِي تَلِيهَا عَلَى عَيْنِهِ قَالَ أَبُو هُرَيْرَةَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَؤُهَا وَيَضَعُ إِصْبَعَيْهِ قَالَ ابْنُ يُونُسَ قَالَ الْمُقْرِئُ يَعْنِي إِنَّ اللَّهَ سَمِيعٌ بَصِيرٌ يَعْنِي أَنَّ لِلَّهِ سَمْعًا وَبَصَرًاقَالَ أَبُو دَاوُد وَهَذَا رَدٌّ عَلَى الْجَهْمِيَّةِ",
                "id": "Telah menceritakan kepada kami [Ali bin Nashr] dan [Muhammad bin Yunus An Nasai] secara makna, keduanya berkata; telah menceritakan kepada kami [Abdullah bin Yazid Al Muqri] berkata, telah menceritakan kepada kami [Harmalah] -maksudnya Harmalah bin Imran- berkata, telah menceritakan kepadaku [Abu Yunus Sulaim bin Jubair] -mantan budak (yang telah dimerdekakan oleh) Abu Hurairah- ia berkata; Aku mendengar [Abu Hurairah] membaca ayat ini: (Sesungguhnya Allah menyuruh kamu menyampaikan amanat kepada yang berhak menerimanya) -Qs. An Nisa: 48- sampai pada firman-Nya (Sesungguhnya Allah adalah Maha Mendengar lagi Maha Melihat). Abu Hurairah berkata, \"Aku melihat Rasulullah shallallahu 'alaihi wasallam meletakkan ibu jarinya ke telinga, sementara jari setelahnya pada mata.\" Abu Hurairah melanjutkan, \"Aku melihat Rasulullah shallallahu 'alaihi wasallam membaca ayat tersebut seraya meletakkan kedua jarinya tersebut.\" Ibnu Yunus berkata, \"Al Muqri menyebutkan bahwa makna ayat: (Sesungguhnya Allah Maha Mendengar dan Maha Melihat) adalah, bahwa Allah memiliki penglihatan dan pendengaran.\" Abu Dawud berkata, \"Ini adalah bantahan untuk orang-orang Jahmiyah.\""
            },
            {
                "number": 4104,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ وَوَكِيعٌ وَأَبُو أُسَامَةَ عَنْ إِسْمَعِيلَ بْنِ أَبِي خَالِدٍ عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ قَالَكُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جُلُوسًا فَنَظَرَ إِلَى الْقَمَرِ لَيْلَةَ الْبَدْرِ لَيْلَةَ أَرْبَعَ عَشْرَةَ فَقَالَ إِنَّكُمْ سَتَرَوْنَ رَبَّكُمْ كَمَا تَرَوْنَ هَذَا لَا تُضَامُّونَ فِي رُؤْيَتِهِ فَإِنْ اسْتَطَعْتُمْ أَنْ لَا تُغْلَبُوا عَلَى صَلَاةٍ قَبْلَ طُلُوعِ الشَّمْسِ وَقَبْلَ غُرُوبِهَا فَافْعَلُوا ثُمَّ قَرَأَ هَذِهِ الْآيَةَ فَ{ سَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوعِ الشَّمْسِ وَقَبْلَ غُرُوبِهَا }",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Jarir] dan [Waki'] dan [Abu Usamah] dari [Isma'il bin Abu Khalid] dari [Qais bin Abu Hazim] dari [Jarir bin Abdullah] ia berkata, \"Kami duduk bersama Rasulullah shallallahu 'alaihi wasallam, kemudian beliau melihat bulan purnama, tepatnya malam tanggal empat belas. Beliau bersabda: \"Kalian akan melihat Tuhan kalian seperti kalian melihat rembulan ini, tidak ada yang menghalangi pandangan kalian. Jika kalian mampu untuk melaksanakan shalat sebelum terbit dan tenggelamnya matahari, maka lakukanlah.\" Kemudian beliau membaca ayat dan bertasbihlah dengan memuji Tuhanmu, sebelum terbit matahari dan sebelum terbenamnya-thaahaa; 130-"
            },
            {
                "number": 4105,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ إِسْمَعِيلَ حَدَّثَنَا سُفْيَانُ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ أَنَّهُ سَمِعَهُ يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ نَاسٌ يَا رَسُولَ اللَّهِ أَنَرَى رَبَّنَا يَوْمَ الْقِيَامَةِ قَالَ هَلْ تُضَارُّونَ فِي رُؤْيَةِ الشَّمْسِ فِي الظَّهِيرَةِ لَيْسَتْ فِي سَحَابَةٍ قَالُوا لَا قَالَ هَلْ تُضَارُّونَ فِي رُؤْيَةِ الْقَمَرِ لَيْلَةَ الْبَدْرِ لَيْسَ فِي سَحَابَةٍ قَالُوا لَا قَالَ وَالَّذِي نَفْسِي بِيَدِهِ لَا تُضَارُّونَ فِي رُؤْيَتِهِ إِلَّا كَمَا تُضَارُّونَ فِي رُؤْيَةِ أَحَدِهِمَا",
                "id": "Telah menceritakan kepada kami [Ishaq bin Isma'il] berkata, telah menceritakan kepada kami [Sufyan] dari [Suhail bin Abu Shalih] dari [Bapaknya] Bahwasanya ia mendengarnya menceritakan dari [Abu Hurairah] ia berkata, \"Seseorang bertanya kepada Rasulullah, \"Wahai Rasulullah, apakah kita bisa melihat Tuhan kita pada hari kiamat?\" beliau bersabda: \"Apakah kalian merasa kesulitan ketika melihat matahari saat waktu zhuhur yang tidak ada awannya?\" mereka menjawab, \"Tidak.\" Beliau bertanya lagi: \"Apakah kalian merasa kesulitan saat melihat rembulan di malam purnama yang tidak ada awannya?\" mereka menjawab, \"Tidak.\" Beliau bersabda: \"Demi Dzat yang jiwaku ada dalam genggaman-Nya, kalian tidak akan kesulitan untuk melihat-Nya kecuali sebagaimana kalian melihat salah satu dari keduanya (matahari atau rembulan).\""
            },
            {
                "number": 4106,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ ح و حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ الْمَعْنَى عَنْ يَعْلَى بْنِ عَطَاءٍ عَنْ وَكِيعٍ قَالَ مُوسَى ابْنِ عُدُسٍ عَنْ أَبِي رَزِينٍ قَالَ مُوسَى الْعُقَيْلِيِّ قَالَ قُلْتُيَا رَسُولَ اللَّهِ أَكُلُّنَا يَرَى رَبَّهُ قَالَ ابْنُ مُعَاذٍ مُخْلِيًا بِهِ يَوْمَ الْقِيَامَةِ وَمَا آيَةُ ذَلِكَ فِي خَلْقِهِ قَالَ يَا أَبَا رَزِينٍ أَلَيْسَ كُلُّكُمْ يَرَى الْقَمَرَ قَالَ ابْنُ مُعَاذٍ لَيْلَةَ الْبَدْرِ مُخْلِيًا بِهِ ثُمَّ اتَّفَقَا قُلْتُ بَلَى قَالَ فَاللَّهُ أَعْظَمُ قَالَ ابْنُ مُعَاذٍ قَالَ فَإِنَّمَا هُوَ خَلْقٌ مِنْ خَلْقِ اللَّهِ فَاللَّهُ أَجَلُّ وَأَعْظَمُ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Hammad]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ubaidullah bin Mu'adz] berkata, telah menceritakan kepada kami [Bapakku] berkata, telah menceritakan kepada kami [Syu'bah] secara makna, dari [Ya'la bin Atha] dari [Waki']. [Musa] ibnu 'Udus menyebutkan dari [Abu Razin]. Musa Al Uqaili berkata, \"Aku bertanya, \"Wahai Rasulullah, apakah setiap kami nanti dapat melihat Rabbnya?\" -Ibnu Mu'adz menyebutkan (dalam riwayatnya) - \"tanpa adanya penghalang pada hari kiamat? Lalu apa tanda-tandanya yang ada pada ciptaan-Nya?\" beliau menjawab: \"Wahai Abu Razin, bukankah setiap kalian bisa melihat rembulan?\" -Ibnu Mu'adz menyebutkan (dalam riwayatnya) -, \"pada malam purnama tanpa adanya penghalang?\" -kemudian keduanya sepakat pada lafadz- Aku menjawab, \"Tentu.\" Beliau bersabda: \"Maka Allah lebih agung (dari itu).\" -Ibnu Mu'adz menyebutkan (dalam riwayatnya), \"Beliau bersabda: \"(Rembulan) itu hanyalah makhluk dari sekian makhluk-Nya, dan Allah lebih agung dari itu.\""
            },
            {
                "number": 4107,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ الْعَلَاءِ أَنَّ أَبَا أُسَامَةَ أَخْبَرَهُمْ عَنْ عُمَرَ بْنِ حَمْزَةَ قَالَ قَالَ سَالِمٌ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَطْوِي اللَّهُ السَّمَاوَاتِ يَوْمَ الْقِيَامَةِ ثُمَّ يَأْخُذُهُنَّ بِيَدِهِ الْيُمْنَى ثُمَّ يَقُولُ أَنَا الْمَلِكُ أَيْنَ الْجَبَّارُونَ أَيْنَ الْمُتَكَبِّرُونَ ثُمَّ يَطْوِي الْأَرَضِينَ ثُمَّ يَأْخُذُهُنَّ قَالَ ابْنُ الْعَلَاءِ بِيَدِهِ الْأُخْرَى ثُمَّ يَقُولُ أَنَا الْمَلِكُ أَيْنَ الْجَبَّارُونَ أَيْنَ الْمُتَكَبِّرُونَ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] dan [Muhammad Ibnul 'Ala] bahwa [Abu Usamah] mengabarkan kepada mereka dari [Umar bin Hamzah] ia berkata; [Salim] berkata; telah mengabarkan kepadaku [Abdullah bin Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pada hari kiamat Allah akan menggulung semua langit kemudian mengenggamnya dengan tangan kanan, setelah itu Allah berfirman: \"Aku adalah raja! Sekarang dimanakah orang-orang yang berlaku sewenang-wenang, di mana orang-orang yang berlaku sombong!\" Kemudian Allah juga menggulung semua bumi dan menggenggamnya. Ibnul 'Ala menyebutkan, \"Dengan tangan-Nya yang lain. Setelah itu berfirman: \"Aku adalah raja! Sekarang dimanakah orang-orang yang berlaku sewenang-wenang, di mana orang-orang yang berlaku sombong!\""
            },
            {
                "number": 4108,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ وَعَنْ أَبِي عَبْدِ اللَّهِ الْأَغَرِّ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَنْزِلُ رَبُّنَا كُلَّ لَيْلَةٍ إِلَى سَمَاءِ الدُّنْيَا حَتَّى يَبْقَى ثُلُثُ اللَّيْلِ الْآخِرُ فَيَقُولُ مَنْ يَدْعُونِي فَأَسْتَجِيبَ لَهُ مَنْ يَسْأَلُنِي فَأُعْطِيَهُ مَنْ يَسْتَغْفِرُنِي فَأَغْفِرَ لَهُ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Ibnu Syihab] dari [Abu Salamah bin 'Abdurrahman] dari [Abu Abdullah Al Aghar] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Setiap malam Rabb kita turun ke langit dunia di sepertiga malam yang akhir. Lalu Dia berfirman: \"Siapa yang berdoa kepada-Ku maka akan Aku kabulkan, siapa yang meminta kepada-Ku maka akan Aku beri dan siapa yang meminta ampun kepada-Ku maka akan Aku ampuni.\""
            },
            {
                "number": 4109,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا إِسْرَائِيلُ حَدَّثَنَا عُثْمَانُ بْنُ الْمُغِيرَةِ عَنْ سَالِمٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْرِضُ نَفْسَهُ عَلَى النَّاسِ فِي الْمَوْقِفِ فَقَالَ أَلَا رَجُلٌ يَحْمِلُنِي إِلَى قَوْمِهِ فَإِنَّ قُرَيْشًا قَدْ مَنَعُونِي أَنْ أُبَلِّغَ كَلَامَ رَبِّي",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] berkata, telah mengabarkan kepada kami [Isra'il] berkata, telah menceritakan kepada kami [Utsman Ibnul Mughirah] dari [Salim] dari [Jabir bin Abdullah] ia berkata, \"Pada suatu saat Rasulullah shallallahu 'alaihi wasallam pernah menawarkan dirinya kepada manusia di tempat pemberhentian, beliau bersabda: \"Adakah seorang laki-laki yang mau membawaku kepada kaumnya, sesungguhnya orang-orang Quraisy telah melarang aku menyampaikan pesan Tuhanku.\""
            },
            {
                "number": 4110,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ بْنُ يَزِيدَ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ وَسَعِيدُ بْنُ الْمُسَيَّبِ وَعَلْقَمَةُ بْنُ وَقَّاصٍ وَعُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ عَنْ حَدِيثِ عَائِشَةَ وَكُلٌّ حَدَّثَنِي طَائِفَةً مِنْ الْحَدِيثِ قَالَتْوَلَشَأْنِي فِي نَفْسِي كَانَ أَحْقَرَ مِنْ أَنْ يَتَكَلَّمَ اللَّهُ فِيَّ بِأَمْرٍ يُتْلَى",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Dawud Al Mahri] berkata, telah mengabarkan kepada kami [Abdullah bin Wahb] ia berkata; telah mengabarkan kepadaku [Yunus bin Yazid] dari [Ibnu Syihab] ia berkata; telah mengabarkan kepadaku [Urwah Ibnu Az Zubair] dan [Sa'id Ibnul Musayyab] dan [Alqamah bin Waqqash] dan [Ubaidullah bin Abdullah] tentang peristiwa (fitnah) yang menimpa ['Aisyah], setiap dari mereka menceritakan kepadaku sebagian tentang peristiwa 'Aisyah. 'Aisyah berkata, \"Menurutku, perkara yang menimpaku itu lebih hina (tidak pantas) untuk Allah sebutkan pada sesuatu yang dibaca (Al-Qur'an).\""
            },
            {
                "number": 4111,
                "arab": "حَدَّثَنَا إِسْمَعِيلُ بْنُ عُمَرَ أَخْبَرَنَا إِبْرَاهِيمُ بْنُ مُوسَى أَخْبَرَنَا ابْنُ أَبِي زَائِدَةَ عَنْ مُجَالِدٍ عَنْ عَامِرٍ يَعْنِي الشَّعْبِيَّ عَنْ عَامِرِ بْنِ شَهْرٍ قَالَكُنْتُ عِنْدَ النَّجَاشِيِّ فَقَرَأَ ابْنٌ لَهُ آيَةً مِنْ الْإِنْجِيلِ فَضَحِكْتُ فَقَالَ أَتَضْحَكُ مِنْ كَلَامِ اللَّهِ",
                "id": "Telah menceritakan kepada kami [Isma'il bin Umar] berkata, telah mengabarkan kepada kami [Ibrahim bin Musa] berkata, telah mengabarkan kepada kami [Ibnu Abu Zaidah] dari [Mujalid] dari [Amir] -maksudnya Amir Asy Sya'bi- dari [Amir bin Syahr] ia berkata, \"Saat aku sedang bersama Najasyi, salah seorang anaknya membaca ayat dalam kitab Injil hingga aku pun tertawa. Namun Najasyi berkata, \"Akankah kamu mentertawakan kalamullah?\""
            },
            {
                "number": 4112,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ الْمِنْهَالِ بْنِ عَمْرٍو عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعَوِّذُ الْحَسَنَ وَالْحُسَيْنَ أُعِيذُكُمَا بِكَلِمَاتِ اللَّهِ التَّامَّةِ مِنْ كُلِّ شَيْطَانٍ وَهَامَّةٍ وَمِنْ كُلِّ عَيْنٍ لَامَّةٍ ثُمَّ يَقُولُ كَانَ أَبُوكُمْ يُعَوِّذُ بِهِمَا إِسْمَاعِيلَ وَإِسْحَقَقَالَ أَبُو دَاوُد هَذَا دَلِيلٌ عَلَى أَنَّ الْقُرْآنَ لَيْسَ بِمَخْلُوقٍ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Al Minhal bin Amru] dari [Sa'id bin Jubair] dari [Ibnu Abbas] ia berkata, \"Nabi shallallahu 'alaihi wasallam berdoa minta perlindungan untuk Hasan dan Husain, beliau membaca: \"U'IIDZUKUMAA BIKALIMAATILLAAHIT TAAMMAH MIN KULLI SYAITHAANIN WA HAAMMATIN WA MIN KULLI 'AININ LAAMATIN (Aku memohon perlindungan kepada Allah untuk kalian berdua dengan kalimat-kalimat Allah yang sempurna, dari setiap kejahatan setan dan binatang bisa yang mematikan, dan dari setiap mata yang hasud). Kemudian beliau bersabda: \"Dahulu bapak kalian (Ibrahim) juga pernah minta perlindungan dengan keduanya untuk anaknya; Isma'il dan Ishaq.\" Abu Dawud berkata, \"Ini adalah dalil bahwa Al-Qur'an bukanlah makhluk.\""
            },
            {
                "number": 4113,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي سُرَيْجٍ الرَّازِيُّ وَعَلِيُّ بْنُ الْحُسَيْنِ ابْنِ إِبْرَاهِيمَ وَعَلِيُّ بْنُ مُسْلِمٍ قَالُوا حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الْأَعْمَشُ عَنْ مُسْلِمٍ عَنْ مَسْرُوقٍ عَنْ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا تَكَلَّمَ اللَّهُ بِالْوَحْيِ سَمِعَ أَهْلُ السَّمَاءِ لِلسَّمَاءِ صَلْصَلَةً كَجَرِّ السِّلْسِلَةِ عَلَى الصَّفَا فَيُصْعَقُونَ فَلَا يَزَالُونَ كَذَلِكَ حَتَّى يَأْتِيَهُمْ جِبْرِيلُ حَتَّى إِذَا جَاءَهُمْ جِبْرِيلُ فُزِّعَ عَنْ قُلُوبِهِمْ قَالَ فَيَقُولُونَ يَا جِبْرِيلُ مَاذَا قَالَ رَبُّكَ فَيَقُولُ الْحَقَّ فَيَقُولُونَ الْحَقَّ الْحَقَّ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abu Suraij Ar Razi] dan [Ali Ibnul Husain bin Ibrahim] dan [Ali bin Muslim] mereka berkata; telah menceritakan kepada kami [Abu Mu'awiyah] berkata, telah menceritakan kepada kami [Al A'masy] dari [Muslim] dari [Masruq] dari [Abdullah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika Allah menyampaikan wahyu maka penduduk langit mendengar gemerincing seperti ada suara rantai yang beradu hingga mereka pingsan. Dan mereka terus dalam kondisi seperti itu hingga datang Jibril, maka ketika Jibril datang mereka pun sadar.\" Beliau bersabda: \"Lalu mereka berkata, \"Wahai Jibril, apa yang disampaikan oleh Rabbmu?\" Jibril menjawab, \"Kebenaran.\" Mereka pun berkata lagi, \"Kebenaran, kebenaran.\""
            },
            {
                "number": 4114,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا بَسْطَامُ بْنُ حُرَيْثٍ عَنْ أَشْعَثَ الْحُدَّانِيِّ عَنْ أَنَسِ بْنِ مَالِكٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ شَفَاعَتِي لِأَهْلِ الْكَبَائِرِ مِنْ أُمَّتِي",
                "id": "Telah menceritakan kepada kami [Sulaiman bin harb] berkata, telah menceritakan kepada kami [Bastham bin Huraits] dari [Asy'ats Al Huddani] dari [Anas bin Malik] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Syafaatku berlaku untuk pelaku dosa besar dari umatku.\""
            },
            {
                "number": 4115,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ الْحَسَنِ بْنِ ذَكْوَانَ حَدَّثَنَا أَبُو رَجَاءٍ قَالَ حَدَّثَنِي عِمْرَانُ بْنُ حُصَيْنٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَخْرُجُ قَوْمٌ مِنْ النَّارِ بِشَفَاعَةِ مُحَمَّدٍ فَيَدْخُلُونَ الْجَنَّةَ وَيُسَمَّوْنَ الْجَهَنَّمِيِّينَ",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Yahya] dari [Al Hasan bin Dzakwan] berkata, telah menceritakan kepada kami [Abu Raja] ia berkata; telah menceritakan kepadaku [Imran bin Hushain] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Akan ada sekelompok orang keluar dari neraka karena syafaat Muhammad, mereka kemudian masuk ke dalam surga, dan mereka diberi nama Al Jahannamiyyun.\""
            },
            {
                "number": 4116,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ قَالَسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ أَهْلَ الْجَنَّةِ يَأْكُلُونَ فِيهَا وَيَشْرَبُونَ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Abu Sufyan] dari [Jabir] ia berkata, \"Aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya penduduk surga makan dan minum di dalamnya.\""
            },
            {
                "number": 4117,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا مُعْتَمِرٌ قَالَ سَمِعْتُ أَبِي قَالَ حَدَّثَنَا أَسْلَمُ عَنْ بِشْرِ بْنِ شَغَافٍ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍوعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الصُّورُ قَرْنٌ يُنْفَخُ فِيهِ",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Mu'tamir] ia berkata; Aku mendengar [Bapakku] berkata; telah menceritakan kepada kami [Aslam] dari [Bisyr bin Syaghaf] dari [Abdullah bin Amru] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Ash Shur adalah sangkakala yang ditiup.\""
            },
            {
                "number": 4118,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كُلَّ ابْنِ آدَمَ تَأْكُلُ الْأَرْضُ إِلَّا عَجْبَ الذَّنَبِ مِنْهُ خُلِقَ وَفِيهِ يُرَكَّبُ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Setiap anak Adam akan dimakan oleh bumi kecuali tulang ekor, darinya mereka dicipta dan darinya pula mereka akan disusun.\""
            },
            {
                "number": 4119,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَمَّا خَلَقَ اللَّهُ الْجَنَّةَ قَالَ لِجِبْرِيلَ اذْهَبْ فَانْظُرْ إِلَيْهَا فَذَهَبَ فَنَظَرَ إِلَيْهَا ثُمَّ جَاءَ فَقَالَ أَيْ رَبِّ وَعِزَّتِكَ لَا يَسْمَعُ بِهَا أَحَدٌ إِلَّا دَخَلَهَا ثُمَّ حَفَّهَا بِالْمَكَارِهِ ثُمَّ قَالَ يَا جِبْرِيلُ اذْهَبْ فَانْظُرْ إِلَيْهَا فَذَهَبَ فَنَظَرَ إِلَيْهَا ثُمَّ جَاءَ فَقَالَ أَيْ رَبِّ وَعِزَّتِكَ لَقَدْ خَشِيتُ أَنْ لَا يَدْخُلَهَا أَحَدٌ قَالَ فَلَمَّا خَلَقَ اللَّهُ النَّارَ قَالَ يَا جِبْرِيلُ اذْهَبْ فَانْظُرْ إِلَيْهَا فَذَهَبَ فَنَظَرَ إِلَيْهَا ثُمَّ جَاءَ فَقَالَ أَيْ رَبِّ وَعِزَّتِكَ لَا يَسْمَعُ بِهَا أَحَدٌ فَيَدْخُلُهَا فَحَفَّهَا بِالشَّهَوَاتِ ثُمَّ قَالَ يَا جِبْرِيلُ اذْهَبْ فَانْظُرْ إِلَيْهَا فَذَهَبَ فَنَظَرَ إِلَيْهَا ثُمَّ جَاءَ فَقَالَ أَيْ رَبِّ وَعِزَّتِكَ لَقَدْ خَشِيتُ أَنْ لَا يَبْقَى أَحَدٌ إِلَّا دَخَلَهَا",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Hammad] dari [Muhammad bin Amru] dari [Abu Salamah] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ketika selesai menciptakan surga, Allah berfirman kepada Jibril: \"Pergi dan lihatlah surga itu.\" Jibril kemudian pergi dan melihat surga, setelah itu ia kembali lagi seraya berkata, \"Wahai Rabb, demi kemuliaan-Mu, tidak seorang pun yang mendengar tentangnya kecuali ia ingin memasukinya.\" Kemudian Allah menutupi (merintangi) surga dengan hal-hal yang tidak disukai (oleh manusia). Lantas Allah berfirman: \"Wahai Jibril, pergi dan lihatlah surga itu.\" Jibril kemudian pergi dan melihat surga, setelah itu ia kembali lagi seraya berkata, \"Wahai Rabb, demi kemuliaan-Mu, aku kawatir tidak ada seorang pun yang hendak memasukinya.\" Beliau bersabda: \"Ketika selesai menciptakan neraka, Allah berfirman: \"Wahai Jibril, pergi dan lihatlah neraka itu.\" Jibril kemudian pergi dan melihat neraka, setelah itu ia kembali lagi seraya berkata, \"Wahai Rabb, demi kemuliaan-Mu, tidak seorang pun yang mendengar tentangnya kemudian timbul keinginan untuk memasukinya.\" Allah kemudian menutupi neraka dengan syahwat (kesenangan atau yang disukai manusia), lantas Allah berfirman: \"Wahai Jibril, pergi dan lihatlah neraka.\" kemudian Jibril pergi dan melihat neraka, setelah itu ia kembali lagi dan berkata, \"Wahai Rabb, demi kemuliaan-Mu, aku kawatir tidak ada seorang pun yang bakal tersisa (selamat).\""
            },
            {
                "number": 4120,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ وَمُسَدَّدٌ قَالَا حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَمَامَكُمْ حَوْضًا مَا بَيْنَ نَاحِيَتَيْهِ كَمَا بَيْنَ جَرْبَاءَ وَأَذْرُحَ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] dan [Musaddad] keduanya berkata; telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Di depan kalian ada sebuah telaga, jarak antara ujung yang satu dengan yang lainnya seperti jarak antara Jarba dengan Adzruh.\""
            },
            {
                "number": 4121,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ النَّمَرِيُّ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ أَبِي حَمْزَةَ عَنْ زَيْدِ بْنِ أَرْقَمَ قَالَكُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَزَلْنَا مَنْزِلًا فَقَالَ مَا أَنْتُمْ جُزْءٌ مِنْ مِائَةِ أَلْفِ جُزْءٍ مِمَّنْ يَرِدُ عَلَيَّ الْحَوْضَ قَالَ قُلْتُ كَمْ كُنْتُمْ يَوْمَئِذٍ قَالَ سَبْعُ مِائَةٍ أَوْ ثَمَانِ مِائَةٍ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar An Namari] berkata, telah menceritakan kepada kami [Syu'bah] dari [Amru bin Murrah] dari [Abu Hamzah] dari [Zaid bin Arqam] ia berkata, \"Kami pernah bersama Rasulullah shallallahu 'alaihi wasallam singgah pada suatu tempat, beliau lalu bersabda: \"Kalian tidak sampai satu bagian dari seratus ribu bagian orang yang datang untuk minum di telagaku.\" Perawi berkata, \"Berapa jumlah kalian waktu itu?\" Ia menjawab, \"Tujuh ratus atau delapan ratus orang.\""
            },
            {
                "number": 4122,
                "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ الْمُخْتَارِ بْنِ فُلْفُلٍ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُأَغْفَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِغْفَاءَةً فَرَفَعَ رَأْسَهُ مُتَبَسِّمًا فَإِمَّا قَالَ لَهُمْ وَإِمَّا قَالُوا لَهُ يَا رَسُولَ اللَّهِ لِمَ ضَحِكْتَ فَقَالَ إِنَّهُ أُنْزِلَتْ عَلَيَّ آنِفًا سُورَةٌ فَقَرَأَ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ{ إِنَّا أَعْطَيْنَاكَ الْكَوْثَرَ }حَتَّى خَتَمَهَا فَلَمَّا قَرَأَهَا قَالَ هَلْ تَدْرُونَ مَا الْكَوْثَرُ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ فَإِنَّهُ نَهْرٌ وَعَدَنِيهِ رَبِّي عَزَّ وَجَلَّ فِي الْجَنَّةِ وَعَلَيْهِ خَيْرٌ كَثِيرٌ عَلَيْهِ حَوْضٌ تَرِدُ عَلَيْهِ أُمَّتِي يَوْمَ الْقِيَامَةِ آنِيَتُهُ عَدَدُ الْكَوَاكِبِ",
                "id": "Telah menceritakan kepada kami [Hannad bin As Sari] berkata, telah menceritakan kepada kami [Muhammad bin Fudhail] dari [Al Mukhtar bin Fulful] ia berkata; Aku mendengar [Anas bin Malik] berkata, \"Rasulullah shallallahu 'alaihi wasallam terlelap beberapa saat, setelah itu beliau mengangkat kepala dan tersenyum. (waktu itu) beliau berkata kepada mereka, atau mereka yang berkata kepada beliau, \"Wahai Rasulullah, kenapa engkau tertawa?\" beliau menjawab: \"Baru saja turun kepadaku satu surat.\" Beliau lalu membaca: (Dengan menyebut nama Allah yang Maha Pemurah lagi Maha Penyayang. Sesungguhnya Kami telah memberikan kepadamu ni'mat yang banyak…) hingga akhir ayat. Ketika beliau selesai membacayanya, beliau bertanya: \"Apakah kalian tahu apa yang dimaksud dengan Al kautsar?\" para sahabat menjawab, \"Allah dan Rasul-Nya lebih tahu.\" Beliau bersabda: \"Itu adalah sungai di surga yang janjikan Rabbku kepadaku. Padanya banyak kebaikan. Padanya juga ada telaga yang digunakan untuk minum oleh umatku pada hari kiamat. Gelasnya sejumlah bintang di langit.\""
            },
            {
                "number": 4123,
                "arab": "حَدَّثَنَا عَاصِمُ بْنُ النَّضْرِ قَالَ حَدَّثَنَا الْمُعْتَمِرُ قَالَ سَمِعْتُ أَبِي قَالَ حَدَّثَنَا قَتَادَةُ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَلَمَّا عُرِجَ بِنَبِيِّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْجَنَّةِ أَوْ كَمَا قَالَ عُرِضَ لَهُ نَهْرٌ حَافَتَاهُ الْيَاقُوتُ الْمُجَيَّبُ أَوْ قَالَ الْمُجَوَّفُ فَضَرَبَ الْمَلَكُ الَّذِي مَعَهُ يَدَهُ فَاسْتَخْرَجَ مِسْكًا فَقَالَ مُحَمَّدٌ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلْمَلَكِ الَّذِي مَعَهُ مَا هَذَا قَالَ الْكَوْثَرُ الَّذِي أَعْطَاكَ اللَّهُ عَزَّ وَجَلَّ",
                "id": "Telah menceritakan kepada kami [Ashim bin An Nadhr] ia berkata; telah menceritakan kepada kami [Al Mu'tamir] ia berkata; aku mendengar [Bapakku] ia berkata; telah menceritakan kepada kami [Qatadah] dari [Anas bin Malik] ia berkata, \"Ketika Nabi shallallahu 'alaihi wasallam dinaikkan ke surga, atau sebagaimana yang ia katakan, \"diperlihatkan kepada beliau sebuah sungai yang dua tepinya dihiasi dengan permata. Kemudian malaikat yang bersamanya memukul tangannya hingga keluarlah minyak kesturi. Muhammad shallallahu 'alaihi wasallam lalu bertanya: \"Apa ini?\" malaikat itu menjawab, \"Ini adalah Al kautsar yang Allah Azza Wa Jalla berikan kepadamu.\""
            },
            {
                "number": 4124,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا عَبْدُ السَّلَامِ بْنُ أَبِي حَازِمٍ أَبُو طَالُوتَ قَالَشَهِدْتُ أَبَا بَرْزَةَ دَخَلَ عَلَى عُبَيْدِ اللَّهِ بْنِ زِيَادٍ فَحَدَّثَنِي فُلَانٌ سَمَّاهُ مُسْلِمٌ وَكَانَ فِي السِّمَاطِ فَلَمَّا رَآهُ عُبَيْدُ اللَّهِ قَالَ إِنَّ مُحَمَّدِيَّكُمْ هَذَا الدَّحْدَاحُ فَفَهِمَهَا الشَّيْخُ فَقَالَ مَا كُنْتُ أَحْسَبُ أَنِّي أَبْقَى فِي قَوْمٍ يُعَيِّرُونِي بِصُحْبَةِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَهُ عُبَيْدُ اللَّهِ إِنَّ صُحْبَةَ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَكَ زَيْنٌ غَيْرُ شَيْنٍ قَالَ إِنَّمَا بَعَثْتُ إِلَيْكَ لِأَسْأَلَكَ عَنْ الْحَوْضِ سَمِعْتَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَذْكُرُ فِيهِ شَيْئًا فَقَالَ لَهُ أَبُو بَرْزَةَ نَعَمْ لَا مَرَّةً وَلَا ثِنْتَيْنِ وَلَا ثَلَاثًا وَلَا أَرْبَعًا وَلَا خَمْسًا فَمَنْ كَذَّبَ بِهِ فَلَا سَقَاهُ اللَّهُ مِنْهُ ثُمَّ خَرَجَ مُغْضَبًا",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] berkata, telah menceritakan kepada kami [Abdussalam bin Abu Hazim Abu Thalut] ia berkata; Aku melihat [Abu Barzah] masuk menemui Ubaidullah bin Ziyad, lalu ada seseorang dalam sebuah rombongan bernama Muslim bercerita kepadaku. Ketika Ubaidullah melihatnya, ia berkata, \"Sesungguhnya salah satu dari kelompok Muhammad adalah orang yang gemuk dan pendek.\" Maka Abu Barzah pun mengerti apa yang dikatakan oleh Ubaidullah tersebut. Lantas Abu Barzah berkata, \"Aku tidak menyangka bisa hidup bersama orang-orang yang mencelaku karena aku berkumpul dengan Muhammad shallallahu 'alaihi wasallam.\" Ubaidullah balik berkata, \"Sesungguhnya persahabatanmu dengan Muhammad adalah perhiasan dan tidak ada celanya.\" Ia melanjutkan lagi kata-katanya, \"Dan aku datang kepadamu untuk bertanya perihal telaga, aku pernah mendengar Muhammad shallallahu 'alaihi wasallam menyebut-nyebut tentang itu?\" Abu Barzah menjawab, \"Benar. Tidak hanya satu kali, dua kali, tiga kali, empat kali atau lima kali (beliau sebutkan itu). Maka siapa saja yang mendustainya Allah tidak akan memberinya minum darinya.\" Lalu ia keluar dengan marah.\""
            },
            {
                "number": 4125,
                "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا شُعْبَةَ عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ عَنْ سَعْدِ بْنِ عُبَيْدَةَ عَنْ الْبَرَاءِ بْنِ عَازِبٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الْمُسْلِمَ إِذَا سُئِلَ فِي الْقَبْرِ فَشَهِدَ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَلِكَ قَوْلُ اللَّهِ عَزَّ وَجَلَّ{ يُثَبِّتُ اللَّهُ الَّذِينَ آمَنُوا بِالْقَوْلِ الثَّابِتِ }",
                "id": "Telah menceritakan kepada kami [Abu Al Walid Ath Thayalisi] berkata, telah menceritakan kepada kami [Syu'bah] dari [Alqamah bin Martsad] dari [Sa'd bin Ubaidah] dari [Al Bara bin Azib] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika seorang muslim ditanya dalam kubur, lalu ia bersaksi bahwa tidak ada Tuhan yang berhak disembah selain Allah, dan Muhammad shallallahu 'alaihi wasallam adalah utusan Allah. Maka itu adalah bukti dari firman Allah Azza Wa Jalla: (Allah meneguhkan (iman) orang-orang yang beriman dengan ucapan yang teguh…) -Qs. Ibrahim: 27-"
            },
            {
                "number": 4126,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ عَطَاءٍ الْخَفَّافُ أَبُو نَصْرٍ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَإِنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ نَخْلًا لِبَنِي النَّجَّارِ فَسَمِعَ صَوْتًا فَفَزِعَ فَقَالَ مَنْ أَصْحَابُ هَذِهِ الْقُبُورِ قَالُوا يَا رَسُولَ اللَّهِ نَاسٌ مَاتُوا فِي الْجَاهِلِيَّةِ فَقَالَ تَعَوَّذُوا بِاللَّهِ مِنْ عَذَابِ النَّارِ وَمِنْ فِتْنَةِ الدَّجَّالِ قَالُوا وَمِمَّ ذَاكَ يَا رَسُولَ اللَّهِ قَالَ إِنَّ الْمُؤْمِنَ إِذَا وُضِعَ فِي قَبْرِهِ أَتَاهُ مَلَكٌ فَيَقُولُ لَهُ مَا كُنْتَ تَعْبُدُ فَإِنْ اللَّهُ هَدَاهُ قَالَ كُنْتُ أَعْبُدُ اللَّهَ فَيُقَالُ لَهُ مَا كُنْتَ تَقُولُ فِي هَذَا الرَّجُلِ فَيَقُولُ هُوَ عَبْدُ اللَّهِ وَرَسُولُهُ فَمَا يُسْأَلُ عَنْ شَيْءٍ غَيْرِهَا فَيُنْطَلَقُ بِهِ إِلَى بَيْتٍ كَانَ لَهُ فِي النَّارِ فَيُقَالُ لَهُ هَذَا بَيْتُكَ كَانَ لَكَ فِي النَّارِ وَلَكِنَّ اللَّهَ عَصَمَكَ وَرَحِمَكَ فَأَبْدَلَكَ بِهِ بَيْتًا فِي الْجَنَّةِ فَيَقُولُ دَعُونِي حَتَّى أَذْهَبَ فَأُبَشِّرَ أَهْلِي فَيُقَالُ لَهُ اسْكُنْ وَإِنَّ الْكَافِرَ إِذَا وُضِعَ فِي قَبْرِهِ أَتَاهُ مَلَكٌ فَيَنْتَهِرُهُ فَيَقُولُ لَهُ مَا كُنْتَ تَعْبُدُ فَيَقُولُ لَا أَدْرِي فَيُقَالُ لَهُ لَا دَرَيْتَ وَلَا تَلَيْتَ فَيُقَالُ لَهُ فَمَا كُنْتَ تَقُولُ فِي هَذَا الرَّجُلِ فَيَقُولُ كُنْتُ أَقُولُ مَا يَقُولُ النَّاسُ فَيَضْرِبُهُ بِمِطْرَاقٍ مِنْ حَدِيدٍ بَيْنَ أُذُنَيْهِ فَيَصِيحُ صَيْحَةً يَسْمَعُهَا الْخَلْقُ غَيْرُ الثَّقَلَيْنِحَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ حَدَّثَنَا عَبْدُ الْوَهَّابِ بِمِثْلِ هَذَا الْإِسْنَادِ نَحْوَهُ قَالَ إِنَّ الْعَبْدَ إِذَا وُضِعَ فِي قَبْرِهِ وَتَوَلَّى عَنْهُ أَصْحَابُهُ إِنَّهُ لَيَسْمَعُ قَرْعَ نِعَالِهِمْ فَيَأْتِيهِ مَلَكَانِ فَيَقُولَانِ لَهُ فَذَكَرَ قَرِيبًا مِنْ حَدِيثِ الْأَوَّلِ قَالَ فِيهِ وَأَمَّا الْكَافِرُ وَالْمُنَافِقُ فَيَقُولَانِ لَهُ زَادَ الْمُنَافِقَ وَقَالَ يَسْمَعُهَا مَنْ وَلِيَهُ غَيْرُ الثَّقَلَيْنِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Sulaiman Al Anbari] berkata, telah menceritakan kepada kami [Abdul Wahhab bin Atha Al Khaffaf Abu Nashr] dari [Sa'id] dari [Qatadah] dari [Anas bin Malik] ia berkata, \"Nabi shallallahu 'alaihi wasallam pernah masuk ke sebuah kebun milik bani Najjar, lalu beliau mendengar suara hingga beliau kawatir. Beliau bertanya: \"Siapa yang dikubur ini?\" Para sahabat menjawab, \"Wahai Rasulullah, orang-orang yang mati pada masa Jahilliyah.\" Beliau bersabda: \"Berlindunglah kalian kepada Allah dari siksa neraka dan fitnah Dajjal.\" Para sahabat berkata, \"Wahai Rasulullah, memang kenapa?\" Beliau menjawab: \"Seorang mukmin jika telah diletakkan dalam kuburnya, maka seorang malaikat akan datang kepadanya seraya berkata, \"Apa yang kamu sembah?\" Jika Allah memberinya pentunjuk maka ia akan menjawab, \"Aku menyembah Allah.\" Lalu ditanyakan kepadanya, \"Apa yang kau katakan tentang laki-laki ini (Muhammad)?\" Lalu ia menjawab, \"Dia adalah hamba Allah dan rasul-Nya.\" Dan ia tidak ditanya kecuali pertanyaan tersebut. Lalu ia dibawa menuju rumah yang disediakan untuknya dalam neraka, dikatakan kepadanya, \"Ini adalah rumah yang semula disediakan untukmu di neraka, tetapi Allah telah melindungi dan memberimu rahmat lalu Allah menggantikan rumah di surga.\" Laki-laki mukmin itu pun berkata, \"Biarkanlah aku mengabarkan berita baik ini kepada keluargaku.\" Lalu dikatakan kepadanya, \"Diamlah.\", Dan seorang kafir jika telah diletakkan dalam kuburnya, maka seorang malaikat akan datang kepadanya seraya menghardiknya, lalu malaikat itu bertanya, \"Siapa yang kamu sembah?\" Laki-laki itu menjawab, \"Aku tidak tahu.\" Lalu dikatakan kepadanya, \"Engkau tidak tahu tapi tidak mau membaca!\" Lalu dikatakan kepadanya, \"Apa yang kamu katakan tentang ini (Muhammad)?\" Laki-laki itu menjawab, \"Aku mengatakan sebagaimana yang dikatakan oleh manusia.\" Malaikat itu lalu memukulnya dengan palu besi antara dua telinganya hingga ia melolong dan menjerit kesakitan dengan jeritan yang dapat didengar oleh para semua makhluk kecuali jin dan manusia.\" Telah menceritakan kepada kami Muhammad bin Sulaiman berkata, telah menceritakan kepada kami Abdul Wahhab dengan sanad yang sama; seperti hadits tersebut. Beliau bersabda: \"Jika seorang hamba diletakkan dalam kuburnya, dan orang-orang yang menghantarkannya telah kembali, maka ia dapat mendengar bunyi sandal mereka. setelah itu ada dua malaikat mendatanginya dan bertanya kepadanya. …lalu ia menyebutkan redaksi yang hampir sama dengan hadits pertama ia menyebutkan (dalam riwayatnya); \"Adapun orang kafir dan munafik, maka kedua malaikat itu akan berkata kepadanya\", - ia menambahkan kaliamat, 'munafik', dan ia juga menyebutkan dalam riwayatnya; \"akan dapat didengar oleh makhluk yang disekitarnya selain jin dan manusia.\""
            },
            {
                "number": 4127,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ ح و حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ حَدَّثَنَا أَبُو مُعَاوِيَةَ وَهَذَا لَفْظُ هَنَّادٍ عَنْ الْأَعْمَشِ عَنْ الْمِنْهَالِ عَنْ زَاذَانَ عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي جَنَازَةِ رَجُلٍ مِنْ الْأَنْصَارِ فَانْتَهَيْنَا إِلَى الْقَبْرِ وَلَمَّا يُلْحَدْ فَجَلَسَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَجَلَسْنَا حَوْلَهُ كَأَنَّمَا عَلَى رُءُوسِنَا الطَّيْرُ وَفِي يَدِهِ عُودٌ يَنْكُتُ بِهِ فِي الْأَرْضِ فَرَفَعَ رَأْسَهُ فَقَالَ اسْتَعِيذُوا بِاللَّهِ مِنْ عَذَابِ الْقَبْرِ مَرَّتَيْنِ أَوْ ثَلَاثًا زَادَ فِي حَدِيثِ جَرِيرٍ هَاهُنَا وَقَالَ وَإِنَّهُ لَيَسْمَعُ خَفْقَ نِعَالِهِمْ إِذَا وَلَّوْا مُدْبِرِينَ حِينَ يُقَالُ لَهُ يَا هَذَا مَنْ رَبُّكَ وَمَا دِينُكَ وَمَنْ نَبِيُّكَ قَالَ هَنَّادٌ قَالَ وَيَأْتِيهِ مَلَكَانِ فَيُجْلِسَانِهِ فَيَقُولَانِ لَهُ مَنْ رَبُّكَ فَيَقُولُ رَبِّيَ اللَّهُ فَيَقُولَانِ لَهُ مَا دِينُكَ فَيَقُولُ دِينِيَ الْإِسْلَامُ فَيَقُولَانِ لَهُ مَا هَذَا الرَّجُلُ الَّذِي بُعِثَ فِيكُمْ قَالَ فَيَقُولُ هُوَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَقُولَانِ وَمَا يُدْرِيكَ فَيَقُولُ قَرَأْتُ كِتَابَ اللَّهِ فَآمَنْتُ بِهِ وَصَدَّقْتُ زَادَ فِي حَدِيثِ جَرِيرٍ فَذَلِكَ قَوْلُ اللَّهِ عَزَّ وَجَلَّ{ يُثَبِّتُ اللَّهُ الَّذِينَ آمَنُوا }الْآيَةُ ثُمَّ اتَّفَقَا قَالَ فَيُنَادِي مُنَادٍ مِنْ السَّمَاءِ أَنْ قَدْ صَدَقَ عَبْدِي فَأَفْرِشُوهُ مِنْ الْجَنَّةِ وَافْتَحُوا لَهُ بَابًا إِلَى الْجَنَّةِ وَأَلْبِسُوهُ مِنْ الْجَنَّةِ قَالَ فَيَأْتِيهِ مِنْ رَوْحِهَا وَطِيبِهَا قَالَ وَيُفْتَحُ لَهُ فِيهَا مَدَّ بَصَرِهِ قَالَ وَإِنَّ الْكَافِرَ فَذَكَرَ مَوْتَهُ قَالَ وَتُعَادُ رُوحُهُ فِي جَسَدِهِ وَيَأْتِيهِ مَلَكَانِ فَيُجْلِسَانِهِ فَيَقُولَانِ لَهُ مَنْ رَبُّكَ فَيَقُولُ هَاهْ هَاهْ هَاهْ لَا أَدْرِي فَيَقُولَانِ لَهُ مَا دِينُكَ فَيَقُولُ هَاهْ هَاهْ لَا أَدْرِي فَيَقُولَانِ مَا هَذَا الرَّجُلُ الَّذِي بُعِثَ فِيكُمْ فَيَقُولُ هَاهْ هَاهْ لَا أَدْرِي فَيُنَادِي مُنَادٍ مِنْ السَّمَاءِ أَنْ كَذَبَ فَأَفْرِشُوهُ مِنْ النَّارِ وَأَلْبِسُوهُ مِنْ النَّارِ وَافْتَحُوا لَهُ بَابًا إِلَى النَّارِ قَالَ فَيَأْتِيهِ مِنْ حَرِّهَا وَسَمُومِهَا قَالَ وَيُضَيَّقُ عَلَيْهِ قَبْرُهُ حَتَّى تَخْتَلِفَ فِيهِ أَضْلَاعُهُ زَادَ فِي حَدِيثِ جَرِيرٍ قَالَ ثُمَّ يُقَيَّضُ لَهُ أَعْمَى أَبْكَمُ مَعَهُ مِرْزَبَّةٌ مِنْ حَدِيدٍ لَوْ ضُرِبَ بِهَا جَبَلٌ لَصَارَ تُرَابًا قَالَ فَيَضْرِبُهُ بِهَا ضَرْبَةً يَسْمَعُهَا مَا بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ إِلَّا الثَّقَلَيْنِ فَيَصِيرُ تُرَابًا قَالَ ثُمَّ تُعَادُ فِيهِ الرُّوحُحَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ حَدَّثَنَا الْأَعْمَشُ حَدَّثَنَا الْمِنْهَالُ عَنْ أَبِي عُمَرَ زَاذَانَ قَالَ سَمِعْتُ الْبَرَاءَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَذَكَرَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Jarir]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Hannad As Sari] berkata, telah menceritakan kepada kami [Abu Mu'awiyah] - dan ini adalah lafadz Hannad- dari [Al A'masy] dari [Al Minhal] dari [Zadzan] dari [Al Bara bin Azib] ia berkata, \"Kami bersama Rasulullah shallallahu 'alaihi wasallam keluar untuk melihat jenazah seorang laki-laki Anshar, kami pun tiba di pemakaman. Ketika lubang lahad telah dibuat, Rasulullah shallallahu 'alaihi wasallam duduk, lalu kami ikut duduk di sisinya. Kami diam, seakan-akan di atas kepala kami ada burung. Saat itu beliau memegang sebatang kayu yang ditancapkan ke dalam tanah, beliau lalu mengangkat kepalanya dan bersabda: \"Mintalah perlindungan kepada Allah dari siksa kubur.\" Beliau ucapkan kalimat itu hingga dua atau tiga kali. Demikanlah tambahan dalam hadits Jarir. Beliau melanjutkan: \"Sungguh, mayat itu akan dapat mendengar derap sandal mereka saat berlalau pulang; yakni ketika ditanyakan kepadanya, 'Wahai kamu, siapa Rabbmu? Apa agamamu? Dan siapa Nabimu? ' -Hannad menyebutkan; Beliau bersabda: - \"lalu ada dua malaikat mendatanginya seranya mendudukkannya. Malaikat itu bertanya, \"Siapa Rabbmu?\" ia menjawab, \"Rabbku adalah Allah.\" Malaikat itu bertanya lagi, \"Apa agamamu?\" ia menjawab, \"Agamaku adalah Islam.\" Malaikat itu bertanya lagi, \"Siapa laki-laki yang diutus kepada kalian ini? ' ia menjawab, \"Dia adalah Rasulullah shallallahu 'alaihi wasallam.\" malaikat itu bertanya lagi, \"Apa yang kamu ketahui?\" ia menjawab, \"Aku membaca Kitabullah, aku mengimaninya dan membenarkannya.\" Dalam hadits Jarir ditambahkan, \"Maka inilah makna firman Allah: '(Allah meneguhkan (iman) orang-orang yang beriman…) ' hingga akhir ayat. -Qs. Ibrahim: 27- kemudian kedua perawi sepakat pada lafadz, \"Beliau bersabda: \"Kemudian ada suara dari langit yang menyeru, \"Benarlah apa yang dikatakan oleh hamba-Ku, hamparkanlah permadani untuknya di surga, bukakan baginya pintu-pintu surga dan berikan kepadanya pakaian surga.\" beliau melanjutkan: \"Kemudian didatangkan kepadanya wewangian surga, lalu kuburnya diluaskan sejauh mata memandang.\" Beliau melanjutkan: \"Jika yang meninggal adalah orang kafir, maka ruhnya akan dikembalikan kepada jasadnya. Saat itu datanglah dua malaikat serya mendudukkannya. Kedua malaikat itu bertanya, \"Siapa Rabbmu?\" ia menjawab, \"Hah, hah, hah. Aku tidak tahu.\" Malaikat itu bertanya, \"Apa agamamu?\" ia menjawab, \"Hah, hah. Aku tidak tahu.\" Malaikat itu bertanya lagi, \"Siapa laki-laki yang diutus kepada kalian ini? ' ia menjawab, \"Hah, hah. Aku tidak tahu.\" Setelah itu terdengar suara dari langit: \"Ia telah berdusta. Berilah ia hamparan permadani dari neraka, berikan pakaian dari neraka, dan bukakanlah pintu-pintu neraka untuknya.\" Beliau melanjutkan: \"Kemudian didatangkan kepadanya panas dan baunya neraka. Lalu kuburnya disempitkan hingga tulangnya saling berhimpitan.\" Dalam hadits Jarir ditambahkan, \"Beliau bersabda: \"Lalu ia dibelenggu dalam keadaan buta dan bisu. Dan baginya disediakan sebuah pemukul dari besi, sekiranya pemukul itu dipukulkan pada sebuah gunung niscaya akan menjadi debu.\" Beliau melanjutkan: \"Laki-laki kafir itu kemudian dipukul dengan pemukul tersebut hingga suaranya dapat didengar oleh semua makhluk; dari ujung timur hingga ujung barat -kecuali jin dan manusia- hingga menjadi debu.\" Beliau meneruskan ceritanya: \"Setelah itu, ruhnya dikembalikan lagi.\" Telah menceritakan kepada kami [Hannad bin As Sari] berkata, telah menceritakan kepada kami [Abdullah bin Numair] berkata, telah menceritakan kepada kami [Al A'masy] berkata, telah menceritakan kepada kami [Al Minhal] dari [Abu Umar Zadzan] ia berkata; Aku mendengar [Al Bara] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda…. lalu ia menyebutkan seperti hadits tersebut.\""
            },
            {
                "number": 4128,
                "arab": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ وَحُمَيْدُ بْنُ مَسْعَدَةَ أَنَّ إِسْمَعِيلَ بْنَ إِبْرَاهِيمَ حَدَّثَهُمْ قَالَ أَخْبَرَنَا يُونُسُ عَنْ الْحَسَنِ عَنْ عَائِشَةَأَنَّهَا ذَكَرَتْ النَّارَ فَبَكَتْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا يُبْكِيكِ قَالَتْ ذَكَرْتُ النَّارَ فَبَكَيْتُ فَهَلْ تَذْكُرُونَ أَهْلِيكُمْ يَوْمَ الْقِيَامَةِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَّا فِي ثَلَاثَةِ مَوَاطِنَ فَلَا يَذْكُرُ أَحَدٌ أَحَدًا عِنْدَ الْمِيزَانِ حَتَّى يَعْلَمَ أَيَخِفُّ مِيزَانُهُ أَوْ يَثْقُلُ وَعِنْدَ الْكِتَابِ حِينَ يُقَالُ{ هَاؤُمُ اقْرَءُوا كِتَابِيَهْ }حَتَّى يَعْلَمَ أَيْنَ يَقَعُ كِتَابُهُ أَفِي يَمِينِهِ أَمْ فِي شِمَالِهِ أَمْ مِنْ وَرَاءِ ظَهْرِهِ وَعِنْدَ الصِّرَاطِ إِذَا وُضِعَ بَيْنَ ظَهْرَيْ جَهَنَّمَقَالَ يَعْقُوبُ عَنْ يُونُسَ وَهَذَا لَفْظُ حَدِيثِهِ",
                "id": "Telah menceritakan kepada kami [Ya'qub bin Ibrahim] dan [Humaid bin Mas'adah] bahwa [Isma'il bin Ibrahim] menceritakan kepada mereka, ia berkata; telah mengabarkan kepada kami [Yunus] dari [Al Hasan] dari ['Aisyah] Bahwasanya ia mengingat-ingat neraka lalu menangis. Rasulullah shallallahu 'alaihi wasallam lantas bertanya: \"Apa yang membuatmu menangis?\" 'Aisyah menjawab, \"Aku ingat dengan neraka, lalu aku menangis. Apakah kalian mengingat keluarga kalian pada hari kiamat?\" Beliau bersabda: \"Ada tiga tempat seseorang tidak akan lagi ingat kepada orang lain; saat berada di atas mizan (timbangan amal) hingga ia tahu apakah timbangannya lebih ringan atau berat, ketika menerima buku amalan, yaitu saat dikatakan kepadanya, 'Ambillah, bacalah kitabku (ini) ', hingga ia tahu dari mana bukunya akan diberikan dari sebelah kanan atau sebelah kiri atau dari belakang punggungnya. Dan ketika di atas shirath, yaitu titian di antara dua punggung jahannam.\" Ya'qub menyebutkan dari Yunus, dan ini adalah lafadz haditsnya. "
            },
            {
                "number": 4129,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ عَنْ عَبْدِ اللَّهِ بْنِ سُرَاقَةَ عَنْ أَبِي عُبَيْدَةَ بْنِ الْجَرَّاحِقَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّهُ لَمْ يَكُنْ نَبِيٌّ بَعْدَ نُوحٍ إِلَّا وَقَدْ أَنْذَرَ الدَّجَّالَ قَوْمَهُ وَإِنِّي أُنْذِرُكُمُوهُ فَوَصَفَهُ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ لَعَلَّهُ سَيُدْرِكُهُ مَنْ قَدْ رَآنِي وَسَمِعَ كَلَامِي قَالُوا يَا رَسُولَ اللَّهِ كَيْفَ قُلُوبُنَا يَوْمَئِذٍ أَمِثْلُهَا الْيَوْمَ قَالَ أَوْ خَيْرٌ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Hammad] dari [Khalid Al Hadzdza] dari [Abdullah bin Syaqiq] dari [Abdullah bin Suraqah] dari [Abu Ubaidah Ibnul Jarrah] ia berkata, \"Aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak ada seorang Nabi pun setelah Nuh kecuali telah mengingatkan umatnya tentang Dajjal, dan sesungguhnya aku memperingatkan kalian darinya.\" Rasulullah shallallahu 'alaihi wasallam kemudian menshifati (memberikan gambaran) Dajjal kepada kami, beliau bersabda: \"Bisa jadi orang yang melihat dan mendengarku akan melihat Dajjal.\" Para sahabat bertanya, \"Wahai Rasulullah, bagaimana dengan kondisi hati kami waktu itu, apakah seperti sekarang ini?\" Beliau menjawab: \"Ya, baik.\""
            },
            {
                "number": 4130,
                "arab": "حَدَّثَنَا مَخْلَدٌ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَقَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي النَّاسِ فَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ فَذَكَرَ الدَّجَّالَ فَقَالَ إِنِّي لَأُنْذِرُكُمُوهُ وَمَا مِنْ نَبِيٍّ إِلَّا قَدْ أَنْذَرَهُ قَوْمَهُ لَقَدْ أَنْذَرَهُ نُوحٌ قَوْمَهُ وَلَكِنِّي سَأَقُولُ لَكُمْ فِيهِ قَوْلًا لَمْ يَقُلْهُ نَبِيٌّ لِقَوْمِهِ تَعْلَمُونَ أَنَّهُ أَعْوَرُ وَأَنَّ اللَّهَ لَيْسَ بِأَعْوَرَ",
                "id": "Telah menceritakan kepada kami [Makhlad] berkata, telah menceritakan kepada kami [Abdurrazaq] berkata, telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Salim] dari [Bapaknya] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam berdiri di hadapan orang-orang seraya memuji Allah dengan pujian yang layak bagi-Nya. Kemudian beliau menceritakan tentang Dajjal, beliau bersabda: \"Sungguh, aku akan memberi peringatan kepada kalian tentang Dajjal, dan tidak ada seorang Nabi pun kecuali ia telah memberi peringatan kepada kaumnya darinya. Nuh telah memberi peringatan kepada kaumnya. Tetapi aku akan menyampaikan kepada kalian tentang dajjal dengan suatu ucapan yang belum pernah disampaikan oleh seorang Nabi kepada kaumnya. Ketahuilah sesungguhnya dajjal itu buta sebelah, sementara Allah tidak buta sebelah.\""
            },
            {
                "number": 4131,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ وَأَبُو بَكْرِ بْنُ عَيَّاشٍ وَمَنْدَلٌ عَنْ مُطَرِّفٍ عَنْ أَبِي جَهْمٍ عَنْ خَالِدِ بْنِ وَهْبَانَ عَنْ أَبِي ذَرٍّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ فَارَقَ الْجَمَاعَةَ شِبْرًا فَقَدْ خَلَعَ رِبْقَةَ الْإِسْلَامِ مِنْ عُنُقِهِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus] berkata, telah menceritakan kepada kami [Zuhair] dan [Abu Bakr bin Ayyasy] dan [Mandal] dari [Mutharrif] dari [Abu Jahm] dari [Khalid bin Wahban] dari [Abu Dzar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapa yang meninggalkan jamaah meskipun hanya satu jengkal, sungguh ia telah melepas ikatan Islam dari lehernya.\""
            },
            {
                "number": 4132,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا مُطَرِّفُ بْنُ طَرِيفٍ عَنْ أَبِي الْجَهْمِ عَنْ خَالِدِ بْنِ وَهْبَانَ عَنْ أَبِي ذَرٍّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَيْفَ أَنْتُمْ وَأَئِمَّةٌ مِنْ بَعْدِي يَسْتَأْثِرُونَ بِهَذَا الْفَيْءِ قُلْتُ إِذَنْ وَالَّذِي بَعَثَكَ بِالْحَقِّ أَضَعُ سَيْفِي عَلَى عَاتِقِي ثُمَّ أَضْرِبُ بِهِ حَتَّى أَلْقَاكَ أَوْ أَلْحَقَكَ قَالَ أَوَلَا أَدُلُّكَ عَلَى خَيْرٍ مِنْ ذَلِكَ تَصْبِرُ حَتَّى تَلْقَانِي",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili] berkata, telah menceritakan kepada kami [Zuhair] berkata, telah menceritakan kepada kami [Mutharrif bin Tharif] dari [Abul Jahm] dari [Khalid bin Wahban] dari [Abu Dzar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apa yang kalian lakukan jika para pemimpin setelahku saling berebut (mempertahankan) harta fai`?\" Aku menjawab, \"Jika begitu, maka demi Dzat yang mengutusmu dengan Al Haq, aku akan meletakkan pedangku dipundak, aku akan berperang dengannya hingga aku berjumpa denganmu, atau perawi menyebutkan, \"hingga aku menyusulmu.\" Beliau bersabda: \"Maukah aku tunjukkan dengan yang lebih baik dari itu? Bersabarlah hingga engkau berjumpa denganku.\""
            },
            {
                "number": 4133,
                "arab": "حَدَّثَنَا مُسَدَّدٌ وَسُلَيْمَانُ بْنُ دَاوُدَ الْمَعْنَى قَالَا حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ الْمُعَلَّى بْنِ زِيَادٍ وَهِشَامِ بْنِ حَسَّانَ عَنْ الْحَسَنِ عَنْ ضَبَّةَ بْنِ مِحْصَنٍ عَنْ أُمِّ سَلَمَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَتَكُونُ عَلَيْكُمْ أَئِمَّةٌ تَعْرِفُونَ مِنْهُمْ وَتُنْكِرُونَ فَمَنْ أَنْكَرَ قَالَ أَبُو دَاوُد قَالَ هِشَامٌ بِلِسَانِهِ فَقَدْ بَرِئَ وَمَنْ كَرِهَ بِقَلْبِهِ فَقَدْ سَلِمَ وَلَكِنْ مَنْ رَضِيَ وَتَابَعَ فَقِيلَ يَا رَسُولَ اللَّهِ أَفَلَا نَقْتُلُهُمْ قَالَ ابْنُ دَاوُدَ أَفَلَا نُقَاتِلُهُمْ قَالَ لَا مَا صَلَّوْاحَدَّثَنَا ابْنُ بَشَّارٍ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ قَالَ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ قَالَ حَدَّثَنَا الْحَسَنُ عَنْ ضَبَّةَ بْنِ مِحْصَنٍ الْعَنَزِيِّ عَنْ أُمِّ سَلَمَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَاهُ قَالَ فَمَنْ كَرِهَ فَقَدْ بَرِئَ وَمَنْ أَنْكَرَ فَقَدْ سَلِمَ قَالَ قَتَادَةُ يَعْنِي مَنْ أَنْكَرَ بِقَلْبِهِ وَمَنْ كَرِهَ بِقَلْبِهِ",
                "id": "Telah menceritakan kepada kami [Musaddad] dan [Sulaiman bin Dawud] secara makna, keduanya berkata; telah menceritakan kepada kami [Hammad bin Zaid] dari [Al Mu'alla bin Ziyad] dan [Hisyam bin Hassan] dari [Al Hasan] dari [Dhabbah bin Mihshan] dari [Ummu Salamah] isteri Nabi shallallahu 'alaihi wasallam, ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Akan ada di antara kalian para pemimpin yang kalian mengenalnya tetapi kalian mengingkarinya. Maka barangsiapa mengingkarinya, Abu Dawud berkata, \"Hisyam menyebutkan, \"dengan lisan, maka ia telah berlepas diri darinya. Siapa yang membenci dengan hatinya maka ia telah selamat. Tetapi siapa yang ridha dan mengikutinya, lalu dikatakan kepadanya, \"Wahai Rasulullah, bagaimana jika kami membununya?\" Ibnu Dawud menyebutkan, \"bagaimana jika kami memeranginya?\" beliau menjawab: \"Jangan, selama mereka masih shalat.\" Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Mu'adz bin Hisyam] ia berkata; telah menceritakan kepadaku [Bapakku] dari [Qatadah] ia berkata; telah menceritakan kepada kami [Al Hasan] dari [Dhabbah bin Mihshan Al 'Anbari] dari [Ummu Salamah] dari Nabi shallallahu 'alaihi wasallam dengan makna yang sama. Beliau bersabda: \"Siapa yang membenci, maka ia telah berlepas diri. Dan siapa yang mengingkari, maka ia telah selamat.\" Qatadah berkata, maksudnya \"Siapa yang mengingkari dengan hatinya, dan siapa yang membenci dengan hatinya.\""
            },
            {
                "number": 4134,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ شُعْبَةَ عَنْ زِيَادِ بْنِ عِلَاقَةَ عَنْ عَرْفَجَةَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ سَتَكُونُ فِي أُمَّتِي هَنَاتٌ وَهَنَاتٌ وَهَنَاتٌ فَمَنْ أَرَادَ أَنْ يُفَرِّقَ أَمْرَ الْمُسْلِمِينَ وَهُمْ جَمِيعٌ فَاضْرِبُوهُ بِالسَّيْفِ كَائِنًا مَنْ كَانَ",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Yahya] dari [Syu'bah] dari [Ziyad bin Ilaqah] dari [Arfajah] ia berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Akan terjadi pada umatku fitnah dan kebid'ahan, fitnah dan kebid'ahan, fitnah dan kebid'ahan. Maka siapa yang ingin memecah-belah urusan kaum muslimin -ketika mereka bersatu- maka bunuhlah, siapapun dia.\""
            },
            {
                "number": 4135,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ وَمُحَمَّدُ بْنُ عِيسَى الْمَعْنَى قَالَا حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ عَنْ مُحَمَّدٍ عَنْ عَبِيدَةَأَنَّ عَلِيًّا ذَكَرَ أَهْلَ النَّهْرَوَانِ فَقَالَ فِيهِمْ رَجُلٌ مُودَنُ الْيَدِ أَوْ مُخْدَجُ الْيَدِ أَوْ مَثْدُونُ الْيَدِ لَوْلَا أَنْ تَبْطَرُوا لَنَبَّأْتُكُمْ مَا وَعَدَ اللَّهُ الَّذِينَ يَقْتُلُونَهُمْ عَلَى لِسَانِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قُلْتُ أَنْتَ سَمِعْتَ هَذَا مِنْهُ قَالَ قَالَ إِي وَرَبِّ الْكَعْبَةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ubaid] dan [Muhammad bin Isa] secara makna, keduanya berkata; telah menceritakan kepada kami [Hammad] dari [Ayyub] dari [Muhammad] dari [Abidah] berkata, \" [Ali] menyebut-nyebut tentang penduduk Nahrawan. Ia mengatakan, \"Di antara mereka ada seorang laki-laki yang tangannya kecil atau pendek, sekiranya aku tidak kawatir kalian akan terlalu bergembira, maka aku akan kabarkan kepada kalian tentang apa yang telah Allah janjikan bagi orang-orang yang akan membunuh mereka, melalui lisan Muhammad shallallahu 'alaihi wasallam.\" Abidah berkata, \"Aku bertanya, \"Apakah engkau benar-benar mendengarnya dari beliau?\" Ali menjawab, \"Ya. Demi Dzat pemilik Ka'bah.\""
            },
            {
                "number": 4136,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ أَبِيهِ عَنْ ابْنِ أَبِي نُعْمٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَبَعَثَ عَلِيٌّ عَلَيْهِ السَّلَام إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِذُهَيْبَةٍ فِي تُرْبَتِهَا فَقَسَّمَهَا بَيْنَ أَرْبَعَةٍ بَيْنَ الْأَقْرَعِ بْنِ حَابِسٍ الْحَنْظَلِيِّ ثُمَّ الْمُجَاشِعِيِّ وَبَيْنَ عُيَيْنَةَ بْنِ بَدْرٍ الْفَزَارِيِّ وَبَيْنَ زَيْدِ الْخَيْلِ الطَّائِيِّ ثُمَّ أَحَدِ بَنِي نَبْهَانَ وَبَيْنَ عَلْقَمَةَ بْنِ عُلَاثَةَ الْعَامِرِيِّ ثُمَّ أَحَدِ بَنِي كِلَابٍ قَالَ فَغَضِبَتْ قُرَيْشٌ وَالْأَنْصَارُ وَقَالَتْ يُعْطِي صَنَادِيدَ أَهْلِ نَجْدٍ وَيَدَعُنَا فَقَالَ إِنَّمَا أَتَأَلَّفُهُمْ قَالَ فَأَقْبَلَ رَجُلٌ غَائِرُ الْعَيْنَيْنِ مُشْرِفُ الْوَجْنَتَيْنِ نَاتِئُ الْجَبِينِ كَثُّ اللِّحْيَةِ مَحْلُوقٌ قَالَ اتَّقِ اللَّهَ يَا مُحَمَّدُ فَقَالَ مَنْ يُطِيعُ اللَّهَ إِذَا عَصَيْتُهُ أَيَأْمَنُنِي اللَّهُ عَلَى أَهْلِ الْأَرْضِ وَلَا تَأْمَنُونِي قَالَ فَسَأَلَ رَجُلٌ قَتْلَهُ أَحْسِبُهُ خَالِدَ بْنَ الْوَلِيدِ قَالَ فَمَنَعَهُ قَالَ فَلَمَّا وَلَّى قَالَ إِنَّ مِنْ ضِئْضِئِ هَذَا أَوْ فِي عَقِبِ هَذَا قَوْمًا يَقْرَءُونَ الْقُرْآنَ لَا يُجَاوِزُ حَنَاجِرَهُمْ يَمْرُقُونَ مِنْ الْإِسْلَامِ مُرُوقَ السَّهْمِ مِنْ الرَّمِيَّةِ يَقْتُلُونَ أَهْلَ الْإِسْلَامِ وَيَدَعُونَ أَهْلَ الْأَوْثَانِ لَئِنْ أَنَا أَدْرَكْتُهُمْ قَتَلْتُهُمْ قَتْلَ عَادٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] berkata, telah mengabarkan kepada kami [Sufyan] dari [Bapaknya] dari [Ibnu Abu Nu'm] dari [Abu Sa'id Al Khudri] ia berkata, \"Ali radliallahu 'anhu mengirimkan kepada Nabi shallallahu 'alaihi wasallam emas yang masih kotor dengan debu. Beliau kemudian mambagi-bagikannya kepada empat orang; yaitu Al Aqra' bin Habis Al Hanzhali, Al Mujasyi'I, Uyainah bin Badr Al Fazari dan Zaid Al Khail Ath Tha`i. kemudian ke salah orang dari bani Nabhan, Alqamah bin Ulatsah Al 'Amiri dan seorang dari bani Kilab.\" Sa'id Al khudri berkata, \"Orang-orang Quraisy dan Anshar kemudian marah, mereka mengatakan, \"Beliau memberikan kepada tokoh-tokoh penduduk Najd dan membiarkan kita.\" Beliau pun bersabda: \"Aku hanya melunakkan hati mereka.\" Sa'id berkata, \"Kemudian datanglah seorang laki-laki yang matanya cekung, berdahi lebar, janggut panjang dan kepala gundul. Laki-laki itu berkata, \"Wahai Muhammad, bertakwalah kamu kepada Allah!\" Beliau bersabda: \"Siapa yang taat kepada Allah jika aku bermaksiat! Bukankah Allah mempercayaiku untuk menyampaikan amanah kepada penduduk bumi, sementara kalian tidak mempercayaiku.\" Sa'id berkata, \"Lalu ada seorang lelaki yang memohon izin untuk membunuh laki-laki tersebut, dan aku kira orang itu adalah Khalid bin Al Walid. Namun beliau melarangnya.\" Sa'id berkata, \"Ketika orang tersebut telah berlalu pergi, beliau bersabda: \"Sesungguhnya dari keturunan orang ini akan muncul suatu kaum yang membaca Al-Qur'an namun tidak melampaui kerongkongannya. Mereka keluar dari Islam sebagaimana keluarnya anak panah dari busurnya. Mereka membunuh orang-orang Islam namun bersikap baik kepada penyembah berhala. Jika aku mendapati mereka, maka aku akan membunuh mereka sebagaimana pembunuhan kaum Ad (kaumnya Nabi Hud).\""
            },
            {
                "number": 4137,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَاصِمٍ الْأَنْطَاكِيُّ حَدَّثَنَا الْوَلِيدُ وَمُبَشِّرٌ يَعْنِي ابْنَ إِسْمَعِيلَ الْحَلَبِيَّ عَنْ أَبِي عَمْرٍو قَالَ يَعْنِي الْوَلِيدَ حَدَّثَنَا أَبُو عَمْرٍو قَالَ حَدَّثَنِي قَتَادَةُ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ وَأَنَسِ بْنِ مَالِكٍعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ سَيَكُونُ فِي أُمَّتِي اخْتِلَافٌ وَفُرْقَةٌ قَوْمٌ يُحْسِنُونَ الْقِيلَ وَيُسِيئُونَ الْفِعْلَ يَقْرَءُونَ الْقُرْآنَ لَا يُجَاوِزُ تَرَاقِيَهُمْ يَمْرُقُونَ مِنْ الدِّينِ مُرُوقَ السَّهْمِ مِنْ الرَّمِيَّةِ لَا يَرْجِعُونَ حَتَّى يَرْتَدَّ عَلَى فُوقِهِ هُمْ شَرُّ الْخَلْقِ وَالْخَلِيقَةِ طُوبَى لِمَنْ قَتَلَهُمْ وَقَتَلُوهُ يَدْعُونَ إِلَى كِتَابِ اللَّهِ وَلَيْسُوا مِنْهُ فِي شَيْءٍ مَنْ قَاتَلَهُمْ كَانَ أَوْلَى بِاللَّهِ مِنْهُمْ قَالُوا يَا رَسُولَ اللَّهِ مَا سِيمَاهُمْ قَالَ التَّحْلِيقُحَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ قَتَادَةَ عَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ قَالَ سِيمَاهُمْ التَّحْلِيقُ وَالتَّسْبِيدُ فَإِذَا رَأَيْتُمُوهُمْ فَأَنِيمُوهُمْ قَالَ أَبُو دَاوُد التَّسْبِيدُ اسْتِئْصَالُ الشَّعْرِ",
                "id": "Telah menceritakan kepada kami [Nashr bin Ashim Al Anthaki] berkata, telah menceritakan kepada kami [Al Walid] dan [Mubasysyir] -maksudnya Mubassyir bin Isma'il Al Halabi- dari [Abu Amru]. Ia (Al Walid) berkata; telah menceritakan kepada kami [Abu Amru] berkata; telah menceritakan kepadaku [Qatadah] dari [Abu Sa'id Al Khudri] dan [Anas bin Malik] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Akan terjadi perbedaan dan perpecahan di antara umatku, sebagian kelompok pandai dalam berbicara namun akhlak mereka buruk. Mereka membaca Al-Qur'an namun tidak sampai melewati kerongkongan. Mereka keluar dari agama sebagaimana anak panah lepas dari busurnya, dan mereka tidak akan kembali lagi hingga anak panah kembali ke busurnya. Mereka adalah seburuk-buruk manusia. Maka beruntunglah orang yang membunuhnya dan mereka membunuhnya. Mereka mengajak kepada Al-Qur'an, tetapi mereka sendiri tidak mengamalkannya sama sekali. Siapa memerangi mereka, maka yang demikian lebih mulia di sisi Allah.\" Para sahabat bertanya, \"Wahai Rasulullah, bagaimana ciri-ciri mereka?\" Beliau menjawab: \"Rambutnya dicukur gundul.\" Telah menceritakan kepada kami [Al Hasan bin Ali] berkata, telah menceritakan kepada kami [Abdurrazaq] berkata, telah mengabarkan kepada kami [Ma'mar] dari [Qatadah] dari [Anas] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ciri mereka adalah rambutnya dicukur gundul dan dicabut, jika kalian mendapati mereka maka bunuhlah.\" Abu Dawud berkata, \"At tasbid adalah mencabut rambut.\""
            },
            {
                "number": 4138,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ حَدَّثَنَا الْأَعْمَشُ عَنْ خَيْثَمَةَ عَنْ سُوَيْدِ بْنِ غَفَلَةَ قَالَ قَالَ عَلِيٌّ عَلَيْهِ السَّلَامإِذَا حَدَّثْتُكُمْ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدِيثًا فَلَأَنْ أَخِرَّ مِنْ السَّمَاءِ أَحَبُّ إِلَيَّ مِنْ أَنْ أَكْذِبَ عَلَيْهِ وَإِذَا حَدَّثْتُكُمْ فِيمَا بَيْنِي وَبَيْنَكُمْ فَإِنَّمَا الْحَرْبُ خَدْعَةٌ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يَأْتِي فِي آخِرِ الزَّمَانِ قَوْمٌ حُدَثَاءُ الْأَسْنَانِ سُفَهَاءُ الْأَحْلَامِ يَقُولُونَ مِنْ قَوْلِ خَيْرِ الْبَرِيَّةِ يَمْرُقُونَ مِنْ الْإِسْلَامِ كَمَا يَمْرُقُ السَّهْمُ مِنْ الرَّمِيَّةِ لَا يُجَاوِزُ إِيمَانُهُمْ حَنَاجِرَهُمْ فَأَيْنَمَا لَقِيتُمُوهُمْ فَاقْتُلُوهُمْ فَإِنَّ قَتْلَهُمْ أَجْرٌ لِمَنْ قَتَلَهُمْ يَوْمَ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] berkata, telah mengabarkan kepada kami [Sufyan] berkata, telah menceritakan kepada kami [Al A'masy] dari [Khaitsamah] dari [Suwaid bin Ghafalah] ia berkata; [Ali radliallahu 'anhu] berkata, \"Jika aku menceritakan kepada kalian sebuah hadits Rasulullah shallallahu 'alaihi wasallam, maka jika aku jatuh dari langit lebih aku sukai dari pada aku harus berdusta. Dan jika aku berbicara tentang suatu permasalahan yang terjadi antara aku dengan kalian, maka sesungguhnya peperangan itu penuh dengan tipu daya. Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pada akhir zaman nanti akan muncul suatu kaum yang usianya masih muda, namun cita-cita mereka gila. Mereka berbicara berdasarkan perkataan manusia yang paling baik (Muhammad shallallahu 'alaihi wasallam). Tetapi mereka keluar dari Islam seperti keluarnya anak panah dari busurnya. Keimanan mereka tidak melampaui kerongkongan, maka dimanapun kalian mendapati mereka bunuhlah mereka. Sebab membunuh mereka akan diberi pahala pada hari kiamat.\""
            },
            {
                "number": 4139,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ قَالَ أَخْبَرَنِي زَيْدُ بْنُ وَهْبٍ الْجُهَنِيُّأَنَّهُ كَانَ فِي الْجَيْشِ الَّذِينَ كَانُوا مَعَ عَلِيٍّ عَلَيْهِ السَّلَام الَّذِينَ سَارُوا إِلَى الْخَوَارِجِ فَقَالَ عَلِيٌّ عَلَيْهِ السَّلَامأَيُّهَا النَّاسُ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يَخْرُجُ قَوْمٌ مِنْ أُمَّتِي يَقْرَءُونَ الْقُرْآنَ لَيْسَتْ قِرَاءَتُكُمْ إِلَى قِرَاءَتِهِمْ شَيْئًا وَلَا صَلَاتُكُمْ إِلَى صَلَاتِهِمْ شَيْئًا وَلَا صِيَامُكُمْ إِلَى صِيَامِهِمْ شَيْئًا يَقْرَءُونَ الْقُرْآنَ يَحْسِبُونَ أَنَّهُ لَهُمْ وَهُوَ عَلَيْهِمْ لَا تُجَاوِزُ صَلَاتُهُمْ تَرَاقِيَهُمْ يَمْرُقُونَ مِنْ الْإِسْلَامِ كَمَا يَمْرُقُ السَّهْمُ مِنْ الرَّمِيَّةِ لَوْ يَعْلَمُ الْجَيْشُ الَّذِينَ يُصِيبُونَهُمْ مَا قُضِيَ لَهُمْ عَلَى لِسَانِ نَبِيِّهِمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَنَكَلُوا عَنْ الْعَمَلِ وَآيَةُ ذَلِكَ أَنَّ فِيهِمْ رَجُلًا لَهُ عَضُدٌ وَلَيْسَتْ لَهُ ذِرَاعٌ عَلَى عَضُدِهِ مِثْلُ حَلَمَةِ الثَّدْيِ عَلَيْهِ شَعَرَاتٌ بِيضٌأَفَتَذْهَبُونَ إِلَى مُعَاوِيَةَ وَأَهْلِ الشَّامِ وَتَتْرُكُونَ هَؤُلَاءِ يَخْلُفُونَكُمْ فِي ذَرَارِيِّكُمْ وَأَمْوَالِكُمْ وَاللَّهِ إِنِّي لَأَرْجُو أَنْ يَكُونُوا هَؤُلَاءِ الْقَوْمَ فَإِنَّهُمْ قَدْ سَفَكُوا الدَّمَ الْحَرَامَ وَأَغَارُوا فِي سَرْحِ النَّاسِ فَسِيرُوا عَلَى اسْمِ اللَّهِ قَالَ سَلَمَةُ بْنُ كُهَيْلٍ فَنَزَّلَنِي زَيْدُ بْنُ وَهْبٍ مَنْزِلًا مَنْزِلًا حَتَّى مَرَّ بِنَا عَلَى قَنْطَرَةٍ قَالَ فَلَمَّا الْتَقَيْنَا وَعَلَى الْخَوَارِجِ عَبْدُ اللَّهِ بْنُ وَهْبٍ الرَّاسِبِيُّ فَقَالَ لَهُمْ أَلْقُوا الرِّمَاحَ وَسُلُّوا السُّيُوفَ مِنْ جُفُونِهَا فَإِنِّي أَخَافُ أَنْ يُنَاشِدُوكُمْ كَمَا نَاشَدُوكُمْ يَوْمَ حَرُورَاءَ قَالَ فَوَحَّشُوا بِرِمَاحِهِمْ وَاسْتَلُّوا السُّيُوفَ وَشَجَرَهُمْ النَّاسُ بِرِمَاحِهِمْ قَالَ وَقَتَلُوا بَعْضَهُمْ عَلَى بَعْضِهِمْ قَالَ وَمَا أُصِيبَ مِنْ النَّاسِ يَوْمَئِذٍ إِلَّا رَجُلَانِ فَقَالَ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُ الْتَمِسُوا فِيهِمْ الْمُخْدَجَ فَلَمْ يَجِدُوا قَالَ فَقَامَ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُ بِنَفْسِهِ حَتَّى أَتَى نَاسًا قَدْ قُتِلَ بَعْضُهُمْ عَلَى بَعْضٍ فَقَالَ أَخْرِجُوهُمْ فَوَجَدُوهُ مِمَّا يَلِي الْأَرْضَ فَكَبَّرَ وَقَالَ صَدَقَ اللَّهُ وَبَلَّغَ رَسُولُهُ فَقَامَ إِلَيْهِ عَبِيدَةُ السَّلْمَانِيُّ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ وَاللَّهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ لَقَدْ سَمِعْتَ هَذَا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِي وَاللَّهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ حَتَّى اسْتَحْلَفَهُ ثَلَاثًا وَهُوَ يَحْلِفُ حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ جَمِيلِ بْنِ مُرَّةَ قَالَ حَدَّثَنَا أَبُو الْوَضِيءِ قَالَ قَالَ عَلِيٌّ عَلَيْهِ السَّلَام اطْلُبُوا الْمُخْدَجَ فَذَكَرَ الْحَدِيثَ فَاسْتَخْرَجُوهُ مِنْ تَحْتِ الْقَتْلَى فِي طِينٍ قَالَ أَبُو الْوَضِيءِ فَكَأَنِّي أَنْظُرُ إِلَيْهِ حَبَشِيٌّ عَلَيْهِ قُرَيْطِقٌ لَهُ إِحْدَى يَدَيْنِ مِثْلُ ثَدْيِ الْمَرْأَةِ عَلَيْهَا شُعَيْرَاتٌ مِثْلُ شُعَيْرَاتِ الَّتِي تَكُونُ عَلَى ذَنَبِ الْيَرْبُوعِ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali] berkata, telah menceritakan kepada kami [Abdurrazaq] dari [Abdul Malik bin Abu Sulaiman] dari [Salamah bin Kuhail] ia berkata; telah mengabarkan kepadaku [Zaid bin Wahb Al Juhani] Bahwasanya ia pernah bergabung dengan pasukan [Ali radliallahu 'anhu] yang menuju kaum Khawarij. Ali lalu berkata, \"Wahai manusia sekalian, aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Akan keluar sekelompok orang dari umatku, mereka membaca Al-Qur'an, dan bacaan kalian terhadap Al-Qur'an tidak sebanding dengan bacaan mereka, shalat kalian tidak sebanding dengan shalat mereka, dan puasa kalian tidak sebanding dengan puasa mereka sedikit pun. Mereka membaca Al-Qur'an dan menyangka bahwa bacaan itu baik untuk mereka, padahal bacaan mereka itu akan menjadi madharat bagi mereka. shalat mereka tidak melebihi kerongkongan mereka. Mereka keluar dari Islam seperti anak panah keluar dari busurnya. Sekiranya pasukan yang memerangi mereka mengetahui keutamaan memerangi mereka, sungguh mereka akan bermalas-malas untuk beramal (setelah memerangi mereka). Ciri-cirinya, di antara mereka ada seorang laki-laki yang mempunyai lengan tetapi tidak mempunyai siku (gemuk dan banyak dagingnya), pada panggal lengannya seperti buah dada dan berambut putih. Apakah kalian akan pergi kepada Mu'awiyah dan penduduk Syam, lalu kalian tinggalkan mereka bersama keluarga dan harta kalian? Demi Allah, sungguh aku sangat menginginkan mereka (memerangi). Sebab mereka telah menumpahkan darah yang diharamkan dan merampas hak manusia. Maka berjalanlah dengan nama Allah.\" -Salamah bin Kuhail berkata; \"Maka Zaid bin Wahab menunjukkan (menyebutkan) kepadaku tempat-tempat yang mereka lalui satu persatu hingga ketika sampai pada sebuah jembatan kami bertemu dengan orang-orang khawarij yang dipimpin oleh Abdullah bin Wahab Ar Rasibi, maka Ali berkata kepada mereka (kaum muslimin); \"Lemparkanlah tombak-tombak kalian dan hunuslah pedang kalian dari sarungnya, karena sesungguhnya aku khawatir jika mereka menuntut perdamaian pada kalian sebagaimana mereka menuntut perdamaian pada kalian di hari Harura, (sehingga setelah itu mereka membangun kekuatan untuk memerangi kaum muslimin), akhirnya pasukan kaum muslimin melemparkan tombak-tombak mereka, dan menghunuskan pedang serta menikam orang-orang khawarij dengan tombak mereka\", Zaid bin Wahab berkata; \"hingga sebagian (kaum muslimin) dapat membunuh sebagian (orang-orang khawarij) \", Zaid Wahab melanjutkan; \"pada waktu itu yang terbunuh dari kaum muslimin hanya dua orang, lalu Ali radliallahu 'anhu berkata; \"carilah di antara mereka Al Mukhdaj\", namun mereka tidak mendapatkannya, Zaid berkata; \"akhirnya Ali berdiri sendiri untuk mencarinya hingga ia sampai pada tumpukan mayat yang saling terbunuh\", Ali berkata; \"Keluarkanlah mereka\", maka akhirnya ia mendapatkan Al Mukhdaj dalam pendaman tanah, ia lantas bertakbir dan berkata; \"Maha benar Allah dan Rasul-Nya yang telah menyampaikannya (tentang informasi kejadian tersebut) \", lalu Abidah As Salmani mendekatinya dan berkata; \"Wahai Amirul mukminin, demi Allah yang tiada Ilah selain Dia, apakah engkau telah mendengar ini dari Rasulullah shallallahu 'alaihi wasallam, Ali berkata; \"Iya, demi Allah yang tiada Ilah selain Dia\", hingga Abidah memintanya untuk bersumpah tiga kali dan Ali pun bersumpah kepadanya tiga kali. telah menceritakan kepada kami [Muhammad bin Ubaid] berkata telah menceritakan kepada kami [Hammad bin Zaid] dari [Jamil bin Murrah] ia berkata; telah menceritakan kepada kami [Abu Al Wadhi`] berkata; Ali 'alahis salam berkata; \"carilah Al Mukhdaj … -lalu ia menyebutkan redaksi hadits- maka mereka mengeluarkannya dari bawah tumpukan mayat di bawah gundukan tanah, Abu Al Wadhi` berkata; \"seakan akan aku melihatnya (Al Mukhdaj) adalah seorang habasyah yang mengenakakan qiba' (sejenis pakaian luar, jaket atau rompi) salah satu tangannya kecil seperti buah dada perempuan yang memiliki bulu bulu kecil seperti bulu yang terdapat pada ekor yarbu' (binatang sejenis tupai).\""
            },
            {
                "number": 4140,
                "arab": "حَدَّثَنَا بِشْرُ بْنُ خَالِدٍ حَدَّثَنَا شَبَابَةُ بْنُ سَوَّارٍ عَنْ نُعَيْمِ بْنِ حَكِيمٍ عَنْ أَبِي مَرْيَمَ قَالَإِنْ كَانَ ذَلِكَ الْمُخْدَجُ لَمَعَنَا يَوْمَئِذٍ فِي الْمَسْجِدِ نُجَالِسُهُ بِاللَّيْلِ وَالنَّهَارِ وَكَانَ فَقِيرًا وَرَأَيْتُهُ مَعَ الْمَسَاكِينِ يَشْهَدُ طَعَامَ عَلِيٍّ عَلَيْهِ السَّلَام مَعَ النَّاسِ وَقَدْ كَسَوْتُهُ بُرْنُسًا لِي قَالَ أَبُو مَرْيَمَ وَكَانَ الْمُخْدَجُ يُسَمَّى نَافِعًا ذَا الثُّدَيَّةِ وَكَانَ فِي يَدِهِ مِثْلُ ثَدْيِ الْمَرْأَةِ عَلَى رَأْسِهِ حَلَمَةٌ مِثْلُ حَلَمَةِ الثَّدْيِ عَلَيْهِ شُعَيْرَاتٌ مِثْلُ سِبَالَةِ السِّنَّوْرِ قَالَ أَبُو دَاوُد وَهُوَ عِنْدَ النَّاسِ اسْمُهُ حَرْقُوسُ",
                "id": "Telah menceritakan kepada kami [Bisyr bin Khalid] berkata, telah menceritakan kepada kami [Syababah bin Sawwar] dari [Nu'aim bin Hakim] dari [Abu Maryam] ia berkata, \"Ada seseorang yang pendek bersama kami dalam masjid, kami selalu duduk bersamanya baik di waktu siang maupun malam. Dia seorang yang fakir, aku juga melihatnya bergabung dengan orang-orang miskin menghadiri jamuan Ali radliallahu 'anhu bersama orang banyak. Aku memberinya burnus (sejenis mantel yang bertudung).\" Abu Maryam melanjutkan, \"Laki-laki pendek itu biasa dipanggil dengan nama Nafi', pemilik dua buah dada, tangannya seperti dada perempuan, dan pada panggal lengannya seperti puting susu yang ditumbuhi bulu seperti bulu kucing.\" Abu Dawud berkata, \"Bagi orang-orang ia biasa dipanggil dengan nama Harqus.\""
            },
            {
                "number": 4141,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ حَسَنٍ قَالَ حَدَّثَنِي عَمِّي إِبْرَاهِيمُ بْنُ مُحَمَّدِ بْنِ طَلْحَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍوعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أُرِيدَ مَالُهُ بِغَيْرِ حَقٍّ فَقَاتَلَ فَقُتِلَ فَهُوَ شَهِيدٌ",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Yahya] dari [Sufyan] ia berkata; telah menceritakan kepadaku [Abdullah bin Hasan] ia berkata; telah menceritakan kepadaku pamanku [Ibrahim bin Muhammad bin Thalhah] dari [Abdullah bin Amru] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Siapa yang hartanya akan dirampas tanpa hak, lalu ia melawan dan terbunuh maka ia syahid.\""
            },
            {
                "number": 4142,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ وَسُلَيْمَانُ بْنُ دَاوُدَ يَعْنِي أَبَا أَيُّوبَ الْهَاشِمِيَّ عَنْ إِبْرَاهِيمَ بْنِ سَعْدٍ عَنْ أَبِيهِ عَنْ أَبِي عُبَيْدَةَ بْنِ مُحَمَّدِ بْنِ عَمَّارِ بْنِ يَاسِرٍ عَنْ طَلْحَةَ بْنِ عَبْدِ اللَّهِ بْنِ عَوْفٍ عَنْ سَعِيدِ بْنِ زَيْدٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قُتِلَ دُونَ مَالِهِ فَهُوَ شَهِيدٌ وَمَنْ قُتِلَ دُونَ أَهْلِهِ أَوْ دُونَ دَمِهِ أَوْ دُونَ دِينِهِ فَهُوَ شَهِيدٌ",
                "id": "Telah menceritakan kepada kami [Harun bin Abdullah] berkata, telah menceritakan kepada kami [Abu Dawud Ath Thayalisi] dan [Sulaiman bin Dawud] -maksudnya Sulaiman Abu Ayyub Al Hasyimi- dari [Ibrahim bin Sa'd] dari [Bapaknya] dari [Abu Ubaidah bin Muhammad bin Ammar bin Yasir] dari [Thalhah bin Abdullah] dari [Sa'id bin Zaid] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Siapa yang dibunuh karena membela hartanya maka ia syahid, siapa yang dibunuh karena membela keluarganya maka ia syahid, atau karena membela darahnya, atau karena membela agamanya maka ia syahid.\""
            }
  ]
}