{
    "kategori": "Kitab Sembelihan",
  "hadits": [
    {
                "number": 2406,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَزِيدُ ح و حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ حَدَّثَنَا بِشْرٌ عَنْ عَبْدِ اللَّهِ بْنِ عَوْنٍ عَنْ عَامِرٍ أَبِي رَمْلَةَ قَالَ أَخْبَرَنَا مِخْنَفُ بْنُ سُلَيْمٍ قَالَوَنَحْنُ وُقُوفٌ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعَرَفَاتٍ قَالَ يَا أَيُّهَا النَّاسُ إِنَّ عَلَى كُلِّ أَهْلِ بَيْتٍ فِي كُلِّ عَامٍ أُضْحِيَّةً وَعَتِيرَةً أَتَدْرُونَ مَا الْعَتِيرَةُ هَذِهِ الَّتِي يَقُولُ النَّاسُ الرَّجَبِيَّةُقَالَ أَبُو دَاوُد الْعَتِيرَةُ مَنْسُوخَةٌ هَذَا خَبَرٌ مَنْسُوخٌ",
                "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Yazid], dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Humaid bin Mas'adah], telah menceritakan kepada kami [Bisyr] dari [Abdullah bin 'Aun] dari ['Amir Abu Ramlah], ia berkata; telah mengabarkan kepada kami [Mikhnaf bin Sulaim], ketika kami sedang berwukuf bersama Rasulullah shallallahu 'alaihi wasallam di 'Arafah beliau berkata: \"Wahai umat manusia, sesungguhnya kewajiban setiap penghuni rumah pada setiap tahun untuk menyembelih kurban serta 'atirah, tahukah kalian apakah 'atirah? Yaitu yang orang-orang menyebutnya rajabiyyah (menyembelih hewan pada sepuluh hari pertama).\" Abu Daud berkata; 'atirah telah dihapuskan dan hadits ini adalah hadits yang telah terhapus. "
            },
            {
                "number": 2407,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ حَدَّثَنِي سَعِيدُ بْنُ أَبِي أَيُّوبَ حَدَّثَنِي عَيَّاشُ بْنُ عَبَّاسٍ الْقِتْبَانِيُّ عَنْ عِيسَى بْنِ هِلَالٍ الصَّدَفِيِّ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أُمِرْتُ بِيَوْمِ الْأَضْحَى عِيدًا جَعَلَهُ اللَّهُ عَزَّ وَجَلَّ لِهَذِهِ الْأُمَّةِ قَالَ الرَّجُلُ أَرَأَيْتَ إِنْ لَمْ أَجِدْ إِلَّا أُضْحِيَّةً أُنْثَى أَفَأُضَحِّي بِهَا قَالَ لَا وَلَكِنْ تَأْخُذُ مِنْ شَعْرِكَ وَأَظْفَارِكَ وَتَقُصُّ شَارِبَكَ وَتَحْلِقُ عَانَتَكَ فَتِلْكَ تَمَامُ أُضْحِيَّتِكَ عِنْدَ اللَّهِ عَزَّ وَجَلَّ",
                "id": "Telah menceritakan kepada kami [Harun bin Abdullah], telah menceritakan kepada kami [Abdullah bin Yazid], telah menceritakan kepadaku [Sa'id bin Abu Ayyub], telah menceritakan kepadaku ['Ayyasy bin 'Abbas Al Qatbani], dari [Isa bin Hilal Ash Shudafi], dari [Abdullah bin 'Amr bin Al 'Ash], bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Aku diperintahkan pada hari Kurban untuk menjadikannya sebagai hari raya, Allah 'azza wajalla telah menjadikannya untuk umat ini.\" Seseorang berkata; bagaimana pendapat anda jika aku hanya mendapatkan hewan kurban betina? Apakah aku boleh berkurban dengannya? Beliau berkata: \"Tidak, akan tetapi engkau ambil sebagian rambutmu dan kukumu, serta engkau gunting kumismu dan engkau cukur bulu kemaluanmu. Maka itulah kurbanmu yang sempurna di sisi Allah 'azza wajalla.\""
            },
            {
                "number": 2408,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا شَرِيكٌ عَنْ أَبِي الْحَسْنَاءِ عَنْ الْحَكَمِ عَنْ حَنَشٍ قَالَرَأَيْتُ عَلِيًّا يُضَحِّي بِكَبْشَيْنِ فَقُلْتُ لَهُ مَا هَذَا فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْصَانِي أَنْ أُضَحِّيَ عَنْهُ فَأَنَا أُضَحِّي عَنْهُ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah], telah menceritakan kepada kami [Syarik] dari [Abu Al Hasna`] dari [Al Hakam] dari [Hanasy], ia berkata; aku melihat [Ali] berkurban dengan dua kambing. Kemudian aku katakan kepadanya; apa ini? Lalu ia berkata; sesungguhnya Rasulullah shallallahu 'alaihi wasallam telah berwasiat kepadaku agar berkurban untuknya, maka aku berkurban untuknya. "
            },
            {
                "number": 2409,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو حَدَّثَنَا عَمْرُو بْنُ مُسْلِمٍ اللَّيْثِيُّ قَالَ سَمِعْتُ سَعِيدَ بْنَ الْمُسَيِّبِ يَقُولُ سَمِعْتُ أُمَّ سَلَمَةَ تَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَانَ لَهُ ذِبْحٌ يَذْبَحُهُ فَإِذَا أَهَلَّ هِلَالُ ذِي الْحِجَّةِ فَلَا يَأْخُذَنَّ مِنْ شَعْرِهِ وَلَا مِنْ أَظْفَارِهِ شَيْئًا حَتَّى يُضَحِّيَقَالَ أَبُو دَاوُد اخْتَلَفُوا عَلَى مَالِكٍ وَعَلَى مُحَمَّدِ بْنِ عَمْرٍو فِي عَمْرِو بْنِ مُسْلِمٍ قَالَ بَعْضُهُمْ عُمَرُ وَأَكْثَرُهُمْ قَالَ عَمْرٌو قَالَ أَبُو دَاوُد وَهُوَ عَمْرُو بْنُ مُسْلِمِ بْنِ أُكَيْمَةَ اللَّيْثِيُّ الْجُنْدُعِيُّ",
                "id": "Telah menceritakan kepada kami ['Ubaidullah bin Mu'adz], telah menceritakan kepada kami [ayahku], telah menceritakan kepada kami [Muhammad bin 'Amr], telah menceritakan kepada kami ['Amr bin Muslim Al Laitsi], ia berkata; saya mendengar [Sa'id bin Al Musayyab] berkata; saya mendengar [Ummu Salamah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang memiliki hewan sembelihan yang akan ia sembelih, apabila telah muncul hilal Bulan Dzul Hijjah maka janganlah ia mengambil sedikitpun dari rambut, serta kukunya hingga ia menyembelih.\" Abu Daud berkata; mereka menyelisihi Malik dan Muhammad bin 'Amr mengenai 'Amr bin Muslim. Sebagian mereka berkata; ia adalah Umar, dan kebanyakan mereka mengatakan; 'Amr. Abu Daud berkata; ia adalah 'Amr bin Muslim bin Ukaimah Al Laitsi Al Jundu'i. "
            },
            {
                "number": 2410,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي حَيْوَةُ حَدَّثَنِي أَبُو صَخْرٍ عَنْ ابْنِ قُسَيْطٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِكَبْشٍ أَقْرَنَ يَطَأُ فِي سَوَادٍ وَيَنْظُرُ فِي سَوَادٍ وَيَبْرُكُ فِي سَوَادٍ فَأُتِيَ بِهِ فَضَحَّى بِهِ فَقَالَ يَا عَائِشَةُ هَلُمِّي الْمُدْيَةَ ثُمَّ قَالَ اشْحَذِيهَا بِحَجَرٍ فَفَعَلَتْ فَأَخَذَهَا وَأَخَذَ الْكَبْشَ فَأَضْجَعَهُ وَذَبَحَهُ وَقَالَ بِسْمِ اللَّهِ اللَّهُمَّ تَقَبَّلْ مِنْ مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَمِنْ أُمَّةِ مُحَمَّدٍ ثُمَّ ضَحَّى بِهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih], telah menceritakan kepada kami [Abdullah bin Wahb], telah mengabarkan kepadaku [Haiwah], telah menceritakan kepadaku [Abu Shakhr] dari [Ibnu Qusaith] dari ['Urwah bin Az Zubair] dari [Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam memerintahkan untuk menyembelih domba yang bertanduk, berkaki hitam, sekitar matanya hitam, dan perutnya hitam. Kemudian beliau diberi kambing seperti itu, lalu beliau berkurban dengannya. Beliau berkata: \"Wahai Aisyah, berikan pisau.\" Kemudian beliau berkata: \"Tajamkan pisau tersebut dengan batu!\" kemudian ia melakukannya, lalu Rasulullah shallallahu 'alaihi wasallam mengambilnya dan mengambil domba tersebut serta membaringkan dan menyembelihnya. Beliau mengucapkan: \"BISMILLAAH, ALLAAHUMMA TAQABBAL MIN MUHAMMADIN WA AALI MUHAMMAD, WA MIN UMMATI MUHAMMAD (Dengan nama Allah, ya Allah, terimalah dari Muhammad dan keluarga Muhammad serta Ummat Muhammad). Kemudian beliau shallallahu 'alaihi wasallam berkurban dengannya. "
            },
            {
                "number": 2411,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا وَهْبٌ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحَرَ سَبْعَ بَدَنَاتٍ بِيَدِهِ قِيَامًا وَضَحَّى بِالْمَدِينَةِ بِكَبْشَيْنِ أَقْرَنَيْنِ أَمْلَحَيْنِ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Wahb] dari [Ayyub], dari [Abu Qilabah], dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam menyembelih tujuh unta dengan tangannya dalam keadaan berdiri, dan beliau di Madinah berkurban dengan dua domba yang bertanduk dan berwarna abu-Abu. "
            },
            {
                "number": 2412,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هِشَامٌ عَنْ قَتَادَةَ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَحَّى بِكَبْشَيْنِ أَقْرَنَيْنِ أَمْلَحَيْنِ يَذْبَحُ وَيُكَبِّرُ وَيُسَمِّي وَيَضَعُ رِجْلَهُ عَلَى صَفْحَتِهِمَا",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim], telah menceritakan kepada kami [Hisyam] dari [Qatadah] dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam berkurban dengan dua domba yang bertanduk dan berwarna abu-Abu. Beliau menyembelih, bertakbir dan membaca bismilah, serta beliau meletakkan kakinya di atas sebelah kepalanya. "
            },
            {
                "number": 2413,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ حَدَّثَنَا عِيسَى حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ أَبِي عَيَّاشٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَذَبَحَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الذَّبْحِ كَبْشَيْنِ أَقْرَنَيْنِ أَمْلَحَيْنِ مُوجَأَيْنِ فَلَمَّا وَجَّهَهُمَا قَالَ إِنِّي وَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّمَوَاتِ وَالْأَرْضَ عَلَى مِلَّةِ إِبْرَاهِيمَ حَنِيفًا وَمَا أَنَا مِنْ الْمُشْرِكِينَ إِنَّ صَلَاتِي وَنُسُكِي وَمَحْيَايَ وَمَمَاتِي لِلَّهِ رَبِّ الْعَالَمِينَ لَا شَرِيكَ لَهُ وَبِذَلِكَ أُمِرْتُ وَأَنَا مِنْ الْمُسْلِمِينَ اللَّهُمَّ مِنْكَ وَلَكَ وَعَنْ مُحَمَّدٍ وَأُمَّتِهِ بِاسْمِ اللَّهِ وَاللَّهُ أَكْبَرُ ثُمَّ ذَبَحَ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Musa Ar Razi], telah menceritakan kepada kami [Isa], telah menceritakan kepada kami [Muhammad bin Ishaq], dari [Yazid bin Abu Habib], dari [Abu 'Ayyasy] dari [Jabir bin Abdullah], ia berkata; Nabi shallallahu 'alaihi wasallam pada hari Kurban menyembelih dua domba yang bertanduk dan berwarna abu-abu yang terkebiri. Kemudian tatkala beliau telah menghadapkan keduanya beliau mengucapkan: \"INNII WAJJAHTU WAJHIYA LILLADZII FATHARAS SAMAAWAATI WAL ARDHA 'ALAA MILLATI IBRAAHIIMA HANIIFAN WA MAA ANA MINAL MUSYRIKIIN, INNA SHALAATII WA NUSUKII WA MAHYAAYA WA MAMAATII LILLAAHI RABBIL 'AALAMIIN, LAA SYARIIKA LAHU WA BIDZAALIKA UMIRTU WA ANA MINAL MUSLIMIIN. ALLAAHUMMA MINKA WA LAKA WA 'AN MUHAMMADIN WA UMMATIHI. BISMILLAAHI WALLAHU AKBAR\" (Sesungguhnya aku telah menghadapkan wajahku kepada Dzat yang telah menciptakan langit dan bumi di atas agama Ibrahim dengan lurus, dan aku bukan termsuk orang-orang yang berbuat syirik. Sesungguhnya shalatku, dan sembelihanku serta hidup dan matiku adalah untuk Allah Tuhan semesta alam, tidak ada sekutu bagiNya, dengan itu aku diperintahkan, dan aku termasuk orang-orang yang berserah diri. Ya Allah, ini berasal dariMu dan untukMu, dari Muhammad dan ummatnya. Dengan Nama Allah, dan Allah Maha Besar). "
            },
            {
                "number": 2414,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ مَعِينٍ حَدَّثَنَا حَفْصٌ عَنْ جَعْفَرٍ عَنْ أَبِيهِ عَنْ أَبِي سَعِيدٍ قَالَكَانَ رَسُولُ اللَّهِ يُضَحِّي صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِكَبْشٍ أَقْرَنَ فَحِيلٍ يَنْظُرُ فِي سَوَادٍ وَيَأْكُلُ فِي سَوَادٍ وَيَمْشِي فِي سَوَادٍ",
                "id": "Telah menceritakan kepada kami [Yahya bin Ma'in], telah menceritakan kepada kami [Hafsh] dari [Ja'far], dari [ayahnya], dari [Abu Sa'id], ia berkata; Rasulullah shallallahu 'alaihi wasallam berkurban dengan seekor domba yang bertanduk yang sempurna tubuhnya, sekitar matanya hitam, dan perutnya hitam, serta berkaki hitam. "
            },
            {
                "number": 2415,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي شُعَيْبٍ الْحَرَّانِيُّ حَدَّثَنَا زُهَيْرُ بْنُ مُعَاوِيَةَ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَذْبَحُوا إِلَّا مُسِنَّةً إِلَّا أَنْ يَعْسُرَ عَلَيْكُمْ فَتَذْبَحُوا جَذَعَةً مِنْ الضَّأْنِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abu Syu'aib Al Harrani], telah menceritakan kepada kami [Zuhair bin Mu'awiyah], telah menceritakan kepada kami [Abu Az Zubair] dari [Jabir], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian menyembelih kecuali domba yang berumur tiga tahun, kecuali kalian kesulitan mendapatkannya maka sembelihlah domba yang berumur satu tahun.\""
            },
            {
                "number": 2416,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ صُدْرَانَ حَدَّثَنَا عَبْدُ الْأَعْلَى بْنُ عَبْدِ الْأَعْلَى حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ حَدَّثَنِي عُمَارَةُ بْنُ عَبْدِ اللَّهِ بْنِ طُعْمَةَ عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ قَالَقَسَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي أَصْحَابِهِ ضَحَايَا فَأَعْطَانِي عَتُودًا جَذَعًا قَالَ فَرَجَعْتُ بِهِ إِلَيْهِ فَقُلْتُ لَهُ إِنَّهُ جَذَعٌ قَالَ ضَحِّ بِهِ فَضَحَّيْتُ بِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Shudran], telah menceritakan kepada kami [Abdul A'la bin Abdul A'la], telah menceritakan kepada kami [Muhammad bin Ishaq], telah menceritakan kepadaku ['Umarah bin Abdullah bin Thu'mah], dari [Sa'id bin Al Musayyab], dari [Zaid bin Khalid Al Juhani], ia berkata; Rasulullah shallallahu 'alaihi wasallam membagikan kurban beliau kepada para sahabatnya, beliau memberiku kambing kecil yang berumur satu tahun. Kemudian aku membawanya kembali kepada beliau dan aku katakan kepadanya; kambing itu adalah kambing yang berumur satu tahun. Kemudian beliau berkata: \"Berkurbanlah dengannya!\" kemudian aku berkurban dengannya. "
            },
            {
                "number": 2417,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا الثَّوْرِيُّ عَنْ عَاصِمِ بْنِ كُلَيْبٍ عَنْ أَبِيهِ قَالَكُنَّا مَعَ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَالُ لَهُ مُجَاشِعٌ مِنْ بَنِي سُلَيْمٍ فَعَزَّتْ الْغَنَمُ فَأَمَرَ مُنَادِيًا فَنَادَى أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ إِنَّ الْجَذَعَ يُوَفِّي مِمَّا يُوَفِّي مِنْهُ الثَّنِيُّقَالَ أَبُو دَاوُد وَهُوَ مُجَاشِعُ بْنُ مَسْعُودٍ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali], telah menceritakan kepada kami [Abdurrazzaq], telah menceritakan kepada kami [Ats Tsauri] dari ['Ashim bin Kulaib], dari [ayahnya], ia berkata; kami pernah bersama seorang sahabat Nabi shallallahu 'alaihi wasallam yang bernama [Mujasyi'] dari Bani Sulaim. Dan jumlah kambing sedikit. Kemudian ia memerintahkan seseorang untuk menyeru bahwa Rasulullah shallallahu 'alaihi wasallam berkata: \"Sesungguhnya kambing yang berumur satu tahun adalah cukup sebagaimana yang genap dua tahun masuk tiga tahun.\" Abu Daud berkata; ia adalah Mujasyi' bin Mas'ud. "
            },
            {
                "number": 2418,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو الْأَحْوَصِ حَدَّثَنَا مَنْصُورٌ عَنْ الشَّعْبِيِّ عَنْ الْبَرَاءِ قَالَخَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ النَّحْرِ بَعْدَ الصَّلَاةِ فَقَالَ مَنْ صَلَّى صَلَاتَنَا وَنَسَكَ نُسُكَنَا فَقَدْ أَصَابَ النُّسُكَ وَمَنْ نَسَكَ قَبْلَ الصَّلَاةِ فَتِلْكَ شَاةُ لَحْمٍ فَقَامَ أَبُو بُرْدَةَ بْنُ نِيَارٍ فَقَالَ يَا رَسُولَ اللَّهِ وَاللَّهِ لَقَدْ نَسَكْتُ قَبْلَ أَنْ أَخْرُجَ إِلَى الصَّلَاةِ وَعَرَفْتُ أَنَّ الْيَوْمَ يَوْمُ أَكْلٍ وَشُرْبٍ فَتَعَجَّلْتُ فَأَكَلْتُ وَأَطْعَمْتُ أَهْلِي وَجِيرَانِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تِلْكَ شَاةُ لَحْمٍ فَقَالَ إِنَّ عِنْدِي عَنَاقًا جَذَعَةً وَهِيَ خَيْرٌ مِنْ شَاتَيْ لَحْمٍ فَهَلْ تُجْزِئُ عَنِّي قَالَ نَعَمْ وَلَنْ تُجْزِئَ عَنْ أَحَدٍ بَعْدَكَ",
                "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Abu Al Ahwash], telah menceritakan kepada kami [Manshur], dari [Asy Sya'bi], dari [Al Bara`], ia berkata; Rasulullah shallallahu 'alaihi wasallam berkhutbah kepada kami pada hari penyembelihan ('idul Adhha) setelah melakukan shalat. Beliau berkata: \"Barangsiapa yang melakukan shalat seperti shalat kami dan menyembelih sembelihan kami maka sungguh ia telah telah melakukan kurban, dan barang siapa yang menyembelih sebelum shalat maka hal itu adalah kambing daging (untuk dimakan dagingnya saja).\" Kemudian Abu Burdah bin Diyar berdiri dan berkata; wahai Rasulullah, aku telah menyembelih sebelum keluar untuk melakukan shalat, dan aku telah mengetahui bahwa hari ini adalah hari makan dan minum, maka aku segerekan penyembelihan tersebut, lalu aku makan dan memberi makan keluarga serta tetanggaku. Lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Itu adalah kambing untuk dimakan dagingnya saja.\" Kemudian beliau bersabda: \"Sesungguhnya bagiku kambing yang berumur satu tahun lebih baik daripada dua kambing daging (yang dimakan dagingnya saja).\" Al Bara` berkata: \"Apakah sah bagiku? Ia berkata; ya. Dan tidak sah untuk seorang pun setelahmu.\""
            },
            {
                "number": 2419,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا خَالِدٌ عَنْ مُطَرِّفٍ عَنْ عَامِرٍ عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَضَحَّى خَالٌ لِي يُقَالُ لَهُ أَبُو بُرْدَةَ قَبْلَ الصَّلَاةِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَاتُكَ شَاةُ لَحْمٍ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ عِنْدِي دَاجِنًا جَذَعَةً مِنْ الْمَعْزِ فَقَالَ اذْبَحْهَا وَلَا تَصْلُحُ لِغَيْرِكَ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Khalid], dari [Mutharrif], dari ['Amir], dari [Al Bara` bin 'Azib], ia berkata; pamanku yang bernama Abu Burdah berkurban sebelum melakukan shalat. Kemudian Rasulullah shallallahu 'alaihi wasallam berkata kepadanya: \"Kambingmu adalah kambing daging (yang dimakan dagingnya saja).\""
            },
            {
                "number": 2420,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ النَّمَرِيُّ حَدَّثَنَا شُعْبَةُ عَنْ سُلَيْمَانَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عُبَيْدِ بْنِ فَيْرُوزَ قَالَسَأَلْتُ الْبَرَاءَ بْنَ عَازِبٍ مَا لَا يَجُوزُ فِي الْأَضَاحِيِّ فَقَالَ قَامَ فِينَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصَابِعِي أَقْصَرُ مِنْ أَصَابِعِهِ وَأَنَامِلِي أَقْصَرُ مِنْ أَنَامِلِهِ فَقَالَ أَرْبَعٌ لَا تَجُوزُ فِي الْأَضَاحِيِّ فَقَالَ الْعَوْرَاءُ بَيِّنٌ عَوَرُهَا وَالْمَرِيضَةُ بَيِّنٌ مَرَضُهَا وَالْعَرْجَاءُ بَيِّنٌ ظَلْعُهَا وَالْكَسِيرُ الَّتِي لَا تَنْقَى قَالَ قُلْتُ فَإِنِّي أَكْرَهُ أَنْ يَكُونَ فِي السِّنِّ نَقْصٌ قَالَ مَا كَرِهْتَ فَدَعْهُ وَلَا تُحَرِّمْهُ عَلَى أَحَدٍقَالَ أَبُو دَاوُد لَيْسَ لَهَا مُخٌّ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar An Namari], telah menceritakan kepada kami [Syu'bah] dari [Sulaiman bin Abdurrahman], dari ['Ubaid bin Fairuz], ia berkata; aku pernah bertanya kepada [Al Bara` bin 'Azib]; sesuatu apakah yang tidak diperbolehkan dalam hewan kurban? Kemudian ia berkata; Rasulullah shallallahu 'alaihi wasallam pernah berdiri diantara kami, jari-jariku lebih pendek daripada jari-jarinya dan ruas-ruas jariku lebih pendek dari ruas-ruas jarinya, kemudian beliau berkata: \"Empat perkara yang tidak boleh ada di dalam hewan-hewan kurban.\" Kemudian belaiu berkata; yaitu; buta sebelah matanya yang jelas kebutaannya, pincang yang jelas pincangnya, sakit yang jelas sakitnya, dan pecah kakinya yang tidak memiliki sumsum. 'Ubaid berkata; aku katakan kepada Al Bara`; tidak suka pada giginya terdapat aib. Ia berkata; apa yang tidak engkau sukai maka tinggalkan dan janganlah engkau mengharamkannya kepada seseorang. Abu Daud berkata; tidak ada otak padanya. "
            },
            {
                "number": 2421,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ قَالَ أَخْبَرَنَا ح و حَدَّثَنَا عَلِيُّ بْنُ بَحْرِ بْنِ بَرِيٍّ حَدَّثَنَا عِيسَى الْمَعْنَى عَنْ ثَوْرٍ حَدَّثَنِي أَبُو حُمَيْدٍ الرُّعَيْنِيُّ أَخْبَرَنِي يَزِيدُ ذُو مِصْرَ قَالَأَتَيْتُ عُتْبَةَ بْنَ عَبْدٍ السُّلَمِيَّ فَقُلْتُ يَا أَبَا الْوَلِيدِ إِنِّي خَرَجْتُ أَلْتَمِسُ الضَّحَايَا فَلَمْ أَجِدْ شَيْئًا يُعْجِبُنِي غَيْرَ ثَرْمَاءَ فَكَرِهْتُهَا فَمَا تَقُولُ قَالَ أَفَلَا جِئْتَنِي بِهَا قُلْتُ سُبْحَانَ اللَّهِ تَجُوزُ عَنْكَ وَلَا تَجُوزُ عَنِّي قَالَ نَعَمْ إِنَّكَ تَشُكُّ وَلَا أَشُكُّ إِنَّمَا نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمُصْفَرَّةِ وَالْمُسْتَأْصَلَةِ وَالْبَخْقَاءِ وَالْمُشَيَّعَةِ وَكِسَرَا وَالْمُصْفَرَّةُ الَّتِي تُسْتَأْصَلُ أُذُنُهَا حَتَّى يَبْدُوَ سِمَاخُهَا وَالْمُسْتَأْصَلَةُ الَّتِي اسْتُؤْصِلَ قَرْنُهَا مِنْ أَصْلِهِ وَالْبَخْقَاءُ الَّتِي تُبْخَقُ عَيْنُهَا وَالْمُشَيَّعَةُ الَّتِي لَا تَتْبَعُ الْغَنَمَ عَجَفًا وَضَعْفًا وَالْكَسْرَاءُ الْكَسِيرَةُ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Musa Ar Razi], ia berkata; dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Ali bin Bahr bin Bari], telah menceritakan kepada kami [Isa] secara makna, dari [Tsaur], telah menceritakan kepadaku [Abu Humaid Ar Ru'aini], telah mengabarkan kepadaku [Yazid Dzu Mishr], ia berkata; aku datang kepada ['Utbah bin Abdussulami], kemudian aku katakan; wahai Abu Al Walid, sesungguhnya aku keluar mencari kurban, dan aku tidak mendapatkan sesuatu yang menarik bagiku selain tsarma` (yang telah tanggal gigi seri dan gigi taring). Lalu aku tidak menyukainya, maka bagaimana pendapatmu? Ia berkata; tidakkah engkau membawanya kepadaku? Aku katakan; subhanallah, tidak cukup bagimu dan tidak cukup bagiku? Ia berkata; ya. Karena engkau ragu dan aku tidak ragu. Sesungguhnya Rasulullah shallallahu 'alaihi wasallam hanya melarang dari mushfarrah, musta`shalah, bakhqa`, musyayya'ah dan kasra`. Mushfarrah adalah yang terpotong telinganya hingga nampak lubangnya, sedangkan musta`shalah adalah yang patah tanduknya pangkalnya, bakhqa` adalah yang buta matanya, dan musyayya'ah adalah yang kurus dan lemah, dan kasra` adalah yang retak (tulangnya)."
            },
            {
                "number": 2422,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا أَبُو إِسْحَقَ عَنْ شُرَيْحِ بْنِ النُّعْمَانِ وَكَانَ رَجُلَ صِدْقٍ عَنْ عَلِيٍّ قَالَأَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَسْتَشْرِفَ الْعَيْنَ وَالْأُذُنَيْنِ وَلَا نُضَحِّي بِعَوْرَاءَ وَلَا مُقَابَلَةٍ وَلَا مُدَابَرَةٍ وَلَا خَرْقَاءَ وَلَا شَرْقَاءَقَالَ زُهَيْرٌ فَقُلْتُ لِأَبِي إِسْحَقَ أَذَكَرَ عَضْبَاءَ قَالَ لَا قُلْتُ فَمَا الْمُقَابَلَةُ قَال يُقْطَعُ طَرَفُ الْأُذُنِ قُلْتُ فَمَا الْمُدَابَرَةُ قَالَ يُقْطَعُ مِنْ مُؤَخَّرِ الْأُذُنِ قُلْتُ فَمَا الشَّرْقَاءُ قَالَ تُشَقُّ الْأُذُنُ قُلْتُ فَمَا الْخَرْقَاءُ قَالَ تُخْرَقُ أُذُنُهَا لِلسِّمَةِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili], telah menceritakan kepada kami [Zuhair], telah menceritakan kepada kami [Abu Ishaq], dari [Syuraih bin An Nu'man], dan ia adalah orang yang jujur, dari [Ali], ia berkata; Rasulullah shallallahu 'alaihi wasallam memerintahkan kami agar memeriksa mata, dan telinga serta agar kami tidak berkurban dengan 'aura`, muqabalah, mudabarah, kharqa` dan syarqa`. Zuhair berkata; aku katakan kepada Abu Ishaq; apakah beliau menyebutkan 'Adhba`? ia berkata; tidak. Aku katakan; apakah Muqabalah? Ia berkata; yang terpotong ujung telingannya. Aku katakan; apakah mudabarah? Ia berkata; yang terpotong belakang telingannya. Aku katakan; apakah syarqa`? Ia berkata; yang telingannya sobek. Aku katakan; apakah kharqa`? Ia berkata; yang telinganya dilubangi sebagai tanda. "
            },
            {
                "number": 2423,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هِشَامُ بْنُ أَبِي عَبْدِ اللَّهِ الدَّسْتُوَائِيُّ وَيُقَالُ لَهُ هِشَامُ بْنُ سَنْبَرٍ عَنْ قَتَادَةَ عَنْ جُرَيِّ بْنِ كُلَيْبٍ عَنْ عَلِيٍّأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يُضَحَّى بِعَضْبَاءِ الْأُذُنِ وَالْقَرْنِقَالَ أَبُو دَاوُد جُرَيٌّ سَدُوسِيٌّ بَصْرِيٌّ لَمْ يُحَدِّثْ عَنْهُ إِلَّا قَتَادَةُ حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى حَدَّثَنَا هِشَامٌ عَنْ قَتَادَةَ قَالَ قُلْتُ لِسَعِيدِ بْنِ الْمُسَيِّبِ مَا الْأَعْضَبُ قَالَ النِّصْفُ فَمَا فَوْقَهُ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim], telah menceritakan kepada kami [Hisyam bin Abu Abdullah Ad Dastuwai], dan ia dipanggil Hisyam bin Sanbar, dari [Qatadah], dari [Jurai bin Kulaib], dari [Ali], bahwa Nabi shallallahu 'alaihi wasallam melarang berkurban dengan dengan hewan yang sobek telinganya dan pecah tanduknya. Abu Daud berkata; Jurai Sadusi Bashri tidak ada yang meriwayatkan darinya selain Qatadah. Telah menceritakan kepada kami Musaddad, telah menceritakan kepada kami Yahya, telah menceritakan kepada kami Hisyam dari Qatadah, ia berkata; aku katakan kepada Sa'id bin Al Musayyab, apakah a'dhab itu? Ia berkata; setengah atau lebih. "
            },
            {
                "number": 2424,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا هُشَيْمٌ حَدَّثَنَا عَبْدُ الْمَلِكِ عَنْ عَطَاءٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَكُنَّا نَتَمَتَّعُ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَذْبَحُ الْبَقَرَةَ عَنْ سَبْعَةٍ وَالْجَزُورَ عَنْ سَبْعَةٍ نَشْتَرِكُ فِيهَا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal], telah menceritakan kepada kami [Husyaim], telah menceritakan kepada kami [Abdul Malik], dari ['Atho`], dari [Jabir bin Abdullah], ia berkata; dahulu kami melakukan haji tamattu' pada zaman Rasulullah shallallahu 'alaihi wasallam, kami menyembelih sapi untuk tujuh orang dan unta untuk tujuh orang, kami bersekutu dalam kurban tersebut. "
            },
            {
                "number": 2425,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ قَيْسٍ عَنْ عَطَاءٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْبَقَرَةُ عَنْ سَبْعَةٍ وَالْجَزُورُ عَنْ سَبْعَةٍ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Hammad] dari [Qais] dari ['Atha`], dari [Jabir bin Abdullah], bahwa Nabi shallallahu 'alaihi wasallam berkata: \"Satu ekor sapi untuk tujuh orang, dan satu ekor unta untuk tujuh orang.\""
            },
            {
                "number": 2426,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّهُ قَالَنَحَرْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْحُدَيْبِيَّةِ الْبَدَنَةَ عَنْ سَبْعَةٍ وَالْبَقَرَةَ عَنْ سَبْعَةٍ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi], dari [Malik], dari [Abu Az Zubair Al Makki], dari [Jabir bin Abdullah], bahwa ia berkata; kami menyembelih satu ekor unta bersama Rasulullah shallallahu 'alaihi wasallam di Hudaibiyah untuk tujuh orang dan seekor sapi untuk tujuh ekor. "
            },
            {
                "number": 2427,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا يَعْقُوبُ يَعْنِي الْإِسْكَنْدَرَانِيَّ عَنْ عَمْرٍو عَنْ الْمُطَّلِبِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَشَهِدْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْأَضْحَى بِالْمُصَلَّى فَلَمَّا قَضَى خُطْبَتَهُ نَزَلَ مِنْ مِنْبَرِهِ وَأُتِيَ بِكَبْشٍ فَذَبَحَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدِهِ وَقَالَ بِسْمِ اللَّهِ وَاللَّهُ أَكْبَرُ هَذَا عَنِّي وَعَمَّنْ لَمْ يُضَحِّ مِنْ أُمَّتِي",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id], telah menceritakan kepada kami [Ya'qub Al Iskandari], dari ['Amr] dari [Al Muththalib] dari [Jabir bin Abdullah], ia berkata; saya menyaksikan bersama Rasulullah shallallahu 'alaihi wasallam Shalat Adha di lapangan, kemudian tatkala menyelesaikan khutbahnya beliau turun dari mimbarnya, dan beliau diberi satu ekor domba kemudian Rasulullah shallallahu 'alaihi wasallam menyembelihnya, dan mengucapkan: \"BISMILLAAHI WALLAAHU AKBAR, HAADZA 'ANNII WA 'AN MAN LAM YUDHAHHI MIN UMMATI\" (Dengan nama Allah, Allah Maha Besar, ini (kurban) dariku dan orang-orang yang belum berkurban dari umatku). "
            },
            {
                "number": 2428,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ أَنَّ أَبَا أُسَامَةَ حَدَّثَهُمْ عَنْ أُسَامَةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَذْبَحُ أُضْحِيَّتَهُ بِالْمُصَلَّىوَكَانَ ابْنُ عُمَرَ يَفْعَلُهُ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah], bahwa [Abu Usamah] telah menceritakan kepada mereka dari [Usamah] dari [Nafi'] dari [Ibnu Umar], bahwa Nabi shallallahu 'alaihi wasallam menyembelih kurbannya di lapangan, dan Ibnu Umar melakukan hal tersebut. "
            },
            {
                "number": 2429,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ قَالَتْ سَمِعْتُ عَائِشَةَ تَقُولُدَفَّ نَاسٌ مِنْ أَهْلِ الْبَادِيَةِ حَضْرَةَ الْأَضْحَى فِي زَمَانِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ادَّخِرُوا الثُّلُثَ وَتَصَدَّقُوا بِمَا بَقِيَ قَالَتْ فَلَمَّا كَانَ بَعْدُ ذَلِكَ قِيلَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا رَسُولَ اللَّهِ لَقَدْ كَانَ النَّاسُ يَنْتَفِعُونَ مِنْ ضَحَايَاهُمْ وَيَجْمُلُونَ مِنْهَا الْوَدَكَ وَيَتَّخِذُونَ مِنْهَا الْأَسْقِيَةَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَا ذَاكَ أَوْ كَمَا قَالَ قَالُوا يَا رَسُولَ اللَّهِ نَهَيْتَ عَنْ إِمْسَاكِ لُحُومِ الضَّحَايَا بَعْدَ ثَلَاثٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا نَهَيْتُكُمْ مِنْ أَجْلِ الدَّافَّةِ الَّتِي دَفَّتْ عَلَيْكُمْ فَكُلُوا وَتَصَدَّقُوا وَادَّخِرُوا",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi], dari [Malik], dari [Abdullah bin Abu Bakr], dari ['Amrah binti Abdurrahman], ia berkata; saya mendengar [Aisyah] berkata; orang-orang bersegera menghadiri shalat 'Idul Adhha pada zaman Rasulullah shallallahu 'alaihi wasallam, kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Simpanlah sepertiga, dan sedekahkan sisanya!\" Aisyah berkata; kemudian setelah itu Rasulullah shallallahu 'alaihi wasallam ditanya; wahai Rasulullah, dahulu orang-orang mendapatkan manfaat dari kurban mereka dan mereka mencairkan lemak, dan membuat tempat minum dari kulitnya, kemudian Rasulullah shallallahu 'alaihi wasallam berkata: \"Ada apa dengan hal tersebut?\" Mereka berkata; wahai Rasulullah, engkautelah melarang dari memakan daging kurban setelah tiga hari. Kemudian beliau berkata: \"Sesungguhnya aku melarang hal tersebut, karena sekelompok orang yang terburu-buru datang kepada kalian. Makanlah, sedekahkan, serta simpanlah!\""
            },
            {
                "number": 2430,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا خَالِدٌ الْحَذَّاءُ عَنْ أَبِي الْمَلِيحِ عَنْ نُبَيْشَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّا كُنَّا نَهَيْنَاكُمْ عَنْ لُحُومِهَا أَنْ تَأْكُلُوهَا فَوْقَ ثَلَاثٍ لِكَيْ تَسَعَكُمْ فَقَدْ جَاءَ اللَّهُ بِالسَّعَةِ فَكُلُوا وَادَّخِرُوا وَاتَّجِرُوا أَلَا وَإِنَّ هَذِهِ الْأَيَّامَ أَيَّامُ أَكْلٍ وَشُرْبٍ وَذِكْرِ اللَّهِ عَزَّ وَجَلَّ",
                "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Yazid bin Zurai'], telah menceritakan kepada kami [Khalid Al Hadzdza`] dari [Abu Al Malih], dari [Nubaisyah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya dahulu kami telah melarang kalian dari memakan daging kurban di atas tiga hari agar mencukupi kalian. Allah telah memberikan keluasan, maka dan simpanlah serta juallah! Ketahuilah bahwa hari-hari ini adalah hari-hari makan dan minum serta berdzikir kepada Allah 'azza wajalla.\""
            },
            {
                "number": 2431,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا حَمَّادُ بْنُ خَالِدٍ الْخَيَّاطُ قَالَ حَدَّثَنَا مُعَاوِيَةُ بْنُ صَالِحٍ عَنْ أَبِي الزَّاهِرِيَّةِ عَنْ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ ثَوْبَانَ قَالَضَحَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ قَالَ يَا ثَوْبَانُ أَصْلِحْ لَنَا لَحْمَ هَذِهِ الشَّاةِ قَالَ فَمَا زِلْتُ أُطْعِمُهُ مِنْهَا حَتَّى قَدِمْنَا الْمَدِينَةَ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili], telah menceritakan kepada kami [Hammad bin Khalid Al Khayyath], ia berkata; telah menceritakan kepada kami [Mu'awiyah bin Shalih] dari [Abu Az Zahiriyyah], dari [Jubair bin Nufair], dari [Tsauban], ia berkata; Rasulullah shallallahu 'alaihi wasallam berkurban kemudian berkata: \"Wahai Tsauban, persiapkan daging kambing ini untuk kami!\" Aku terus memberi beliau makan dari daging tersebut hingga kami datang ke Madinah. "
            },
            {
                "number": 2432,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا شُعْبَةُ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْأَشْعَثِ عَنْ شَدَّادِ بْنِ أَوْسٍ قَالَخَصْلَتَانِ سَمِعْتُهُمَا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ كَتَبَ الْإِحْسَانَ عَلَى كُلِّ شَيْءٍ فَإِذَا قَتَلْتُمْ فَأَحْسِنُوا قَالَ غَيْرُ مُسْلِمٍ يَقُولُ فَأَحْسِنُوا الْقِتْلَةَ وَإِذَا ذَبَحْتُمْ فَأَحْسِنُوا الذَّبْحَ وَلْيُحِدَّ أَحَدُكُمْ شَفْرَتَهُ وَلْيُرِحْ ذَبِيحَتَهُ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim], telah menceritakan kepada kami [Syu'bah] dari [Khalid Al Hadzdza`] dari [Abu Qilabah] dari [Abu Al Asy'ats] dari [Syaddad bin Aus], ia berkata; dua sifat yang aku dengar dari Rasulullah shallallahu wa'alaihi wa sallam: \"Sesungguhnya Allah telah mewajibkan bersikap baik terhadap segala sesuatu, apabila kalian membunuh maka bersikaplah yang baik!\" selain Muslim mengatakan mengatakan: maka bunuhlah dengan baik, dan apabila kalian menyembelih maka sembelihlah dengan baik, dan hendaknya salah seorang dari kalian menajamkan pisaunya dan memberikan kenyamanan kepada hewan sembelihannya.\""
            },
            {
                "number": 2433,
                "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا شُعْبَةُ عَنْ هِشَامِ بْنِ زَيْدٍ قَالَدَخَلْتُ مَعَ أَنَسٍ عَلَى الْحَكَمِ بْنِ أَيُّوبَ فَرَأَى فِتْيَانًا أَوْ غِلْمَانًا قَدْ نَصَبُوا دَجَاجَةً يَرْمُونَهَا فَقَالَ أَنَسٌ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تُصْبَرَ الْبَهَائِمُ",
                "id": "Telah menceritakan kepada kami [Abu Al Walid Ath Thayalisi], telah menceritakan kepada kami [Syu'bah], dari [Hisyam bin Zaid], ia berkata; aku bersama Anas menemui Al Hakam bin Ayyub, kemudian ia melihat beberapa pemuda atau anak-anak yang memasang ayam dan mereka melemparinya. Kemudian [Anas] berkata; Rasulullah shallallahu 'alaihi wasallam telah melarang dari menjadikan hewan sebagai sasaran. "
            },
            {
                "number": 2434,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ ثَابِتٍ الْمَرْوَزِيُّ حَدَّثَنِي عَلِيُّ بْنُ حُسَيْنٍ عَنْ أَبِيهِ عَنْ يَزِيدَ النَّحْوِيِّ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ{ فَكُلُوا مِمَّا ذُكِرَ اسْمُ اللَّهِ عَلَيْهِ }{ وَلَا تَأْكُلُوا مِمَّا لَمْ يُذْكَرْ اسْمُ اللَّهِ عَلَيْهِ }فَنُسِخَ وَاسْتَثْنَى مِنْ ذَلِكَ فَقَالَ{ وَطَعَامُ الَّذِينَ أُوتُوا الْكِتَابَ حِلٌّ لَكُمْ وَطَعَامُكُمْ حِلٌّ لَهُمْ }",
                "id": "Telah menceritakan kepada kami [Ahmad bin Muhammad bin Tsabit Al Marwazi], telah menceritakan kepadaku [Ali bin Husain] dari [ayahnya] dari [Yazid An Nahwi] dari [Ikrimah] dari [Ibnu Abbas], ia berkata; ayat \"Makanlah apa yang telah disebutkan nama Allah padanya, \" \"Dan jangan kalian makan apa yang yang belum disebutkan nama Allah padanya.\" Kemudian hal tersebut dihapuskan dan Allah mengecualihan dari hal tersebut, Allah berfirman: \"Dan makanan orang-orang ahli kitab adalah halal bagimu dan makananmu adalah halal bagi mereka.\""
            },
            {
                "number": 2435,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا إِسْرَائِيلُ حَدَّثَنَا سِمَاكٌ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍفِي قَوْلِهِ{ وَإِنَّ الشَّيَاطِينَ لَيُوحُونَ إِلَى أَوْلِيَائِهِمْ }يَقُولُونَ مَا ذَبَحَ اللَّهُ فَلَا تَأْكُلُوا وَمَا ذَبَحْتُمْ أَنْتُمْ فَكُلُوا فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ{ وَلَا تَأْكُلُوا مِمَّا لَمْ يُذْكَرْ اسْمُ اللَّهِ عَلَيْهِ }",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir], telah mengabarkan kepada kami [Israil], telah menceritakan kepada kami [Simak], dari [Ikrimah] dari [Ibnu Abbas], mengenai firman Allah: \"Sesungguhnya syaitan itu membisikkan kepada kawan-kawannya.\" Mereka mengatakan; apa yang Allah sembelih janganlah kalian makan dan apa yang kalian sembelih makanlah! Kemudian Allah 'azza wajalla menurunkan ayat: \"Dan jangan kalian makan apa yang yang belum disebutkan nama Allah padanya.\""
            },
            {
                "number": 2436,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عِمْرَانُ بْنُ عُيَيْنَةَ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَجَاءَتْ الْيَهُودُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا نَأْكُلُ مِمَّا قَتَلْنَا وَلَا نَأْكُلُ مِمَّا قَتَلَ اللَّهُ فَأَنْزَلَ اللَّهُ{ وَلَا تَأْكُلُوا مِمَّا لَمْ يُذْكَرْ اسْمُ اللَّهِ عَلَيْهِ }إِلَى آخِرِ الْآيَةِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah], telah menceritakan kepada kami [Imran bin 'Uyainah], dari ['Atha` bin As Saib], dari [Sa'id bin Jubair], dari [Ibnu Abbas], ia berkata; orang-orang yahudi telah datang kepada Nabi shallallahu 'alaihi wasallam dan berkata; kami maka apa yang kami bunuh, dna kami tidak makan apa yang Allah bunuh. Kemudian Allah menurunkan ayat: \"Dan jangan kalian makan apa yang yang belum disebutkan nama Allah padanya.\" Hinngga akhir ayat. "
            },
            {
                "number": 2437,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا حَمَّادُ بْنُ مَسْعَدَةَ عَنْ عَوْفٍ عَنْ أَبِي رَيْحَانَةَ عَنْ ابْنِ عَبَّاسٍ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ مُعَاقَرَةِ الْأَعْرَابِقَالَ أَبُو دَاوُد اسْمُ أَبِي رَيْحَانَةَ عَبْدُ اللَّهِ بْنُ مَطَرٍ وَغُنْدَرٌ أَوْقَفَهُ عَلَى ابْنِ عَبَّاسٍ",
                "id": "Telah menceritakan kepada kami [Harun bin Abdullah], telah menceritakan kepada kami [Hammad bin Mas'adah], dari ['Auf], dari [Abu Raihanah], dari [Ibnu Abbas], ia berkata; Rasulullah shallallahu 'alaihi wasallam telah melarang dari sikap berbangga orang-orang badui. "
            },
            {
                "number": 2438,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو الْأَحْوَصِ حَدَّثَنَا سَعِيدُ بْنُ مَسْرُوقٍ عَنْ عَبَايَةَ بْنِ رِفَاعَةَ عَنْ أَبِيهِ عَنْ جَدِّهِ رَافِعِ بْنِ خَدِيجٍ قَالَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّا نَلْقَى الْعَدُوَّ غَدًا وَلَيْسَ مَعَنَا مُدًى أَفَنَذْبَحُ بِالْمَرْوَةِ وَشِقَّةِ الْعَصَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرِنْ أَوْ أَعْجِلْ مَا أَنْهَرَ الدَّمَ وَذُكِرَ اسْمُ اللَّهِ عَلَيْهِ فَكُلُوا مَا لَمْ يَكُنْ سِنًّا أَوْ ظُفْرًا وَسَأُحَدِّثُكُمْ عَنْ ذَلِكَ أَمَّا السِّنُّ فَعَظْمٌ وَأَمَّا الظُّفْرُ فَمُدَى الْحَبَشَةِ وَتَقَدَّمَ بِهِ سَرْعَانٌ مِنْ النَّاسِ فَتَعَجَّلُوا فَأَصَابُوا مِنْ الْغَنَائِمِ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي آخِرِ النَّاسِ فَنَصَبُوا قُدُورًا فَمَرَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْقُدُورِ فَأَمَرَ بِهَا فَأُكْفِئَتْ وَقَسَمَ بَيْنَهُمْ فَعَدَلَ بَعِيرًا بِعَشْرِ شِيَاهٍ وَنَدَّ بَعِيرٌ مِنْ إِبِلِ الْقَوْمِ وَلَمْ يَكُنْ مَعَهُمْ خَيْلٌ فَرَمَاهُ رَجُلٌ بِسَهْمٍ فَحَبَسَهُ اللَّهُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ لِهَذِهِ الْبَهَائِمِ أَوَابِدَ كَأَوَابِدِ الْوَحْشِ فَمَا فَعَلَ مِنْهَا هَذَا فَافْعَلُوا بِهِ مِثْلَ هَذَا",
                "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Abu Al Ahwash], telah menceritakan kepada kami [Sa'id bin Masruq], dari ['Abayah bin Rifa'ah] dari [ayahnya], dari [kakeknya yaitu Rafi' bin Khadij], ia berkata; aku datang kepada Rasulullah shallallahu 'alaihi wasallam lalu aku katakan; wahai Rasulullah, sesungguhnya kita akan bertemu musuh besok, dan kita tidak memiliki pisau. Bolehkah kami menyembelih menggunakan marwah (batu putih yang dibuat seperti pisau) dan belahan tongkat? Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Percepat dan segeralah, apa yang dapat mengalirkan darah dan telah disebutkan nama Allah, maka makanlah, selama bukan gigi atau kuku dan akan saya ceritakan mengenai hal tersebut; adapun gigi maka itu adalah tulang, adapun kuku maka itu adalah pisau orang-orang Habasyah.\" Kemudian orang-orang terdepan maju dan cepat-cepat mereka menyembelih kambing, sementara Rasulullah shallallahu 'alaihi wasallam berada di belakang orang-orang. Kemudian mereka meletakkan bejana-bejana mereka. Kemudian Rasulullah shallallahu 'alaihi wasallam melewati bejana-bejana tersebut dan memerintahkan untuk dipenuhi dan beliau membagikan daging tersebut diantara mereka. Beliau menyetarakan satu ekor unta sama dengan sepuluh kambing. Kemudian salah satu unta orang-orang tersebut kabur, dan mereka tidak membawa kuda. Kemudian seseorang memanahnya dan Allah menghentikannya. Lalu Nabi shallallahu 'alaihi wasallam berkata: \"Sesungguhnya hewan-hewan ternak ini memiliki hewan-hewan yang menjadi liar seperti liarnya hewan yang liar, apa yang dilakukan orang ini terhadapnya (unta yang kabur tersebut), maka lakukanlah seperti ini!\""
            },
            {
                "number": 2439,
                "arab": "حَدَّثَنَا مُسَدَّدٌ أَنَّ عَبْدَ الْوَاحِدِ بْنِ زِيَادٍ وَحَمَّادًا حَدَّثَاهُمْ الْمَعْنَى وَاحِدٌ عَنْ عَاصِمٍ عَنْ الشَّعْبِيِّ عَنْ مُحَمَّدِ بْنِ صَفْوَانَ أَوْ صَفْوَانَ بْنِ مُحَمَّدٍ قَالَاصَّدْتُ أَرْنَبَيْنِ فَذَبَحْتُهُمَا بِمَرْوَةٍ فَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْهُمَا فَأَمَرَنِي بِأَكْلِهِمَا",
                "id": "Telah menceritakan kepada kami [Musaddad], bahwa [Abdul Wahid bin Ziyad] dan [Hammad], telah menceritakan kepada mereka, dan maknanya adalah satu, dari ['Ashim] dari [Asy Sya'bi], dari [Muhammad bin Shafwan atau Shafwan bin Muhammad], ia berkata; aku telah berburu dua ekor kelinci, kemudian aku menyembelihnya menggunakan batu, lalu aku bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai kedua kelinci tersebut, lalu beliau memerintahkanku agar memakannya. "
            },
            {
                "number": 2440,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا يَعْقُوبُ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ رَجُلٍ مِنْ بَنِي حَارِثَةَأَنَّهُ كَانَ يَرْعَى لِقْحَةً بِشِعْبٍ مِنْ شِعَابِ أُحُدٍ فَأَخَذَهَا الْمَوْتُ فَلَمْ يَجِدْ شَيْئًا يَنْحَرُهَا بِهِ فَأَخَذَ وَتِدًا فَوَجَأَ بِهِ فِي لَبَّتِهَا حَتَّى أُهَرِيقَ دَمُهَا ثُمَّ جَاءَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرَهُ بِذَلِكَ فَأَمَرَهُ بِأَكْلِهَا",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id], telah menceritakan kepada kami [Ya'qub] dari [Zaid bin Aslam], dari ['Atha` bin Yasar] dari [seorang laki-laki dari Bani Haritsah], bahwa ia pernah menggembala unta yang bersusu dan hampir melahirkan di sebuah jalan Uhud. Kemudian unta tersebut hampir mati dan ia tidak mendapatkan sesuatu untuk menyembelihnya, lalu ia mengambil pasak dan ia tusukkan pada dadanya hingga mengeluarkan darah, kemudian ia datang kepada Nabi shallallahu 'alaihi wasallam lalu mengabarkan tentang hal itu, maka beliau memerintahkan untuk memakannya. "
            },
            {
                "number": 2441,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ مُرَيِّ بْنِ قَطَرِيٍّ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَقُلْتُ يَا رَسُولَ اللَّهِ أَرَأَيْتَ إِنْ أَحَدُنَا أَصَابَ صَيْدًا وَلَيْسَ مَعَهُ سِكِّينٌ أَيَذْبَحُ بِالْمَرْوَةِ وَشِقَّةِ الْعَصَا فَقَالَ أَمْرِرْ الدَّمَ بِمَا شِئْتَ وَاذْكُرْ اسْمَ اللَّهِ عَزَّ وَجَلَّ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Hammad], dari [Simak bin Harb], dari [Murai bin Qothary], dari [Adi bin Hatim], dia berkata; aku berkata; wahai Rasulullah bagaimana menurut engkau jika salah seorang diantara kami mendapat hewan buruan sedangkan dia tidak mempunyai pisau, apakah (boleh) dia menyembelih dengan batu yang tajam? Maka beliau bersabda: \"alirkanlah darah (hewan itu) dengan apa yang kamu punyai dan sebutlah nama Allah 'azza wajalla\". "
            },
            {
                "number": 2442,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ أَبِي الْعُشَرَاءِ عَنْ أَبِيهِ أَنَّهُ قَالَيَا رَسُولَ اللَّهِ أَمَا تَكُونُ الذَّكَاةُ إِلَّا مِنْ اللَّبَّةِ أَوْ الْحَلْقِ قَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ طَعَنْتَ فِي فَخِذِهَا لَأَجْزَأَ عَنْكَقَالَ أَبُو دَاوُد وَهَذَا لَا يَصْلُحُ إِلَّا فِي الْمُتَرَدِّيَةِ وَالْمُتَوَحِّشِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus], telah menceritakan kepada kami [Hammad bin Salamah], dari [Abu Al 'Usyara`] dari [ayahnya], bahwa ia berkata; wahai Rasulullah, apakah menyembelih itu harus dari labbah (leher bagian bawah) atau tenggorokan? Kemudian Rasulullah shallallahu 'alaihi wasallam berkata: \"Seandainya engkau tusuk pada pahanya niscaya sah bagimu.\" Abu Daud berkata; dan hal ini tidak boleh dilakukan kecuali pada hewan yang terjatuh dari atas dan hewan yang menjadi liar. "
            },
            {
                "number": 2443,
                "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ وَالْحَسَنُ بْنُ عِيسَى مَوْلَى ابْنِ الْمُبَارَكِ عَنْ ابْنِ الْمُبَارَكِ عَنْ مَعْمَرٍ عَنْ عَمْرِو بْنِ عَبْدِ اللَّهِ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ زَادَ ابْنُ عِيسَى وَأَبِي هُرَيْرَةَ قَالَانَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ شَرِيطَةِ الشَّيْطَانِ زَادَ ابْنُ عِيسَى فِي حَدِيثِهِ وَهِيَ الَّتِي تُذْبَحُ فَيُقْطَعُ الْجِلْدُ وَلَا تُفْرَى الْأَوْدَاجُ ثُمَّ تُتْرَكُ حَتَّى تَمُوتَ",
                "id": "Telah menceritakan kepada kami [Hannad bin As Sari], dan [Al Hasan bin Isa] mantan budak Ibnu Al Mubarak, dari [Ibnu Al Mubarak] dari [Ma'mar] dari ['Amr bin Abdullah], dari [Ikrimah] dari [Ibnu Abbas], Ibnu Isa menambahkan; dan dari [Abu Hurairah] mereka berdua mengatakan; Rasulullah shallallahu 'alaihi wasallam melarang dari syarithatu syaithan (hewan yang ketika disembelih urat lehernya tidak terpotong dengan sempurna), Ibnu Isa menambahkan dalam haditsnya; yaitu yang disembelih dengan memotong kulit dan urat-urat leher tidak dipotong kemudian dibiarkan hingga mati. "
            },
            {
                "number": 2444,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ حَدَّثَنَا ابْنُ الْمُبَارَكِ ح و حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا هُشَيْمٌ عَنْ مُجَالِدٍ عَنْ أَبِي الْوَدَّاكِ عَنْ أَبِي سَعِيدٍ قَالَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْجَنِينِ فَقَالَ كُلُوهُ إِنْ شِئْتُمْ وَقَالَ مُسَدَّدٌ قُلْنَا يَا رَسُولَ اللَّهِ نَنْحَرُ النَّاقَةَ وَنَذْبَحُ الْبَقَرَةَ وَالشَّاةَ فَنَجِدُ فِي بَطْنِهَا الْجَنِينَ أَنُلْقِيهِ أَمْ نَأْكُلُهُ قَالَ كُلُوهُ إِنْ شِئْتُمْ فَإِنَّ ذَكَاتَهُ ذَكَاةُ أُمِّهِ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi], telah menceritakan kepada kami [Ibnu Al Mubarak], dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Husyaim] dari [Mujalid] dari [Abu Al Waddak] dari [Abu Sa'id], ia berkata; saya bertanya kepada Rasulullah shallallahu wa'alaihi wa sallam mengenai janin hewan, kemudian beliau berkata: \"Makanlah apabila kalian menghendaki!\" Musaddad berkata; maka kami katakan; wahai Rasulullah, kami menyembelih unta, sapi dan kambing, kemudian kami dapatkan janin dalam perutnya, apakah kami membuangnya atau kami boleh memakannya? Beliau berkata: \"Makanlah apabila kalian menghendaki! Sesungguhnya penyembelihannya adalah dengan menyembelih induknya\""
            },
            {
                "number": 2445,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ حَدَّثَنِي إِسْحَقُ بْنُ إِبْرَاهِيمَ بْنِ رَاهَوَيْهِ حَدَّثَنَا عَتَّابُ بْنُ بَشِيرٍ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ أَبِي زِيَادٍ الْقَدَّاحُ الْمَكِّيُّ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ذَكَاةُ الْجَنِينِ ذَكَاةُ أُمِّهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris], telah menceritakan kepadaku [Ishaq bin Ibrahim bin Rahawaih], telah menceritakan kepada kami ['Attab bin Basyir], telah menceritakan kepada kami ['Ubaidullah bin Abu Al Qaddah Al Makki], dari [Abu Az Zubair], dari [Jabir bin Abdullah], dari Rasulullah shallallahu 'alaihi wasallam, beliau berkata: \"Penyembelihan janin adalah dengan menyembelih induknya.\""
            },
            {
                "number": 2446,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ ح و حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ ح و حَدَّثَنَا يُوسُفُ بْنُ مُوسَى حَدَّثَنَا سُلَيْمَانُ بْنُ حَيَّانَ وَمُحَاضِرٌ الْمَعْنَى عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ وَلَمْ يَذْكُرَا عَنْ حَمَّادٍ وَمَالِكٍ عَنْ عَائِشَةَ أَنَّهُمْ قَالُوايَا رَسُولَ اللَّهِ إِنَّ قَوْمًا حَدِيثُو عَهْدٍ بِالْجَاهِلِيَّةِ يَأْتُونَ بِلُحْمَانٍ لَا نَدْرِي أَذَكَرُوا اسْمَ اللَّهِ عَلَيْهَا أَمْ لَمْ يَذْكُرُوا أَفَنَأْكُلُ مِنْهَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَمُّوا اللَّهَ وَكُلُوا",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Hammad], dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Al Qa'nabi], dari [Malik], dan telah diriwayatkan dari jalur yang lain: Dan telah menceritakan kepada kami [Yusuf bin Musa], telah menceritakan kepada kami [Sulaiman bin Hayyan], serta [Muhadhir] secara makna, dari [Hisyam bin 'Urwah] dari [ayahnya], dari [Aisyah], dan mereka berdua tidak menyebutkan dari Hammad, dan Malik, dari Aisyah. Bahwa mereka berkata; wahai Rasulullah, sesungguhnya orang-orang yang belum lama meninggalkan masa jahiliyah datang membawa daging, kami tidak mengetahui apakah mereka menyebutkan nama Allah padanya atau belum. Apakah kami boleh memakan sebagian darinya? Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sebutlah nama Allah dan makanlah!\""
            },
            {
                "number": 2447,
                "arab": "حَدَّثَنَا مُسَدَّدٌ ح و حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ عَنْ بِشْرِ بْنِ الْمُفَضَّلِ الْمَعْنَى حَدَّثَنَا خَالِدٌ الْحَذَّاءُ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْمَلِيحِ قَالَ قَالَ نُبَيْشَةُنَادَى رَجُلٌ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّا كُنَّا نَعْتِرُ عَتِيرَةً فِي الْجَاهِلِيَّةِ فِي رَجَبٍ فَمَا تَأْمُرُنَا قَالَ اذْبَحُوا لِلَّهِ فِي أَيِّ شَهْرٍ كَانَ وَبَرُّوا اللَّهَ عَزَّ وَجَلَّ وَأَطْعِمُوا قَالَ إِنَّا كُنَّا نُفْرِعُ فَرَعًا فِي الْجَاهِلِيَّةِ فَمَا تَأْمُرُنَا قَالَ فِي كُلِّ سَائِمَةٍ فَرَعٌ تَغْذُوهُ مَاشِيَتَكَ حَتَّى إِذَا اسْتَحْمَلَ قَالَ نَصْرٌ اسْتَحْمَلَ لِلْحَجِيجِ ذَبَحْتَهُ فَتَصَدَّقْتَ بِلَحْمِهِ قَالَ خَالِدٌ أَحْسَبَهُ قَالَ عَلَى ابْنِ السَّبِيلِ فَإِنَّ ذَلِكَ خَيْرٌقَالَ خَالِدٌ قُلْتُ لِأَبِي قِلَابَةَ كَمْ السَّائِمَةُ قَالَ مِائَةٌ",
                "id": "Telah menceritakan kepada kami [Musaddad], dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Nashr bin Ali], dari [Bisyr bin Al Mufadhdhal] secara makna, telah menceritakan kepada kami [Khalid Al Hadzdza`], dari [Abu Qilabah], dari [Abu Al Malih], ia berkata; [Nubaisy] berkata; seorang laki-laki memanggil Rasulullah shallallahu 'alaihi wasallam; sesungguhnya kami dahulu menyembelih hewan pada sepuluh pertama Bulan Rajab pada masa jahiliyah, maka apakah yang anda perintahkan kepada kami? Beliau berkata: \"Sembelihlah karena Allah pada bulan apa saja, dan berbaktilah kepada Allah 'azza wajalla, serta berilah makan!\" orang tersebut berkata; sesungguhnya kami dahulu kami menyembelih anak hewan pertama pada masa jahiliyah, maka apakah yang anda perintahkan kepada kami? Beliau berkata: \"Pada setiap hewan yang telah digembala lebih dari satu tahun terdapat anak pertama yang kalian yang diberi makan oleh hewan ternakmu, hingga apabila ia siap untuk dibebani -Nashr mengatakan; siap untuk dibebani orang-orang yang berhaji- maka engkau menyembelihnya dan bersedekah dengan dagingnya.\" Khalid berkata; aku katakan kepada Abu Qilabah; berapakah hewan saimah (yang digembala lebih dari satu tahun) (yang diperintahkan Rasulullah shallallahu 'alaihi wasallam untuk disembelih anak pertamanya?) ia berkata; seratus. "
            },
            {
                "number": 2448,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ أَخْبَرَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا فَرَعَ وَلَا عَتِيرَةَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin 'Abdah], telah mengabarkan kepada kami [Sufyan] dari [Az Zuhri], dari [Sa'id] dari [Abu Hurairah], bahwa Nabi shallallahu 'alaihi wasallam berkata: \"Tidak ada fara' (menyembelih anak hewan yang pertama) dan tidak ada 'atirah (menyembelih hewan yang disembelih pada sepuluh pertama Bulan Rajab).\""
            },
            {
                "number": 2449,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ سَعِيدٍ قَالَالْفَرَعُ أَوَّلُ النَّتَاجِ كَانَ يُنْتَجُ لَهُمْ فَيَذْبَحُونَهُ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali], telah menceritakan kepada kami [Abdurrazzaq], telah mengabarkan kepada kami [Ma'mar], dari [Az Zuhri] dari [Sa'id], ia berkata; fara' adalah anak hewan pertama, dahulu mereka hewan mereka melahirkan kemudian mereka menyembelihnya. "
            },
            {
                "number": 2450,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ عَبْدِ اللَّهِ بْنِ عُثْمَانَ بْنِ خُثَيْمٍ عَنْ يُوسُفَ بْنِ مَاهَكَ عَنْ حَفْصَةَ بِنْتِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ قَالَتْأَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ كُلِّ خَمْسِينَ شَاةً شَاةٌقَالَ أَبُو دَاوُد قَالَ بَعْضُهُمْ الْفَرَعُ أَوَّلُ مَا تُنْتِجُ الْإِبِلُ كَانُوا يَذْبَحُونَهُ لِطَوَاغِيتِهِمْ ثُمَّ يَأْكُلُونَهُ وَيُلْقَى جِلْدُهُ عَلَى الشَّجَرِ وَالْعَتِيرَةُ فِي الْعَشْرِ الْأُوَلِ مِنْ رَجَبٍ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Hammad] dari [Abdullah bin Utsman bin Khutsaim] dari [Yusuf bin Mahak], dari [Hafshah binti Abdurrahman] dari [Aisyah], ia berkata; Rasulullah shallallahu 'alaihi wasallam memerintahkan kami untuk dikeluarkan zakat dari setiap lima puluh kambing satu ekor kambing. Abu Daud berkata; sebagian mereka mengatakan; fara' adalah anak unta yang pertama, dahulu mereka menyembelihnya untuk para berhala mereka, kemudian mereka memakannya, dan kulitnya dilemparkan ke pohon, sedangkan 'atirah ada pada sepuluh hari pertama pada Bulan Rajab. "
            },
            {
                "number": 2451,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ عَطَاءٍ عَنْ حَبِيبَةَ بِنْتِ مَيْسَرَةَ عَنْ أُمِّ كُرْزٍ الْكَعْبِيَّةِ قَالَتْسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ عَنْ الْغُلَامِ شَاتَانِ مُكَافِئَتَانِ وَعَنْ الْجَارِيَةِ شَاةٌقَالَ أَبُو دَاوُد سَمِعْت أَحْمَدَ قَالَ مُكَافِئَتَانِ أَيْ مُسْتَوِيَتَانِ أَوْ مُقَارِبَتَانِ",
                "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Sufyan] dari ['Amr bin Dinar], dari ['Atho`], dari [Habibah binti Maisarah], dari [Ummu Kurz Al Ka'biyyah], ia berkata; saya mendengar Rasulullah shallallahu wa'alaihi wa sallam bersabda: \"Untuk anak laki-laki dua kambing yang sama dan untuk anak perempuan satu kambing.\" Abu Daud berkata; saya mendengar Ahmad, ia berkata; mukafiatani yaitu yang sama atau saling berdekatan. "
            },
            {
                "number": 2452,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي يَزِيدَ عَنْ أَبِيهِ عَنْ سِبَاعِ بْنِ ثَابِتٍ عَنْ أُمِّ كُرْزٍ قَالَتْسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ أَقِرُّوا الطَّيْرَ عَلَى مَكِنَاتِهَا قَالَتْ وَسَمِعْتُهُ يَقُولُ عَنْ الْغُلَامِ شَاتَانِ وَعَنْ الْجَارِيَةِ شَاةٌ لَا يَضُرُّكُمْ أَذُكْرَانًا كُنَّ أَمْ إِنَاثًا",
                "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Sufyan] dari ['Ubaidullah bin Abu Yazid], dari [ayahnya] dari [Siba' bin Tsabit], dari [Ummu Kurz], ia berkata; saya mendengar Nabi shallallahu 'alaihi wasallam berkata: \"Biarkan burung berada pada tempatnya!\" Aisyah berkata; dan saya mendengar beliau berkata: \"Untuk anak laki-laki dua kambing yang sama dan untuk anak perempuan satu kambing tidak bermasalah bagi kalian apakah jantan atau betina.\""
            },
            {
                "number": 2453,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي يَزِيدَ عَنْ سِبَاعِ بْنِ ثَابِتٍ عَنْ أُمِّ كُرْزٍ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْغُلَامِ شَاتَانِ مِثْلَانِ وَعَنْ الْجَارِيَةِ شَاةٌقَالَ أَبُو دَاوُد هَذَا هُوَ الْحَدِيثُ وَحَدِيثُ سُفْيَانَ وَهْمٌ",
                "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Hammad bin Zaid], dari ['Ubaidullah bin Abu Yazid], dari [Siba' bin Tsabit], dari [Ummu Kurz], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Untuk anak laki-laki dua kambing yang sama dan untuk anak perempuan satu kambing.\" Abu Daud berkata; ini adalah hadits yang benar sedangkan hadits Sufyan adalah salah. "
            },
            {
                "number": 2454,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ النَّمَرِيُّ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ عَنْ الْحَسَنِ عَنْ سَمُرَةَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كُلُّ غُلَامٍ رَهِينَةٌ بِعَقِيقَتِهِ تُذْبَحُ عَنْهُ يَوْمَ السَّابِعِ وَيُحْلَقُ رَأْسُهُ وَيُدَمَّىفَكَانَ قَتَادَةُ إِذَا سُئِلَ عَنْ الدَّمِ كَيْفَ يُصْنَعُ بِهِ قَالَ إِذَا ذَبَحْتَ الْعَقِيقَةَ أَخَذْتَ مِنْهَا صُوفَةً وَاسْتَقْبَلْتَ بِهِ أَوْدَاجَهَا ثُمَّ تُوضَعُ عَلَى يَافُوخِ الصَّبِيِّ حَتَّى يَسِيلَ عَلَى رَأْسِهِ مِثْلَ الْخَيْطِ ثُمَّ يُغْسَلُ رَأْسُهُ بَعْدُ وَيُحْلَقُ قَالَ أَبُو دَاوُد وَهَذَا وَهْمٌ مِنْ هَمَّامٍ وَيُدَمَّى قَالَ أَبُو دَاوُد خُولِفَ هَمَّامٌ فِي هَذَا الْكَلَامِ وَهُوَ وَهْمٌ مِنْ هَمَّامٍ وَإِنَّمَا قَالُوا يُسَمَّى فَقَالَ هَمَّامٌ يُدَمَّى قَالَ أَبُو دَاوُد وَلَيْسَ يُؤْخَذُ بِهَذَا",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar An Namari], telah menceritakan kepada kami [Hammam], telah menceritakan kepada kami [Qatadah], dari [Al Hasan] dari [Samurah] dari Rasulullah shallallahu wa'alaihi wa sallam, beliau berkata: \"Setiap anak tergadaikan dengan aqiqahnya, disembelih untuknya pada hari ketujuh dan rambutnya dicukur, dan dilumuri dengan darah aqiqah.\" Qatadah apabila ditanya mengenai darah bagaimana dilakukan dengannya? Ia berkata; apabila engkau menyembelih aqiqah, maka engkau mengambil darinya satu bulu wol, dan engkau bawa ke arah urat-urat lehernya kemudian diletakkan pada pertengahan kepala anak kecil tersebut hingga mengalir di atas kelapa tersebut darah seperti benang, kemudian dicuci kepalanya setelah itu, dan dicukur. Abu Daud berkata; dan ini adalah kesalahan dari Hammam, yaitu kata; wa yudamma. Abu Daud berkata; Hammam diselisihi dalam perkataan ini, dan hal tersebut adalah kesalahan dari Hammam. Sesungguhnya mereka mengatakan; yusamma (diberi nama), namun Hammam berkata; wa yudamma (dan dilumuri darah). Abu Daud berkata; dan hadits tersebut tidak diambil dengan hal ini. "
            },
            {
                "number": 2455,
                "arab": "حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَ بْنِ جُنْدُبٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كُلُّ غُلَامٍ رَهِينَةٌ بِعَقِيقَتِهِ تُذْبَحُ عَنْهُ يَوْمَ سَابِعِهِ وَيُحْلَقُ وَيُسَمَّىقَالَ أَبُو دَاوُد وَيُسَمَّى أَصَحُّ كَذَا قَالَ سَلَّامُ بْنُ أَبِي مُطِيعٍ عَنْ قَتَادَةَ وَإِيَاسُ ابْنُ دَغْفَلٍ وَأَشْعَثُ عَنْ الْحَسَنِ قَالَ وَيُسَمَّى وَرَوَاهُ أَشْعَثُ عَنْ الْحَسَنِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَيُسَمَّى",
                "id": "Telah menceritakan kepada kami [Ibnu Al Mutsanna], telah menceritakan kepada kami [Ibnu Abu Adi], dari [Sa'id] dari [Qatadah] dari [Al Hasan] dari [Samurah bin Jundub] bahwa Rasulullah shallallahu 'alaihi wasallam berkata: \"Setiap anak tergadaikan dengan aqiqahnya, disembelihkan untuknya pada hari ketujuhnya, dicukur rambutnya dan diberi nama.\" Abu Daud berkata; dan kata yusamma (diberi nama) adalah lebih benar. Demikianlah yang dikatakan [Sallam bin Abu Muthi'] dari [Qatadah] serta [Iyas bin Daghfal], dan [Asy'ats], dari [Al Hasan], ia berkata; dan diberi nama. Dan hadits tersebut diriwayatkan oleh Asy'ats dari Al Hasan dari Nabi shallallahu 'alaihi wasallam dan ia diberi nama. "
            },
            {
                "number": 2456,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا هِشَامُ بْنُ حَسَّانَ عَنْ حَفْصَةَ بِنْتِ سِيرِينَ عَنْ الرَّبَابِ عَنْ سَلْمَانَ بْنِ عَامِرٍ الضَّبِّيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَعَ الْغُلَامِ عَقِيقَتُهُ فَأَهْرِيقُوا عَنْهُ دَمًا وَأَمِيطُوا عَنْهُ الْأَذَى",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali], telah menceritakan kepada kami [Abdurrazzaq], telah menceritakan kepada kami [Hisyam bin Hassan] dari [Hafshah binti Sirin] dari [Ar Robab] dari [Salman bin 'Amir Adh Dhabbi], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pada (setiap) anak laki-laki (yang lahir) harus diaqiqahi, maka sembelihlah (aqiqah) untuknya dan hilangkan gangguan darinya.\""
            },
            {
                "number": 2457,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ خَلَفٍ حَدَّثَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا هِشَامٌ عَنْ الْحَسَنِ أَنَّهُ كَانَ يَقُولُإِمَاطَةُ الْأَذَى حَلْقُ الرَّأْسِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Khalaf], telah menceritakan kepada kami [Abdul A'la], telah menceritakan kepada kami [Hisyam], dari [Al Hasan], bahwa ia pernah berkata; menghilangkan gangguan adalah mencukur rambut kepala. "
            },
            {
                "number": 2458,
                "arab": "حَدَّثَنَا أَبُو مَعْمَرٍ عَبْدُ اللَّهِ بْنُ عَمْرٍو حَدَّثَنَا عَبْدُ الْوَارِثِ حَدَّثَنَا أَيُّوبُ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَقَّ عَنْ الْحَسَنِ وَالْحُسَيْنِ كَبْشًا كَبْشًا",
                "id": "Telah menceritakan kepada kami [Abu Ma'mar Abdullah bin 'Amr], telah menceritakan kepada kami [Abdul Warits], telah menceritakan kepada kami [Ayyub] dari [Ikrimah] dari [Ibnu Abbas], bahwa Nabi shallallahu 'alaihi wasallam menyembelih aqiqah untuk Al Hasan dan Al Husain satu domba, satu domba. "
            },
            {
                "number": 2459,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ حَدَّثَنَا دَاوُدُ بْنُ قَيْسٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ح و حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ حَدَّثَنَا عَبْدُ الْمَلِكِ يَعْنِي ابْنَ عَمْرٍو عَنْ دَاوُدَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ أُرَاهُ عَنْ جَدِّهِ قَالَسُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْعَقِيقَةِ فَقَالَ لَا يُحِبُّ اللَّهُ الْعُقُوقَ كَأَنَّهُ كَرِهَ الِاسْمَ وَقَالَ مَنْ وُلِدَ لَهُ وَلَدٌ فَأَحَبَّ أَنْ يَنْسُكَ عَنْهُ فَلْيَنْسُكْ عَنْ الْغُلَامِ شَاتَانِ مُكَافِئَتَانِ وَعَنْ الْجَارِيَةِ شَاةٌ وَسُئِلَ عَنْ الْفَرَعِ قَالَ وَالْفَرَعُ حَقٌّ وَأَنْ تَتْرُكُوهُ حَتَّى يَكُونَ بَكْرًا شُغْزُبًّا ابْنَ مَخَاضٍ أَوْ ابْنَ لَبُونٍ فَتُعْطِيَهُ أَرْمَلَةً أَوْ تَحْمِلَ عَلَيْهِ فِي سَبِيلِ اللَّهِ خَيْرٌ مِنْ أَنْ تَذْبَحَهُ فَيَلْزَقَ لَحْمُهُ بِوَبَرِهِ وَتَكْفَأَ إِنَاءَكَ وَتُولِهُ نَاقَتَكَ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi], telah menceritakan kepada kami [Daud bin Qais], dari ['Amr bin Syu'aib], bahwa Nabi shallallahu 'alaihi wasallam, dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Muhammad bin Sulaiman Al Anbari], telah menceritakan kepada kami [Abdul Malik bin 'Amr], dari [Daud] dari ['Amr bin Syu'aib] dari [ayahnya], aku diberitahu dari [kakeknya], ia berkata; Rasulullah shallallahu 'alaihi wasallam ditanya mengenai aqiqah, kemudian beliau berkata: \"Allah tidak menyukai tindakkan durhaka.\" Sepertinya beliau tidak menyukai nama tersebut. Dan beliau berkata: \"Barangsiapa yang anaknya telah dilahirkan dan ia ingin menyembelih untuknya maka hendaknya ia menyembelih untuk anak laki-laki dua ekor kambing yang sama dan untuk anak wanita satu ekor kambing.\" Dan beliau ditanya mengenai fara' (anak unta yang pertama kali lahir). Beliau berkata: \"Dan fara' adalah hak, sedangkan kalian membiarkannya hingga menjadi dewasa kuat berumur satu tahun masuk dua tahun atau berumur dua tahun masuk tiga tahun kemudian engkau berikan kepada seorang janda atau engkau bebani di jalan Allah adalah lebih baik daripada engkau menyembelihnya sehingga dagingnya menempel dengan bulunya, dan engkau penuhi bejanamu dan engkau kagetkan untamu dengan kematian anaknya.\""
            },
            {
                "number": 2460,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ ثَابِتٍ حَدَّثَنَا عَلِيُّ بْنُ الْحُسَيْنِ حَدَّثَنِي أَبِي حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ قَالَ سَمِعْتُ أَبِي بُرَيْدَةَ يَقُولُكُنَّا فِي الْجَاهِلِيَّةِ إِذَا وُلِدَ لِأَحَدِنَا غُلَامٌ ذَبَحَ شَاةً وَلَطَخَ رَأْسَهُ بِدَمِهَا فَلَمَّا جَاءَ اللَّهُ بِالْإِسْلَامِ كُنَّا نَذْبَحُ شَاةً وَنَحْلِقُ رَأْسَهُ وَنُلَطِّخُهُ بِزَعْفَرَانٍ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Muhammad bin Tsabit], telah menceritakan kepada kami [Ali bin Al Husain], telah menceritakan kepadaku [ayahku] telah menceritakan kepada kami [Abdullah bin Buraidah], ia berkata; saya mendengar [ayahku yaitu Buraidah] berkata; dahulu kami pada masa jahiliyah apabila salah seorang diantara kami terlahirkan anak laki-lakinya maka ia menyembelih seekor kambing dan melumuri kepalanya dengan darahnya. Kemudian tatkala Allah datang membawa Islam maka kami menyembelih seekor kambing dan mencukur rambutnya serta melumurinya dengan za'faran. "
            }
  ]
}