{
    "kategori": "Kitab Peradilan",
  "hadits": [
    {
                "number": 3100,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ أَخْبَرَنَا فُضَيْلُ بْنُ سُلَيْمَانَ حَدَّثَنَا عَمْرُو بْنُ أَبِي عَمْرٍو عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ وَلِيَ الْقَضَاءَ فَقَدْ ذُبِحَ بِغَيْرِ سِكِّينٍ",
                "id": "Telah menceritakan kepada kami [Nashr bin Ali] telah mengabarkan kepada kami [Fudlail bin Sulaiman] telah menceritakan kepada kami ['Amru bin Abu 'Amru] dari [Sa'id Al Maqburi] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa menjabat sebagai hakim, maka sungguh ia telah disembelih tanpa menggunakan pisau.\""
            },
            {
                "number": 3101,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ أَخْبَرَنَا بِشْرُ بْنُ عُمَرَ عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ عَنْ عُثْمَانَ بْنِ مُحَمَّدٍ الْأَخْنَسِيِّ عَنْ الْمَقْبُرِيِّ وَالْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ جُعِلَ قَاضِيًا بَيْنَ النَّاسِ فَقَدْ ذُبِحَ بِغَيْرِ سِكِّينٍ",
                "id": "Telah menceritakan kepada kami [Nashr bin Ali] telah mengabarkan kepada kami [Bisyr bin Umar] dari [Abdullah bin Ja'far] dari [Utsman bin Muhammad Al Akhnasi] dari [Al Maqburi] serta [Al A'raj] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa dijadikan sebagai hakim di antara manusia, maka sungguh ia telah disembelih tanpa menggunakan pisau.\""
            },
            {
                "number": 3102,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ حَسَّانَ السَّمْتِيُّ حَدَّثَنَا خَلَفُ بْنُ خَلِيفَةَ عَنْ أَبِي هَاشِمٍ عَنْ ابْنِ بُرَيْدَةَ عَنْ أَبِيهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْقُضَاةُ ثَلَاثَةٌ وَاحِدٌ فِي الْجَنَّةِ وَاثْنَانِ فِي النَّارِ فَأَمَّا الَّذِي فِي الْجَنَّةِ فَرَجُلٌ عَرَفَ الْحَقَّ فَقَضَى بِهِ وَرَجُلٌ عَرَفَ الْحَقَّ فَجَارَ فِي الْحُكْمِ فَهُوَ فِي النَّارِ وَرَجُلٌ قَضَى لِلنَّاسِ عَلَى جَهْلٍ فَهُوَ فِي النَّارِقَالَ أَبُو دَاوُد وَهَذَا أَصَحُّ شَيْءٍ فِيهِ يَعْنِي حَدِيثَ ابْنِ بُرَيْدَةَ الْقُضَاةُ ثَلَاثَةٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Hassan As Samti] telah menceritakan kepada kami [Khalaf bin Khalifah] dari [Abu Hasyim] dari [Ibnu Buraidah] dari [Ayahnya] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Hakim itu ada tiga; satu orang di Surga dan dua orang berada di Neraka. Yang berada di surga adalah seorang laki-laki yang mengetahui kebenaran lalu menghukumi dengannya, seorang laki-laki yang mengetahui kebenaran lalu berlaku lalim dalam berhukum maka ia berada di Neraka, dan orang yang memberikan keputusan untuk manusia di atas kebodohan maka ia berada di Neraka.\" Abu Daud berkata, \"Hadits ini adalah yang paling shahih dalam hal tersebut, yaitu Hadits Ibnu Buraidah yang mengatakan; Hakim ada tiga….\""
            },
            {
                "number": 3103,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ بْنِ مَيْسَرَةَ حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُحَمَّدٍ أَخْبَرَنِي يَزِيدُ بْنُ عَبْدِ اللَّهِ بْنِ الْهَادِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ بُسْرِ بْنِ سَعِيدٍ عَنْ أَبِي قَيْسٍ مَوْلَى عَمْرِو بْنِ الْعَاصِ عَنْ عَمْرِو بْنِ الْعَاصِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا حَكَمَ الْحَاكِمُ فَاجْتَهَدَ فَأَصَابَ فَلَهُ أَجْرَانِ وَإِذَا حَكَمَ فَاجْتَهَدَ فَأَخْطَأَ فَلَهُ أَجْرٌفَحَدَّثْتُ بِهِ أَبَا بَكْرِ بْنِ حَزْمٍ فَقَالَ هَكَذَا حَدَّثَنِي أَبُو سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ",
                "id": "Telah menceritakan kepada kami ['Ubaidullah bin Umar bin Maisarah] telah menceritakan kepada kami [Abdul Aziz bin Muhammad] telah mengabarkan kepadaku [Yazid bin Abdullah bin Al Had] dari [Muhammad bin Ibrahim] dari [Busr bin Sa'id] dari [Abu Qais] mantan budak 'Amru bin Al 'Ash dari ['Amru bin Al 'Ash] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila seorang hakim berhukum lalu berijtihad dan benar maka baginya dua pahala, dan apabila ia berhukum lalu berijtihad dan salah maka baginya satu pahala.\" Lalu aku menceritakannya kepada [Abu Bakar bin Hazm], kemudian ia berkata, \"Seperti inilah [Abu Salamah] menceritakan kepadaku dari [Abu Hurairah].\""
            },
            {
                "number": 3104,
                "arab": "حَدَّثَنَا عَبَّاسٌ الْعَنْبَرِيُّ حَدَّثَنَا عُمَرُ بْنُ يُونُسَ حَدَّثَنَا مُلَازِمُ بْنُ عَمْرٍو حَدَّثَنِي مُوسَى بْنُ نَجْدَةَ عَنْ جَدِّهِ يَزِيدُ بْنُ عَبْدِ الرَّحْمَنِ وَهُوَ أَبُو كَثِيرٍ قَالَ حَدَّثَنِي أَبُو هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ طَلَبَ قَضَاءَ الْمُسْلِمِينَ حَتَّى يَنَالَهُ ثُمَّ غَلَبَ عَدْلُهُ جَوْرَهُ فَلَهُ الْجَنَّةُ وَمَنْ غَلَبَ جَوْرُهُ عَدْلَهُ فَلَهُ النَّارُ",
                "id": "Telah menceritakan kepada kami [Abbas Al 'Anbari] telah menceritakan kepada kami [Umar bin Yunus] telah menceritakan kepada kami [Mulazim bin 'Amru] telah menceritakan kepadaku [Musa bin Najdah] dari kakeknya [Yazid bin Abdurrahman Abu Katsir] ia berkata; telah menceritakan kepadaku [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa menginginkan untuk menjadi hakim, kemudian keadilannya mengalahkan kelalimannya maka baginya Surga, dan Barangsiapa yang kelalimannya mengalahkan keadilannya maka baginya Neraka.\""
            },
            {
                "number": 3105,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ حَمْزَةَ بْنِ أَبِي يَحْيَى الرَّمْلِيُّ حَدَّثَنَا زَيْدُ بْنُ أَبِي الزَّرْقَاءِ حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ عَنْ أَبِيهِ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ{ وَمَنْ لَمْ يَحْكُمْ بِمَا أَنْزَلَ اللَّهُ فَأُولَئِكَ هُمْ الْكَافِرُونَ إِلَى قَوْلِهِ الْفَاسِقُونَ }هَؤُلَاءِ الْآيَاتِ الثَّلَاثِ نَزَلَتْ فِي الْيَهُودِ خَاصَّةً فِي قُرَيْظَةَ وَالنَّضِيرِ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Hamzah bin Abu Yahya Ar Ramli] telah menceritakan kepada kami [Zaid bin Abu Az Zarqa`] telah menceritakan kepada kami [Ibnu Az Zinad] dari [Ayahnya] dari ['Ubaidullah bin Abdullah bin 'Utbah] dari [Ibnu Abbas] ia membaca ayat: '(Barangsiapa yang tidak memutuskan menurut apa yang diturunkan Allah, maka mereka itu adalah orang-orang yang kafir) ' hingga firman Allah: '(…… orang-orang yang fasik) ' (Qs. Al Maidah: 44-47). ketiga ayat tersebut turun mengenai orang-orang Yahudi, khususnya orang-orang Bani Quraizhah dan An Nazlir.\""
            },
            {
                "number": 3106,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ وَمُحَمَّدُ بْنُ الْمُثَنَّى قَالَا أَخْبَرَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ رَجَاءٍ الْأَنْصَارِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ بِشْرٍ الْأَنْصَارِيِّ الْأَزْرَقِ قَالَدَخَلَ رَجُلَانِ مِنْ أَبْوَابِ كِنْدَةَ وَأَبُو مَسْعُودٍ الْأَنْصَارِيُّ جَالِسٌ فِي حَلْقَةٍ فَقَالَا أَلَا رَجُلٌ يُنَفِّذُ بَيْنَنَا فَقَالَ رَجُلٌ مِنْ الْحَلْقَةِ أَنَا فَأَخَذَ أَبُو مَسْعُودٍ كَفًّا مِنْ حَصًى فَرَمَاهُ بِهِ وَقَالَ مَهْ إِنَّهُ كَانَ يُكْرَهُ التَّسَرُّعُ إِلَى الْحُكْمِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala`] dan [Muhammad bin Al Mutsanna] mereka berkata; telah mengabarkan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Raja Al Anshari] dari [Abdurrahman bin Bisyr Al Anshari Al Azraq] ia berkata, \"Dua orang lelaki masuk dari beberapa pintu Kindah, sementara Abu Mas'ud Al Anshari sedang duduk di antara sekumpulan orang. Keduanya lalu berkata, \"Adakah seseorang yang memberikan keputusan di antara kami? Kemudian seorang laki-laki dari sekumpulan orang itu yang berkata, \"Aku.\" [Abu Mas'ud] kemudian mengambil segenggam kerikil lalu melemparkannya kepada orang tersebut seraya berkata, \"Tahanlah! Sesungguhnya terburu-buru dalam memberikan keputusan itu dibenci.\""
            },
            {
                "number": 3107,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا إِسْرَائِيلُ حَدَّثَنَا عَبْدُ الْأَعْلَى عَنْ بِلَالٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ طَلَبَ الْقَضَاءَ وَاسْتَعَانَ عَلَيْهِ وُكِلَ إِلَيْهِ وَمَنْ لَمْ يَطْلُبْهُ وَلَمْ يَسْتَعِنْ عَلَيْهِ أَنْزَلَ اللَّهُ مَلَكًا يُسَدِّدُهُو قَالَ وَكِيعٌ عَنْ إِسْرَائِيلَ عَنْ عَبْدِ الْأَعْلَى عَنْ بِلَالِ بْنِ أَبِي مُوسَى عَنْ أَنَسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ و قَالَ أَبُو عَوَانَةَ عَنْ عَبْدِ الْأَعْلَى عَنْ بِلَالِ بْنِ مِرْدَاسٍ الْفَزَارِيِّ عَنْ خَيْثَمَةَ الْبَصْرِيِّ عَنْ أَنَسٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] telah mengabarkan kepada kami [Israil] telah menceritakan kepada kami [Abdul A'la] dari [Bilal] dari [Anas bin Malik] ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa menginginkan untuk menjadi hakim dan ia meminta pertolongan untuk mendapatkannya, maka segala urusannya akan diserahkan kepadanya, sedangkan orang yang tidak menginginkannya dan tidak meminta pertolongan untuk mendapatkannya, maka Allah menurunkan Malaikat untuk meluruskannya.\" [Waki'] berkata dari [Israil] dari [Abul A'la] dari [Bilal bin Abu Musa] dari [Anas] dari Nabi shallallahu 'alaihi wasallam, dan [Abu 'Awanah] berkata dari [Abdul A'la] dari [Bilal bin Mirdas Al Fazari] dari [Khaitsamah Al Anshari] dari [Anas].\""
            },
            {
                "number": 3108,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا قُرَّةُ بْنُ خَالِدٍ حَدَّثَنَا حُمَيْدُ بْنُ هِلَالٍ حَدَّثَنِي أَبُو بُرْدَةَ قَالَ قَالَ أَبُو مُوسَىقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَنْ نَسْتَعْمِلَ أَوْ لَا نَسْتَعْمِلُ عَلَى عَمَلِنَا مَنْ أَرَادَهُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Yahya bin Sa'id] telah menceritakan kepada kami [Qurrah bin Khalid] telah menceritakan kepada kami [Humaid bin Hilal] telah menceritakan kepadaku [Abu Burdah] ia berkata, [Abu Musa] berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Kami tidak akan memberikan jabatan untuk mengurusi suatu pekerjaan kami kepada orang yang menginginkannya.\""
            },
            {
                "number": 3109,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ عَنْ الْحَارِثِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي سَلَمَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَلَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الرَّاشِي وَالْمُرْتَشِي",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Ibnu Abu Dzi`b] dari [Al Harits bin Abdurrahman] dari [Abu Salamah] dari [Abdullah bin 'Amru] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melaknat orang yang memberi uang sogokan dan orang yang menerimanya.\""
            },
            {
                "number": 3110,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ إِسْمَعِيلَ بْنِ أَبِي خَالِدٍ حَدَّثَنِي قَيْسٌ قَالَ حَدَّثَنِي عَدِيُّ بْنُ عُمَيْرَةَ الْكِنْدِيُّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَا أَيُّهَا النَّاسُ مَنْ عُمِّلَ مِنْكُمْ لَنَا عَلَى عَمَلٍ فَكَتَمَنَا مِنْهُ مِخْيَطًا فَمَا فَوْقَهُ فَهُوَ غُلٌّ يَأْتِي بِهِ يَوْمَ الْقِيَامَةِ فَقَامَ رَجُلٌ مِنْ الْأَنْصَارِ أَسْوَدُ كَأَنِّي أَنْظُرُ إِلَيْهِ فَقَالَ يَا رَسُولَ اللَّهِ اقْبَلْ عَنِّي عَمَلَكَ قَالَ وَمَا ذَاكَ قَالَ سَمِعْتُكَ تَقُولُ كَذَا وَكَذَا قَالَ وَأَنَا أَقُولُ ذَلِكَ مَنْ اسْتَعْمَلْنَاهُ عَلَى عَمَلٍ فَلْيَأْتِ بِقَلِيلِهِ وَكَثِيرِهِ فَمَا أُوتِيَ مِنْهُ أَخَذَهُ وَمَا نُهِيَ عَنْهُ انْتَهَى",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Isma'il bin Abu Khalid] telah menceritakan kepadaku [Qais] ia berkata; telah menceritakan kepadaku [Adi bin 'Umairah Al Kindi] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai para manusia, barangsiapa yang di antara kalian diserahi jabatan untuk mengurus pekerjaan, kemudian menyembunyikan sebuah jarum atau lebih dari itu dari kami, maka hal itu adalah sebuah pengkhianatan yang akan ia bawa pada Hari Kiamat.\" Kemudian seorang laki-laki anshar berkulit hitam berdiri seakan aku pernah melihatnya, lalu ia berkata, \"Wahai Rasulullah, terimalah dariku pekerjaan anda! Beliau bersabda: \"Apakah itu?\" laki-laki itu menjawab, \"Saya mendengar anda mengatakan demikian dan demikian.\" Beliau bersabda: \"Dan aku katakan: Barangsiapa yang kami beri jabatan untuk melakukan suatu pekerjaan maka hendaknya ia melakukan yang sedikit dan yang banyak! Lalu apa yang diberikan kepadanya boleh ia mengambilnya, dan apa yang dilarang darinya maka ia tinggalkan.\""
            },
            {
                "number": 3111,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ قَالَ أَخْبَرَنَا شَرِيكٌ عَنْ سِمَاكٍ عَنْ حَنَشٍ عَنْ عَلِيٍّ عَلَيْهِ السَّلَام قَالَبَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْيَمَنِ قَاضِيًا فَقُلْتُ يَا رَسُولَ اللَّهِ تُرْسِلُنِي وَأَنَا حَدِيثُ السِّنِّ وَلَا عِلْمَ لِي بِالْقَضَاءِ فَقَالَ إِنَّ اللَّهَ سَيَهْدِي قَلْبَكَ وَيُثَبِّتُ لِسَانَكَ فَإِذَا جَلَسَ بَيْنَ يَدَيْكَ الْخَصْمَانِ فَلَا تَقْضِيَنَّ حَتَّى تَسْمَعَ مِنْ الْآخَرِ كَمَا سَمِعْتَ مِنْ الْأَوَّلِ فَإِنَّهُ أَحْرَى أَنْ يَتَبَيَّنَ لَكَ الْقَضَاءُ قَالَ فَمَا زِلْتُ قَاضِيًا أَوْ مَا شَكَكْتُ فِي قَضَاءٍ بَعْدُ",
                "id": "Telah menceritakan kepada kami ['Amru bin 'Aun] ia berkata; telah mengabarkan kepada kami [Syarik] dari [Simak] dari [Hanasy] dari [Ali] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam mengutusku ke Yaman sebagai hakim, lalu kami katakan, \"Wahai Rasulullah, apakah anda akan mengutusku sementara saya masih muda dan tidak memiliki ilmu mengenai peradilan?\" Kemudian beliau bersabda: \"Sesungguhnya Allah akan memberi petunjuk kepada hatimu, dan meneguhkan lisanmu. Apabila ada dua orang yang berseteru duduk di hadapanmu maka janganlah engkau memberikan keputusan hingga engkau mendengar dari orang yang lain, sebagaimana engkau mendengar dari orang yang pertama, karena sesungguhnya keputusan akan lebih jelas bagimu.\" Ali berkata, \"Setelah itu aku tetap menjadi hakim atau aku tidak merasa ragu dalam memberikan keputusan.\""
            },
            {
                "number": 3112,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ عُرْوَةَ عَنْ زَيْنَبَ بِنْتِ أُمِّ سَلَمَةَ عَنْ أُمِّ سَلَمَةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا أَنَا بَشَرٌ وَإِنَّكُمْ تَخْتَصِمُونَ إِلَيَّ وَلَعَلَّ بَعْضَكُمْ أَنْ يَكُونَ أَلْحَنَ بِحُجَّتِهِ مِنْ بَعْضٍ فَأَقْضِيَ لَهُ عَلَى نَحْوِ مَا أَسْمَعُ مِنْهُ فَمَنْ قَضَيْتُ لَهُ مِنْ حَقِّ أَخِيهِ بِشَيْءٍ فَلَا يَأْخُذْ مِنْهُ شَيْئًا فَإِنَّمَا أَقْطَعُ لَهُ قِطْعَةً مِنْ النَّارِحَدَّثَنَا الرَّبِيعُ بْنُ نَافِعٍ أَبُو تَوْبَةَ حَدَّثَنَا ابْنُ الْمُبَارَكِ عَنْ أُسَامَةَ بْنِ زَيْدٍ عَنْ عَبْدِ اللَّهِ بْنِ رَافِعٍ مَوْلَى أُمِّ سَلَمَةَ عَنْ أُمِّ سَلَمَةَ قَالَتْ أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلَانِ يَخْتَصِمَانِ فِي مَوَارِيثَ لَهُمَا لَمْ تَكُنْ لَهُمَا بَيِّنَةٌ إِلَّا دَعْوَاهُمَا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ مِثْلَهُ فَبَكَى الرَّجُلَانِ وَقَالَ كُلُّ وَاحِدٍ مِنْهُمَا حَقِّي لَكَ فَقَالَ لَهُمَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَّا إِذْ فَعَلْتُمَا مَا فَعَلْتُمَا فَاقْتَسِمَا وَتَوَخَّيَا الْحَقَّ ثُمَّ اسْتَهَمَا ثُمَّ تَحَالَّا حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ أَخْبَرَنَا عِيسَى حَدَّثَنَا أُسَامَةُ عَنْ عَبْدِ اللَّهِ بْنِ رَافِعٍ قَالَ سَمِعْتُ أُمَّ سَلَمَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْحَدِيثِ قَالَ يَخْتَصِمَانِ فِي مَوَارِيثَ وَأَشْيَاءَ قَدْ دَرَسَتْ فَقَالَ إِنِّي إِنَّمَا أَقْضِي بَيْنَكُمْ بِرَأْيِي فِيمَا لَمْ يُنْزَلْ عَلَيَّ فِيهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] telah mengabarkan kepada kami [Sufyan] dari [Hisyam bin 'Urwah] dari ['Urwah] dari [Zainab binti Ummu Salamah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya aku hanyalah seorang manusia, dan kalian mengadukan permasalahannya kepadaku. Bisa jadi sebagian kalian lebih pandai dalam berdalih dari sebagian yang lain, sehingga aku memberikan keputusan untuknya sesuai dengan apa yang aku dengar darinya. Maka barangsiapa yang aku berikan suatu keputusan baginya dengan mengambil hak dari saudaranya maka janganlah ia mengambil sedikitpun darinya, karena sesungguhnya aku potongkan (api) baginya dari potongan (api) Neraka.\" Telah menceritakan kepada kami [Ar Rabi' bin Nafi' Abu Taubah] telah menceritakan kepada kami [Ibnu Al Mubarak] dari [Usamah bin Zaid] dari [Abdullah bin Rafi'] mantan budak Ummu Salamah, dari [Ummu Salamah] ia berkata, \"Dua orang laki-laki berselisih mengenai warisan mereka berdua, sementara mereka tidak memiliki bukti kecuali pengakuan mereka saja. Lalu Nabi shallallahu 'alaihi wasallam bersabda…lalu ia menyebutkan sebagaimana hadits tersebut. Kedua laki-laki tersebut kemudian menangis, lalu setiap dari mereka berkata, 'Hakku untukmu. ' Kemudian Nabi shallallahu 'alaihi wasallam berkata kepada mereka berdua: \"Adapun apabila kalian berdua melakukan apa yang telah kalian lakukan, maka bagi dan berusahalah untuk bersikap benar (adil).\" Kemudian mereka mengundi mana bagian mereka, dan mereka saling menghalalkan untuk yang lainnya.\" Telah menceritakan kepada kami [Ibrahim bin Musa Ar Razi] telah mengabarkan kepada kami [Isa] telah menceritakan kepada kami [Usamah] dari [Abdullah bin Rafi'] ia berkata, \"Aku mendengar [Ummu Salamah] dari Nabi shallallahu 'alaihi wasallam sebagaimana dalam hadits tersebut. Ia berkata, \"Mereka berdua berseteru mengenai harta warisan dan beberapa perkara yang telah usang. Kemudian beliau bersabda: \"Aku memberi putusan untuk kalian berdasarkan pendapatku semata, sesuatu yang aku belum mendapatkan wahyu tentangnya.\""
            },
            {
                "number": 3113,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ أَخْبَرَنَا ابْنُ وَهْبٍ عَنْ يُونُسَ بْنِ يَزِيدَ عَنْ ابْنِ شِهَابٍ أَنَّ عُمَرَ بْنَ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُقَالَ وَهُوَ عَلَى الْمِنْبَرِ يَا أَيُّهَا النَّاسُ إِنَّ الرَّأْيَ إِنَّمَا كَانَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُصِيبًا لِأَنَّ اللَّهَ كَانَ يُرِيهِ وَإِنَّمَا هُوَ مِنَّا الظَّنُّ وَالتَّكَلُّفُ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Daud Al Mahri] telah mengabarkan kepada kami [Ibnu Wahb] dari [Yunus bin Yazid] dari [Ibnu Syihab] bahwa [Umar bin Al Khathab] radliallahu 'anhu berada di atas mimbar dan berkata, \"Wahai para manusia, sesungguhnya jika pendapat itu berasal dari Rasulullah shallallahu 'alaihi wasallam maka ia benar adanya, sebab Allah memperlihatkan kepadanya, dan pendapat yang berasal dari kita hanyalah prasangka dan takalluf (membebani diri).\""
            },
            {
                "number": 3114,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ أَخْبَرَنَا مُعَاذُ بْنُ مُعَاذٍ قَالَأَخْبَرَنِي أَبُو عُثْمَانَ الشَّامِيُّ وَلَا إِخَالُنِي رَأَيْتُ شَأْمِيًّا أَفْضَلَ مِنْهُ يَعْنِي حُرَيْزَ بْنَ عُثْمَانَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin 'Abdah Adl Dalbbi] telah mengabarkan kepada kami [Mu'adz bin Mu'adz] ia berkata, \"Abu Utsman Asy Syami mengabarkan kepadaku, dan aku tidak pernah melihat orang yang Syam yang lebih baik darinya, yaitu Huraiz bin Utsman.\""
            },
            {
                "number": 3115,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ حَدَّثَنَا مُصْعَبُ بْنُ ثَابِتٍ عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ قَالَقَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ الْخَصْمَيْنِ يَقْعُدَانِ بَيْنَ يَدَيْ الْحَكَمِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Mani'] telah menceritakan kepada kami [Abdullah bin Al Mubarak] telah menceritakan kepada kami [Mush'ab bin Tsabit] dari [Abdullah bin Az Zubair] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam memutuskan, bahwa dua orang yang saling berselisih hendaklah duduk di hadapan hakim.\""
            },
            {
                "number": 3116,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرَةَ عَنْ أَبِيهِأَنَّهُ كَتَبَ إِلَى ابْنِهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَقْضِي الْحَكَمُ بَيْنَ اثْنَيْنِ وَهُوَ غَضْبَانُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] telah mengabarkan kepada kami [Sufyan] dari [Abdul Malik bin 'Umair] ia berkata; telah menceritakan kepada kami [Abdurrahman bin Abu Bakrah] dari [Ayahnya] bahwa ia menulis surat kepada anaknya, ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang hakim tidak boleh memberikan keputusan di antara dua orang sementara ia sedang dalam keadaan marah.\""
            },
            {
                "number": 3117,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ الْمَرْوَزِيُّ حَدَّثَنِي عَلِيُّ بْنُ حُسَيْنٍ عَنْ أَبِيهِ عَنْ يَزِيدَ النَّحْوِيِّ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ{ فَإِنْ جَاءُوكَ فَاحْكُمْ بَيْنَهُمْ أَوْ أَعْرِضْ عَنْهُمْ }فَنُسِخَتْ قَالَ{ فَاحْكُمْ بَيْنَهُمْ بِمَا أَنْزَلَ اللَّهُ }",
                "id": "Telah menceritakan kepada kami [Ahmad bin Muhammad Al Marwazi] telah menceritakan kepadaku [Ali bin Husain] dari [Ayahnya] dari [Yazid An Nahwi] dari [Ikrimah] dari [Ibnu Abbas] ia berkata, \"Ayat: '(Jika mereka (orang Yahudi) datang kepadamu (untuk meminta putusan), maka putuskanlah (perkara itu) diantara mereka, atau berpalinglah dari mereka) ' (Qs. Al Maidah: 42), dihapus dan diganti dengan ayat: '(maka putuskanlah perkara mereka menurut apa yang Allah turunkan) ' (Qs. Al Maidah: 48). "
            },
            {
                "number": 3118,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ دَاوُدَ بْنِ الْحُصَيْنِ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَلَمَّا نَزَلَتْ هَذِهِ الْآيَةُ{ فَإِنْ جَاءُوكَ فَاحْكُمْ بَيْنَهُمْ أَوْ أَعْرِضْ عَنْهُمْ }{ وَإِنْ حَكَمْتَ فَاحْكُمْ بَيْنَهُمْ بِالْقِسْطِ }الْآيَةُ قَالَ كَانَ بَنُو النَّضِيرِ إِذَا قَتَلُوا مِنْ بَنِي قُرَيْظَةَ أَدَّوْا نِصْفَ الدِّيَةِ وَإِذَا قَتَلَ بَنُو قُرَيْظَةَ مِنْ بَنِي النَّضِيرِ أَدَّوْا إِلَيْهِمْ الدِّيَةَ كَامِلَةً فَسَوَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَهُمْ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili] telah menceritakan kepada kami [Muhammad bin Salamah] dari [Muhammad bin Ishaq] dari [Daud bin Al Hushain] dari [Ikrimah] dari [Ibnu Abbas] ia berkata, \"Tatkala turun ayat ini: '(Jika mereka (orang Yahudi) datang kepadamu (untuk meminta putusan), maka putuskanlah (perkara itu) diantara mereka, atau berpalinglah dari mereka; jika kamu berpaling dari mereka maka mereka tidak akan memberi mudharat kepadamu sedikitpun. Dan jika kamu memutuskan perkara mereka, maka putuskanlah (perkara itu) diantara mereka dengan adil) ' (Qs. Al Maidah: 42), Ibnu Abbas berkata, \"Dahulu jika orang-orang Bani An Nadlir membunuh orang dari Bani Quraizhah maka mereka memberikan setengah diyat (tebusan), dan apabila Bani Quraizhah membunuh sebagian orang dari Bani An Nazlir, maka mereka menunaikan diyat secara penuh. Lalu Rasulullah shallallahu 'alaihi wasallam menyamaratakan besaran diyat di antara mereka.\""
            },
            {
                "number": 3119,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ عَنْ شُعْبَةَ عَنْ أَبِي عَوْنٍ عَنْ الْحَارِثِ بْنِ عَمْرِو ابْنِ أَخِي الْمُغِيرَةِ بْنِ شُعْبَةَ عَنْ أُنَاسٍ مِنْ أَهْلِ حِمْصَ مِنْ أَصْحَابِ مُعَاذِ بْنِ جَبَلٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا أَرَادَ أَنْ يَبْعَثَ مُعَاذًا إِلَى الْيَمَنِ قَالَ كَيْفَ تَقْضِي إِذَا عَرَضَ لَكَ قَضَاءٌ قَالَ أَقْضِي بِكِتَابِ اللَّهِ قَالَ فَإِنْ لَمْ تَجِدْ فِي كِتَابِ اللَّهِ قَالَ فَبِسُنَّةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَإِنْ لَمْ تَجِدْ فِي سُنَّةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَا فِي كِتَابِ اللَّهِ قَالَ أَجْتَهِدُ رَأْيِي وَلَا آلُو فَضَرَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَدْرَهُ وَقَالَ الْحَمْدُ لِلَّهِ الَّذِي وَفَّقَ رَسُولَ رَسُولِ اللَّهِ لِمَا يُرْضِي رَسُولَ اللَّهِحَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ شُعْبَةَ حَدَّثَنِي أَبُو عَوْنٍ عَنْ الْحَارِثِ بْنِ عَمْرٍو عَنْ نَاسٍ مِنْ أَصْحَابِ مُعَاذٍ عَنْ مُعَاذِ بْنِ جَبَلٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا بَعَثَهُ إِلَى الْيَمَنِ فَذَكَرَ مَعْنَاهُ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar] dari [Syu'bah] dari [Abu 'Aun] dari [Al Harits bin 'Amru] anak saudara Al Mughirah bin Syu'bah, dari [beberapa orang penduduk Himsh] yang merupakan sebagian dari sahabat Mu'adz bin Jabal. Bahwa Rasulullah shallallahu 'alaihi wasallam ketika akan mengutus Mu'adz bin Jabal ke Yaman beliau bersabda: \"Bagaimana engkau memberikan keputusan apabila ada sebuah peradilan yang dihadapkan kepadamu?\" Mu'adz menjawab, \"Saya akan memutuskan menggunakan Kitab Allah.\" Beliau bersabda: \"Seandainya engkau tidak mendapatkan dalam Kitab Allah?\" Mu'adz menjawab, \"Saya akan kembali kepada sunnah Rasulullah shallallahu 'alaihi wasallam.\" Beliau bersabda lagi: \"Seandainya engkau tidak mendapatkan dalam Sunnah Rasulullah shallallahu 'alaihi wasallam serta dalam Kitab Allah?\" Mu'adz menjawab, \"Saya akan berijtihad menggunakan pendapat saya, dan saya tidak akan mengurangi.\" Kemudian Rasulullah shallallahu 'alaihi wasallam menepuk dadanya dan berkata: \"Segala puji bagi Allah yang telah memberikan petunjuk kepada utusan Rasulullah untuk melakukan apa yang membuat senang Rasulullah.\" Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Syu'bah] telah menceritakan kepadaku [Abu 'Aun] dari [Al Harits bin 'Amru] dari [beberapa orang sahabat Mu'adz] dari [Mu'adz bin Jabal] bahwa Rasulullah shallallahu 'alaihi wasallam tatkala mengutusnya ke Yaman… kemudian ia menyebutkan maknanya.\""
            },
            {
                "number": 3120,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي سُلَيْمَانُ بْنُ بِلَالٍ ح و حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ الْوَاحِدِ الدِّمَشْقِيُّ حَدَّثَنَا مَرْوَانُ يَعْنِي ابْنَ مُحَمَّدٍ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ أَوْ عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ شَكَّ الشَّيْخُ عَنْ كَثِيرِ بْنِ زَيْدٍ عَنْ الْوَلِيدِ بْنِ رَبَاحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصُّلْحُ جَائِزٌ بَيْنَ الْمُسْلِمِينَ زَادَ أَحْمَدُ إِلَّا صُلْحًا أَحَلَّ حَرَامًا أَوْ حَرَّمَ حَلَالًا وَزَادَ سُلَيْمَانُ بْنُ دَاوُدَ وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُسْلِمُونَ عَلَى شُرُوطِهِمْ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Daud Al Mahri] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Sulaiman bin Bilal]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ahmad bin Abdul Wahid Ad Dimasyqi] telah menceritakan kepada kami [Marwan bin Muhammad] telah menceritakan kepada kami [Sulaiman bin Bilal] atau [Abdul Aziz bin Muhammad] -Syeikh merasa ragu- dari [Katsir bin Zaid] dari [Al Walid bin Rabah] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Perjanjian damai diperbolehkan di antara orang-orang Muslim.\" Ahmad menambahkan, \"kecuali perjanjian damai yang menghalalkan sesuatu yang haram atau mengharamkan yang halal.\" Sedangkan [Sulaiman bin Daud] menambahkan, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang-orang Muslim terikat di atas syarat-syarat mereka.\""
            },
            {
                "number": 3121,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ كَعْبِ بْنِ مَالِكٍ أَنَّ كَعْبَ بْنَ مَالِكٍ أَخْبَرَهُأَنَّهُ تَقَاضَى ابْنَ أَبِي حَدْرَدٍ دَيْنًا كَانَ عَلَيْهِ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَسْجِدِ فَارْتَفَعَتْ أَصْوَاتُهُمَا حَتَّى سَمِعَهُمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ فِي بَيْتِهِ فَخَرَجَ إِلَيْهِمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى كَشَفَ سِجْفَ حُجْرَتِهِ وَنَادَى كَعْبَ بْنَ مَالِكٍ فَقَالَ يَا كَعْبُ فَقَالَ لَبَّيْكَ يَا رَسُولَ اللَّهِ فَأَشَارَ لَهُ بِيَدِهِ أَنْ ضَعْ الشَّطْرَ مِنْ دَيْنِكَ قَالَ كَعْبٌ قَدْ فَعَلْتُ يَا رَسُولَ اللَّهِ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُمْ فَاقْضِهِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] telah mengabarkan kepadaku [Abdullah bin Ka'b bin Malik] bahwa [Ka'b bin Malik] mengabarkan kepadanya bahwa pada masa Rasulullah shallallahu 'alaihi wasallam ia pernah menuntut hutang kepada Ibnu Abu Hadrad di masjid, kemudian suara mereka meninggi hingga Rasulullah shallallahu 'alaihi wasallam mendengar mereka berdua dari dalam rumahnya. Rasulullah shallallahu 'alaihi wasallam lantas membuka tabir kamarnya dan keluar menemui mereka. Beliau memanggil Ka'b bin Malik dan berkata: \"Wahai Ka'b!\" Kemudian Ka'ab menjawab, \"Aku penuhi panggilanmu wahai Rasulullah.\" Lalu beliau memberikan isyarat kepadanya menggunakan tangannya: \"Gugurkanlah setengah hutangmu!\" Ka'b berkata, \"Aku telah melakukannya wahai Rasulullah.\" Nabi shallallahu 'alaihi wasallam kemudian bersabda: \"Berdiri dan bayarlah hutangmu kepadanya!\""
            },
            {
                "number": 3122,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ الْهَمَدَانِيُّ وأَحْمَدُ بْنُ السَّرْحِ قَالَا أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي مَالِكُ بْنُ أَنَسٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ أَنَّ أَبَاهُ أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ عُثْمَانَ بْنِ عَفَّانَ أَخْبَرَهُ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ أَبِي عَمْرَةَ الْأَنْصَارِيَّ أَخْبَرَهُ أَنَّ زَيْدَ بْنَ خَالِدٍ الْجُهَنِيَّ أَخْبَرَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَلَا أُخْبِرُكُمْ بِخَيْرِ الشُّهَدَاءِ الَّذِي يَأْتِي بِشَهَادَتِهِ أَوْ يُخْبِرُ بِشَهَادَتِهِ قَبْلَ أَنْ يُسْأَلَهَا شَكَّ عَبْدُ اللَّهِ بْنُ أَبِي بَكْرٍ أَيَّتَهُمَا قَالَقَالَ أَبُو دَاوُد قَالَ مَالِكٌ الَّذِي يُخْبِرُ بِشَهَادَتِهِ وَلَا يَعْلَمُ بِهَا الَّذِي هِيَ لَهُ قَالَ الْهَمَدَانِيُّ وَيَرْفَعُهَا إِلَى السُّلْطَانِ قَالَ ابْنُ السَّرْحِ أَوْ يَأْتِي بِهَا الْإِمَامَ وَالْإِخْبَارُ فِي حَدِيثِ الْهَمَدَانِيِّ قَالَ ابْنُ السَّرْحِ ابْنُ أَبِي عَمْرَةَ لَمْ يَقُلْ عَبْدَ الرَّحْمَنِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Sa'id Al Hamdani] dan [Ahmad bin As Sarah] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Malik bin Anas] dari [Abdullah bin Abu Bakr] bahwa [Ayahnya] mengabarkan kepadanya bahwa [Abdullah bin 'Amru bin Utsman bin 'Affan] telah mengabarkan kepadanya, bahwa [Abdurrahman bin 'Amrah Al Anshari] mengabarkan kepadanya, bahwa [Zaid bin Khalid Al Juhani] mengabarkan kepadanya, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Maukah aku beritahukan kepada kalian tentang seorang saksi terbaik yang datang membawa kesaksiannya, atau memberi kabar mengenai kesaksiannya sebelum ia ditanya mengenainya.\" -Abdullah bin Abu Bakr merasa ragu manakah di antara keduanya yang beliau sebutkan-. Abu Daud berkata, \"Malik berkata, \"Yang mengabarkan kesaksiannya, sementara orang yang memilikinya (hak untuk diberi persaksian) tidak mengetahuinya.\" [Al Hamdani] berkata, \"Ia sampaikan kepada penguasa.\" [Ibnu As As Sarh] berkata, \"Atau ia datang membawanya kepada seorang imam.\" Bentuk pengabaran ada pada hadits Al Hamdani. Ibnu As As Sarh berkata, \"Ibnu Abu 'Amrah tidak menyebutkan nama Abdurrahman.\""
            },
            {
                "number": 3123,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا عُمَارَةَ بْنِ غَزِيَّةَ عَنْ يَحْيَى بْنِ رَاشِدٍ قَالَجَلَسْنَا لِعَبْدِ اللَّهِ بْنِ عُمَرَ فَخَرَجَ إِلَيْنَا فَجَلَسَ فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ حَالَتْ شَفَاعَتُهُ دُونَ حَدٍّ مِنْ حُدُودِ اللَّهِ فَقَدْ ضَادَّ اللَّهَ وَمَنْ خَاصَمَ فِي بَاطِلٍ وَهُوَ يَعْلَمُهُ لَمْ يَزَلْ فِي سَخَطِ اللَّهِ حَتَّى يَنْزِعَ عَنْهُ وَمَنْ قَالَ فِي مُؤْمِنٍ مَا لَيْسَ فِيهِ أَسْكَنَهُ اللَّهُ رَدْغَةَ الْخَبَالِ حَتَّى يَخْرُجَ مِمَّا قَالَحَدَّثَنَا عَلِيُّ بْنُ الْحُسَيْنِ بْنِ إِبْرَاهِيمَ حَدَّثَنَا عُمَرُ بْنُ يُونُسَ حَدَّثَنَا عَاصِمُ بْنُ مُحَمَّدِ بْنِ زَيْدٍ الْعُمَرِيُّ حَدَّثَنِي الْمُثَنَّى بْنُ يَزِيدٍ عَنْ مَطَرٍ الْوَرَّاقِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَاهُ قَالَ وَمَنْ أَعَانَ عَلَى خُصُومَةٍ بِظُلْمٍ فَقَدْ بَاءَ بِغَضَبٍ مِنْ اللَّهِ عَزَّ وَجَلَّ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami ['Umarah bin Ghaziyyah] dari [Yahya bin Rasyid] ia berkata, \"Kami duduk menunggu Abdullah bin Umar, kemudian ia keluar dan duduk bersama kami, ia lalu berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang syafa'atnya menghalanginya dari mendapatkan hukuman di antara hukuman-hukuman Allah, maka sungguh ia telah menyelisihi Allah. Barangsiapa berseteru dalam kebatilan sementara ia mengetahuinya maka ia senantiasa berada dalam kemurkaan Allah hingga ia meninggalkannya. Dan barangsiapa mengatakan pada diri seorang mukmin sesuatu yang tidak ada padanya, maka Allah akan menempatkannya dalam perasan penduduk Neraka hingga ia keluar (meninggalkan) dari apa yang ia katakan.\" Telah menceritakan kepada kami [Ali bin Al Husain bin Ibrahim] telah menceritakan kepada kami [Umar bin Yunus] telah menceritakan kepada kami ['Ashim bin Muhammad bin Zaid Al 'Umari] telah menceritakan kepadaku [Al Mutsanna bin Yazid] dari [Mathar Al Warraq] dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam dengan maknanya. Ia menyebutkan, \"Barangsiapa memberikan pertolongan dalam sebuah perselisihan dengan kezhaliman maka sungguh ia telah kembali dengan membawa kemarahan Allah 'azza wajalla.\""
            },
            {
                "number": 3124,
                "arab": "حَدَّثَنِي يَحْيَى بْنُ مُوسَى الْبَلْخِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ حَدَّثَنِي سُفْيَانُ يَعْنِي الْعُصْفُرِيَّ عَنْ أَبِيهِ عَنْ حَبِيبِ بْنِ النُّعْمَانِ الْأَسَدِيِّ عَنْ خُرَيْمِ بْنِ فَاتِكٍ قَالَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الصُّبْحِ فَلَمَّا انْصَرَفَ قَامَ قَائِمًا فَقَالَ عُدِلَتْ شَهَادَةُ الزُّورِ بِالْإِشْرَاكِ بِاللَّهِ ثَلَاثَ مِرَارٍ ثُمَّ قَرَأَ{ فَاجْتَنِبُوا الرِّجْسَ مِنْ الْأَوْثَانِ وَاجْتَنِبُوا قَوْلَ الزُّورِ حُنَفَاءَ لِلَّهِ غَيْرَ مُشْرِكِينَ بِهِ }",
                "id": "Telah menceritakan kepadaku [Yahya bin Musa Al Balkhi] telah menceritakan kepada kami [Muhammad bin 'Ubaid] telah menceritakan kepadaku [Sufyan Al 'Ushfuri] dari [Ayahnya] dari [Habib bin An Nu'man Al Asadi] dari [Khuraim bin Fatik] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melakukan Shalat Subuh, selesai shalat beliau bangkit dan berkata: \"Persaksian palsu disamakan dengan perbuatan mensekutukan Allah.\" Beliau mengucapkannya sebanyak tiga kali. Kemudian beliau membaca ayat: '(Maka jauhilah olehmu berhala-berhala yang najis itu dan jauhilah perkataan-perkataan dusta dengan ikhlas kepada Allah) ' (Qs. Al Hajj: 30). "
            },
            {
                "number": 3125,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا مُحَمَّدُ بْنُ رَاشِدٍ حَدَّثَنَا سُلَيْمَانُ بْنُ مُوسَى عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَدَّ شَهَادَةَ الْخَائِنِ وَالْخَائِنَةِ وَذِي الْغِمْرِ عَلَى أَخِيهِ وَرَدَّ شَهَادَةَ الْقَانِعِ لِأَهْلِ الْبَيْتِ وَأَجَازَهَا لِغَيْرِهِمْقَالَ أَبُو دَاوُد الْغِمْرُ الْحِنَةُ وَالشَّحْنَاءُ وَالْقَانِعُ الْأَجِيرُ التَّابِعُ مِثْلُ الْأَجِيرِ الْخَاصِّ حَدَّثَنَا مُحَمَّدُ بْنُ خَلَفِ بْنِ طَارِقٍ الرَّازِيُّ حَدَّثَنَا زَيْدُ بْنُ يَحْيَى بْنِ عُبَيْدٍ الْخُزَاعِيُّ حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الْعَزِيزِ عَنْ سُلَيْمَانَ بْنِ مُوسَى بِإِسْنَادِهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَجُوزُ شَهَادَةُ خَائِنٍ وَلَا خَائِنَةٍ وَلَا زَانٍ وَلَا زَانِيَةٍ وَلَا ذِي غِمْرٍ عَلَى أَخِيهِ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar] telah menceritakan kepada kami [Muhammad bin Rasyid] telah menceritakan kepada kami [Sulaiman bin Musa] dari ['Amru bin Syu'aib] dari [Ayahnya] dari [Kakeknya] bahwa Rasulullah shallallahu 'alaihi wasallam pernah menolak persaksian orang laki-laki dan perempuan yang berkhianat serta orang yang memiliki kedengkian terhadap saudaranya. Dan beliau menolak persaksian orang yang bekerja untuk penghuni rumah, dan beliau memperbolehkan persaksian tersebut untuk orang selain mereka.\" Abu Daud berkata, \"Al Ghimru adalah permusuhan dan kebencian, sedangkan Al Qani' adalah buruh yang mengikuti seperti buruh special.\" Telah menceritakan kepada kami [Muhammad bin Khalaf bin Thariq Ar Razi] telah menceritakan kepada kami [Zaid bin Yahya bin 'Ubaid Al Khuza'i] telah menceritakan kepada kami [Sa'id bin Abdul 'Aziz] dari [Sulaiman bin Musa] dengan sanadnya, ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak boleh persaksian seorang laki-laki dan wanita yang berkhianat, dan tidak pula laki-laki serta wanita pezina dan orang yang memiliki kedengkian terhadap saudaranya.\""
            },
            {
                "number": 3126,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ الْهَمَدَانِيُّ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يَحْيَى بْنُ أَيُّوبَ وَنَافِعُ بْنُ يَزِيدَ عَنْ ابْنِ الْهَادِ عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَأَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تَجُوزُ شَهَادَةُ بَدَوِيٍّ عَلَى صَاحِبِ قَرْيَةٍ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Sa'id Al Hamdani] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yahya bin Ayyub] serta [Nafi' bin Yazid] dari [Ibnu Al Had] dari [Muhammad bin 'Amru bin 'Atha] dari ['Atha bin Yasar] dari [Abu Hurairah] bahwa ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Persaksian orang pelosok tidak berlaku untuk penduduk kota.\""
            },
            {
                "number": 3127,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ ابْنِ أَبِي مُلَيْكَةَ حَدَّثَنِي عُقْبَةُ بْنُ الْحَارِثِ وَحَدَّثَنِيهِ صَاحِبٌ لِي عَنْهُ وَأَنَا لِحَدِيثِ صَاحِبِي أَحْفَظُ قَالَتَزَوَّجْتُ أُمَّ يَحْيَى بِنْتَ أَبِي إِهَابٍ فَدَخَلَتْ عَلَيْنَا امْرَأَةٌ سَوْدَاءُ فَزَعَمَتْ أَنَّهَا أَرْضَعَتْنَا جَمِيعًا فَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرْتُ ذَلِكَ لَهُ فَأَعْرَضَ عَنِّي فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّهَا لَكَاذِبَةٌ قَالَ وَمَا يُدْرِيكَ وَقَدْ قَالَتْ مَا قَالَتْ دَعْهَا عَنْكَحَدَّثَنَا أَحْمَدُ بْنُ أَبِي شُعَيْبٍ الْحَرَّانِيُّ حَدَّثَنَا الْحَارِثُ بْنُ عُمَيْرٍ الْبَصْرِيُّ ح و حَدَّثَنَا عُثْمُانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ كِلَاهُمَا عَنْ أَيُّوبَ عَنْ ابْنِ أَبِي مُلَيْكَةَ عَنْ عُبَيْدِ بْنِ أَبِي مَرْيَمَ عَنْ عُقْبَةَ بْنِ الْحَارِثِ وَقَدْ سَمِعْتُهُ مِنْ عُقْبَةَ وَلَكِنِّي لِحَدِيثِ عُبَيْدٍ أَحْفَظُ فَذَكَرَ مَعْنَاهُ قَالَ أَبُو دَاوُد نَظَرَ حَمَّادُ بْنُ زَيْدٍ إِلَى الْحَارِثِ بْنِ عُمَيْرٍ فَقَالَ هَذَا مِنْ ثِقَاتِ أَصْحَابِ أَيُّوبَ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Ibnu Abu Mulaikah] telah menceritakan kepadaku ['Uqbah bin Al Harits] dan telah menceritakannya kepadaku [sahabatku], dan aku lebih hafal terhadap hadits sahabatku, ia berkata, \"Aku menikahi Ummu Yahya binti Abu Ihab, kemudian seorang wanita hitam datang kepadaku dan mengaku bahwa ia telah menyusui kami semua. Lalu aku datang kepada Nabi shallallahu 'alaihi wasallam dan menceritakan hal tersebut kepadanya. Beliau pun berpaling dariku, lalu aku katakan, \"Wahai Rasulullah, sesungguhnya ia telah berdusta.\" Beliau bersabda: \"Bagaimana engkau mengetahui, sementara ia telah mengatakan apa yang telah ia katakan. Tinggalkan wanita (isterimu) tersebut!\" Telah menceritakan kepada kami [Ahmad bin Abu Syu'aib Al Harrani] telah menceritakan kepada kami [Al Harits bin 'Umair Al Bashri]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Isma'il bin 'Ulaiyyah] keduanya berasal dari [Ayyub] dari [Ibnu Abu Mulaikah] dari ['Ubaid bin Abu Maryam] dari ['Uqbah bin Al Harits] aku telah mendengarnya dari 'Uqbah, akan tetapi aku lebih hafal dengan hadits 'Ubaid…lalu ia menyebutkan maknanya.\" Abu Daud berkata; [Hammad bin Zaid] melihat kepada Al Harits bin 'Umair kemudian berkata, \"Orang ini termasuk di antara sahabat-sahabat Ayyub yang tsiqah.\""
            },
            {
                "number": 3128,
                "arab": "حَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا زَكَرِيَّا عَنْ الشَّعْبِيِّأَنَّ رَجُلًا مِنْ الْمُسْلِمِينَ حَضَرَتْهُ الْوَفَاةُ بِدَقُوقَاءَ هَذِهِ وَلَمْ يَجِدْ أَحَدًا مِنْ الْمُسْلِمِينَ يُشْهِدُهُ عَلَى وَصِيَّتِهِ فَأَشْهَدَ رَجُلَيْنِ مِنْ أَهْلِ الْكِتَابِ فَقَدِمَا الْكُوفَةَ فَأَتَيَا أَبَا مُوسَى الْأَشْعَرِيَّ فَأَخْبَرَاهُ وَقَدِمَا بِتَرِكَتِهِ وَوَصِيَّتِهِ فَقَالَ الْأَشْعَرِيُّ هَذَا أَمْرٌ لَمْ يَكُنْ بَعْدَ الَّذِي كَانَ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَحْلَفَهُمَا بَعْدَ الْعَصْرِ بِاللَّهِ مَا خَانَا وَلَا كَذَبَا وَلَا بَدَّلَا وَلَا كَتَمَا وَلَا غَيَّرَا وَإِنَّهَا لَوَصِيَّةُ الرَّجُلِ وَتَرِكَتُهُ فَأَمْضَى شَهَادَتَهُمَا",
                "id": "Telah menceritakan kepada kami [Ziyad bin Ayyub] telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Zakaria] dari [Asy Sya'bi] bahwa seorang muslim meninggal di Daquqa` (daerah antara Baghdad dan Irbil), dan tidak ada seseorang yang bisa menjadi saksi terhadap wasiatnya. Kemudian ada dua orang ahli kitab memberi persaksian hingga mereka pun datang ke Kufah menemui [Abu Musa Al Asy'ari] dan mengabarkan hal tersebut. keduanya datang dengan membawa harta warisan dan wasiat orang yang meninggal tersebut, Abu Musa Al Asy'ari lalu berkata, \"Ini adalah permasalahan yang belum pernah terjadi sejak zaman Rasulullah shallallahu 'alaihi wasallam.\" Lalu Abu Musa meminta mereka berdua agar bersumpah dengan nama Allah bahwa mereka tidak berkhianat, tidak berdusta, tidak mengganti, tidak menyembunyikan serta tidak merubah, dan bahwa wasiat dan harta wasiatnya itu adalah wasiat laki-laki tersebut. Abu Musa kemudian menerima persaksian mereka berdua.\""
            },
            {
                "number": 3129,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ عَنْ مُحَمَّدِ بْنِ أَبِي الْقَاسِمِ عَنْ عَبْدِ الْمَلِكِ بْنِ سَعِيدِ بْنِ جُبَيْرٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ قَالَخَرَجَ رَجُلٌ مِنْ بَنِي سَهْمٍ مَعَ تَمِيمٍ الدَّارِيِّ وَعُدَيِّ بْنِ بَدَّاءٍ فَمَاتَ السَّهْمِيُّ بِأَرْضٍ لَيْسَ بِهَا مُسْلِمٌ فَلَمَّا قَدِمَا بِتَرِكَتِهِ فَقَدُوا جَامَ فِضَّةٍ مُخَوَّصًا بِالذَّهَبِ فَأَحْلَفَهُمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ وُجِدَ الْجَامُ بِمَكَّةَ فَقَالُوا اشْتَرَيْنَاهُ مِنْ تَمِيمٍ وَعُدَيٍّ فَقَامَ رَجُلَانِ مِنْ أَوْلِيَاءِ السَّهْمِيِّ فَحَلَفَا لَشَهَادَتُنَا أَحَقُّ مِنْ شَهَادَتِهِمَا وَإِنَّ الْجَامَ لِصَاحِبِهِمْ قَالَ فَنَزَلَتْ فِيهِمْ{ يَا أَيُّهَا الَّذِينَ آمَنُوا شَهَادَةُ بَيْنِكُمْ إِذَا حَضَرَ أَحَدَكُمْ الْمَوْتُ }الْآيَةَ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali] telah menceritakan kepada kami [Yahya bin Adam] telah menceritakan kepada kami [Ibnu Abu Zaidah] dari [Muhammad bin Abu Al Qasim] dari [Abdul Malik bin Sa'id bin Jubair] dari [Ayahnya] dari [Ibnu Abbas] ia berkata, \"Seorang laki-laki Bani Sahm keluar bersama Tamim Ad Dari dan 'Udai bin Badda, kemudian orang dari Bani Sahm tersebut meninggal di negeri yang tidak ada seorang Muslim pun di dalamnya. Kemudian tatkala mereka berdua datang dengan membawa harta warisannya mereka kehilangan gelas perak yang terukir dengan emas seperti daun kurma. Lalu Rasulullah shallallahu 'alaihi wasallam meminta mereka berdua agar bersumpah, dan gelas itu kemudian ditemukan di Makkah, keduanya lalu berkata, \"Kami membelinya dari Tamim dan 'Udai.\" Dua orang dari wali laki-laki Bani As Sahm kemudian berdiri dan bersumpah, 'Sungguh persaksian kami lebih berhak dari pada persaksian mereka berdua. ' Dan sesungguhnya gelas tersebut adalah milik sahabat mereka.\" Jubair berkata, \"Kemudian turunlah ayat: '(Hai orang-orang yang beriman, apabila salah seorang kamu menghadapi kematian, sedang dia akan berwasiat, maka hendaklah (wasiat itu) disaksikan oleh dua orang yang adil di antara kamu, atau dua orang yang berlainan agama dengan kamu, jika kamu dalam perjalanan di muka bumi lalu kamu ditimpa bahaya kematian. Kamu tahan kedua saksi itu sesudah sembahyang (untuk bersumpah), lalu mereka keduanya bersumpah dengan nama Allah, jika kamu ragu-ragu: \"(Demi Allah) kami tidak akan membeli dengan sumpah ini harga yang sedikit (untuk kepentingan seseorang), walaupun dia karib kerabat, dan tidak (pula) kami menyembunyikan persaksian Allah; sesungguhnya kami kalau demikian tentulah termasuk orang-orang yang berdosa) ' (Qs. Al Maidah: 106). "
            },
            {
                "number": 3130,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ أَنَّ الْحَكَمَ بْنَ نَافِعٍ حَدَّثَهُمْ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ عَنْ عُمَارَةَ بْنِ خُزَيْمَةَ أَنَّ عَمَّهُ حَدَّثَهُ وَهُوَ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ابْتَاعَ فَرَسًا مِنْ أَعْرَابِيٍّ فَاسْتَتْبَعَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِيَقْضِيَهُ ثَمَنَ فَرَسِهِ فَأَسْرَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَشْيَ وَأَبْطَأَ الْأَعْرَابِيُّ فَطَفِقَ رِجَالٌ يَعْتَرِضُونَ الْأَعْرَابِيَّ فَيُسَاوِمُونَهُ بِالْفَرَسِ وَلَا يَشْعُرُونَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ابْتَاعَهُ فَنَادَى الْأَعْرَابِيُّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنْ كُنْتَ مُبْتَاعًا هَذَا الْفَرَسِ وَإِلَّا بِعْتُهُ فَقَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ سَمِعَ نِدَاءَ الْأَعْرَابِيِّ فَقَالَ أَوْ لَيْسَ قَدْ ابْتَعْتُهُ مِنْكَ فَقَالَ الْأَعْرَابِيُّ لَا وَاللَّهِ مَا بِعْتُكَهُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَلَى قَدْ ابْتَعْتُهُ مِنْكَ فَطَفِقَ الْأَعْرَابِيُّ يَقُولُ هَلُمَّ شَهِيدًا فَقَالَ خُزَيْمَةُ بْنُ ثَابِتٍ أَنَا أَشْهَدُ أَنَّكَ قَدْ بَايَعْتَهُ فَأَقْبَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى خُزَيْمَةَ فَقَالَ بِمَ تَشْهَدُ فَقَالَ بِتَصْدِيقِكَ يَا رَسُولَ اللَّهِ فَجَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَهَادَةَ خُزَيْمَةَ بِشَهَادَةِ رَجُلَيْنِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris] bahwa [Al Hakam bin Nafi'] telah menceritakan kepada mereka, ia berkata; telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] dari ['Umarah bin Khuzaimah] bahwa [pamannya] seorang sahabat Nabi shallallahu 'alaihi wasallam, telah menceritakan kepadanya, bahwa Nabi shallallahu 'alaihi wasallam pernah membeli seekor kuda dari seorang Arab dusun, kemudian Nabi shallallahu 'alaihi wasallam meminta kepada Arab dusun tersebut untuk mengikutinya sehingga beliau bisa membayar kuda yang dibelinya. Rasulullah shallallahu 'alaihi wasallam berjalan cepat sementara orang Arab dusun tersebut berjalan lambat. Setelah itu orang-orang datang kepada Arab dusun itu dan menawar kudanya, dan mereka tidak mengetahui bahwa Nabi shallallahu 'alaihi wasallam telah membelinya. Arab dusun itu kemudian datang menemui Rasulullah shallallahu 'alaihi wasallam dan berkata, \"Apabila engkau membeli kuda ini maka belilah, jika tidak maka aku akan menjualnya.\" Saat mendengar panggilan Arab dusun itu Nabi shallallahu 'alaihi wasallam bangkit dan berkata: \"Bukankah aku telah membelinya darimu?\" Arab dusun itu menjawab, \"Demi Allah, tidak! Aku tidak menjualnya kepadamu.\" Nabi shallallahu 'alaihi wasallam lalu berkata: \"Benar, aku telah membelinya darimu.\" Maka Arab dusun itu pun berkata, \"Berikan kepadaku seorang saksi.\" Kemudian Khuzaimah bin Tsabit berkata, \"Aku bersaksi bahwa engkau telah menjualnya.\" Lalu Nabi shallallahu 'alaihi wasallam menghadap kepada ke arah Khuzaimah dan berkata: \"Dengan apakah engkau bersaksi?\" Khuzaimah menjawab, \"Dengan membenarkanmu wahai Rasulullah!\" Lalu Rasulullah shallallahu 'alaihi wasallam menjadikan persaksian Khuzaimah sama dengan persaksian dua orang.\""
            },
            {
                "number": 3131,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَالْحَسَنُ بْنُ عَلِيٍّ أَنَّ زَيْدَ بْنَ الْحُبَابِ حَدَّثَهُمْ حَدَّثَنَا سَيْفٌ الْمَكَّيُّ قَالَ عُثْمَانُ سَيْفُ بْنُ سُلَيْمَانَ عَنْ قَيْسِ بْنِ سَعْدٍ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى بِيَمِينٍ وَشَاهِدٍحَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى وَسَلَمَةُ بْنُ شَبِيبٍ قَالَا حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مُحَمَّدُ بْنُ مُسْلِمٍ عَنْ عَمْرِو بْنِ دِينَارٍ بِإِسْنَادِهِ وَمَعْنَاهُ قَالَ سَلَمَةُ فِي حَدِيثِهِ قَالَ عَمْرٌو فِي الْحُقُوقِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] dan [Al Hasan bin Ali] bahwa [Zaid bin Al Hubab] menceritakan kepada mereka, ia berkata; telah menceritakan kepada kami [Saiful Makki]. [Utsman Saif bin Sulaiman] berkata dari [Qais bin Sa'd] dari ['Amru bin Dinar] dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam memberikan putusan dengan adanya sumpah dan seorang saksi.\" Telah menceritakan kepada kami [Muhammad bin Yahya] dan [Salamah bin Syabib] mereka berdua berkata; telah menceritakan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Muhammad bin Muslim] dari ['Amru bin Dinar] dengan sanad dan maknanya. Salamah menyebutkan dalam haditsnya; 'Amru berkata dalam masalah hak.\""
            },
            {
                "number": 3132,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي بَكْرٍ أَبُو مُصْعَبٍ الزُّهْرِيُّ حَدَّثَنَا الدَّرَاوَرْدِيُّ عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى بِالْيَمِينِ مَعَ الشَّاهِدِقَالَ أَبُو دَاوُد وَزَادَنِي الرَّبِيعُ بْنُ سُلَيْمَانَ الْمُؤَذِّنُ فِي هَذَا الْحَدِيثِ قَالَ أَخْبَرَنِي الشَّافِعِيُّ عَنْ عَبْدِ الْعَزِيزِ قَالَ فَذَكَرْتُ ذَلِكَ لِسُهَيْلٍ فَقَالَ أَخْبَرَنِي رَبِيعَةُ وَهُوَ عِنْدِي ثِقَةٌ أَنِّي حَدَّثْتُهُ إِيَّاهُ وَلَا أَحْفَظُهُ قَالَ عَبْدُ الْعَزِيزِ وَقَدْ كَانَ أَصَابَتْ سُهَيْلًا عِلَّةٌ أَذْهَبَتْ بَعْضَ عَقْلِهِ وَنَسِيَ بَعْضَ حَدِيثِهِ فَكَانَ سُهَيْلٌ بَعْدُ يُحَدِّثُهُ عَنْ رَبِيعَةَ عَنْ أَبِيهِ حَدَّثَنَا مُحَمَّدُ بْنُ دَاوُدَ الْإِسْكَنْدَرَانِيُّ حَدَّثَنَا زِيَادٌ يَعْنِي ابْنَ يُونُسَ حَدَّثَنِي سُلَيْمَانُ بْنُ بِلَالٍ عَنْ رَبِيعَةَ بِإِسْنَادِ أَبِي مُصْعَبٍ وَمَعْنَاهُ قَالَ سُلَيْمَانُ فَلَقِيتُ سُهَيْلًا فَسَأَلْتُهُ عَنْ هَذَا الْحَدِيثِ فَقَالَ مَا أَعْرِفُهُ فَقُلْتُ لَهُ إِنَّ رَبِيعَةَ أَخْبَرَنِي بِهِ عَنْكَ قَالَ فَإِنْ كَانَ رَبِيعَةُ أَخْبَرَكَ عَنِّي فَحَدِّثْ بِهِ عَنْ رَبِيعَةَ عَنِّي",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abu Bakr Abu Mush'ab Az Zuhri] dari [Rabi'ah bin Abu Abdurrahman] dari [Suhail bin Abu Shalih] dari [Ayahnya] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam memberikan putusan dengan adanya sumpah dan satu orang saksi.\" Abu Daud berkata, \" [Ar Rabi' bin Sulaiman Al Muadzdzin] dalam haditsnya menambahkan kepadaku, ia berkata; telah mengabarkan kepadaku [Asy Syafi'i] dari [Abdul Aziz] ia berkata, \"Hal itu kemudian aku ceritakan kepada [Suhail], ia pun berkata; telah mengabarkan kepadaku [Rabi'ah] -dan ia menurutku adalah orang yang tsiqah- bahwa aku telah menceritakan hal tersebut kepadanya dan aku sudah tidak menghafalnya. Abdul Aziz berkata; Suhail telah terkena suatu penyakit yang menghilangkan sebagian ingatannya, hingga ia lupa sebagian haditsnya. Setelah itu ia menceritakan kepadanya dari Rabi'ah dari ayahnya.\" Telah menceritakan kepada kami [Muhammad bin Daud Al Iskandarani] telah menceritakan kepada kami [Ziyad bin Yunus] telah menceritakan kepadaku [Sulaiman bin Bilal] dari [Rabi'ah] dengan sanad Abu Mush'ab dan dengan maknanya. Sulaiman berkata, \"Kemudian aku bertemu dengan Suhail dan bertanya kepadanya mengenai hadits ini, lalu ia berkata, \"Aku tidak mengetahuinya.\" Lalu aku katakan kepadanya, \"Sesungguhnya Rabi'ah telah mengabarkannya kepadaku darimu.\" Ia berkata, \"Jika Rabi'ah pernah mengabarkan kepadamu dariku, maka ceritakan (riwayat) dari Rabi'ah dariku.\""
            },
            {
                "number": 3133,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ حَدَّثَنَا عَمَّارُ بْنُ شُعَيْثِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْبِ الْعَنْبَرِيُّ حَدَّثَنِي أَبِي قَالَ سَمِعْتُ جَدِّي الزُّبَيْبَ يَقُولُبَعَثَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَيْشًا إِلَى بَنِي الْعَنْبَرِ فَأَخَذُوهُمْ بِرُكْبَةَ مِنْ نَاحِيَةِ الطَّائِفِ فَاسْتَاقُوهُمْ إِلَى نَبِيِّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَكِبْتُ فَسَبَقْتُهُمْ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ السَّلَامُ عَلَيْكَ يَا نَبِيَّ اللَّهِ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ أَتَانَا جُنْدُكَ فَأَخَذُونَا وَقَدْ كُنَّا أَسْلَمْنَا وَخَضْرَمْنَا آذَانَ النَّعَمِ فَلَمَّا قَدِمَ بَلْعَنْبَرِ قَالَ لِي نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَلْ لَكُمْ بَيِّنَةٌ عَلَى أَنَّكُمْ أَسْلَمْتُمْ قَبْلَ أَنْ تُؤْخَذُوا فِي هَذِهِ الْأَيَّامِ قُلْتُ نَعَمْ قَالَ مَنْ بَيِّنَتُكَ قُلْتُ سَمُرَةُ رَجُلٌ مِنْ بَنِي الْعَنْبَرِ وَرَجُلٌ آخَرُ سَمَّاهُ لَهُ فَشَهِدَ الرَّجُلُ وَأَبَى سَمُرَةُ أَنْ يَشْهَدَ فَقَالَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ أَبَى أَنْ يَشْهَدَ لَكَ فَتَحْلِفُ مَعَ شَاهِدِكَ الْآخَرِ قُلْتُ نَعَمْ فَاسْتَحْلَفَنِي فَحَلَفْتُ بِاللَّهِ لَقَدْ أَسْلَمْنَا يَوْمَ كَذَا وَكَذَا وَخَضْرَمْنَا آذَانَ النَّعَمِ فَقَالَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اذْهَبُوا فَقَاسِمُوهُمْ أَنْصَافَ الْأَمْوَالِ وَلَا تَمَسُّوا ذَرَارِيَّهُمْ لَوْلَا أَنَّ اللَّهَ لَا يُحِبُّ ضَلَالَةَ نَمَل مَا رَزَيْنَاكُمْ عِقَالًا قَالَ الزُّبَيْبُ فَدَعَتْنِي أُمِّي فَقَالَتْ هَذَا الرَّجُلُ أَخَذَ زِرْبِيَّتِي فَانْصَرَفْتُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْنِي فَأَخْبَرْتُهُ فَقَالَ لِي احْبِسْهُ فَأَخَذْتُ بِتَلْبِيبِهِ وَقُمْتُ مَعَهُ مَكَانَنَا ثُمَّ نَظَرَ إِلَيْنَا نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَائِمَيْنِ فَقَالَ مَا تُرِيدُ بِأَسِيرِكَ فَأَرْسَلْتُهُ مِنْ يَدِي فَقَامَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لِلرَّجُلِ رُدَّ عَلَى هَذَا زِرْبِيَّةَ أُمِّهِ الَّتِي أَخَذْتَ مِنْهَا فَقَالَ يَا نَبِيَّ اللَّهِ إِنَّهَا خَرَجَتْ مِنْ يَدِي قَالَ فَاخْتَلَعَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَيْفَ الرَّجُلِ فَأَعْطَانِيهِ وَقَالَ لِلرَّجُلِ اذْهَبْ فَزِدْهُ آصُعًا مِنْ طَعَامٍ قَالَ فَزَادَنِي آصُعًا مِنْ شَعِيرٍ",
                "id": "Telah menceritakan kepada kami [Ahmad bin 'Abdah] telah menceritakan kepada kami ['Ammar bin Syu'aib bin Abdullah bin Az Zubaib Al 'Anbari] telah menceritakan kepadaku [Ayahku] ia berkata; aku mendengar kakekku [Az Zubaib] berkata, \"Nabi Allah shallallahu 'alaihi wasallam mengutus sepasukan menuju Bani Al 'Anbar, lalu pasukan tersebut menyerang mereka di Rukbah (bukit di Thaif) dari arah Thaif, pasukan itu kemudian menggiringnya menemui Nabi Allah shallallahu 'alaihi wasallam. Aku lantas mengendarai kuda dan mendahului mereka menuju Nabi shallallahu 'alaihi wasallam, dan aku ucapkan 'As salamu 'alaika wa rahmatullahi wa barakatuh wahai Nabi Allah! Pasukan anda telah datang dan menyerang kami, padahal kami telah masuk Islam dan telah memotong ujung telinga hewan-hewan ternak kami.\" Kemudian tatkala sampai di Bal'anbar Nabi Allah shallallahu 'alaihi wasallam berkata kepadaku: \"Apakah kalian memiliki bukti bahwa kalian telah masuk Islam sebelum diserang pada beberapa hari ini?\" Aku katakan, \"Ya.\" Beliau bertanya: \"Siapakah yang bisa menjadi saksi untukmu?\" Aku katakan, \"Samurah, seorang laki-laki dari Bani Al 'Anbar.\" Dan seorang laki-laki lain yang ia sebutkan. Kemudian laki-laki tersebut bersaksi sementara Samurah menolak untuk bersaksi. Nabi Allah shallallahu 'alaihi wasallam kemudian bersabda: \"Ia enggan bersaksi untukmu, maka engkau bisa bersumpah bersama saksimu yang lain.\" Aku katakan, \"Ya.\" Lalu beliau memintaku untuk bersumpah, maka aku bersumpah dengan nama Allah, 'Sungguh kami telah masuk Islam pada hari ini dan ini, dan kami telah memotong ujung telinga hewan-hewan ternak. ' Kemudian Nabi Allah shallallahu 'alaihi wasallam bersabda: \"Pergilah kalian dan bagilah untuk mereka separuh harta tersebut dan jangan kalian sentuh keturunan-keturunan mereka! Seandainya Allah tidak membenci hilangnya suatu amal maka kami tidak akan mengurangi kalian satu 'Iqalpun (tali unta).\" Az Zubaib berkata, \"Kemudian ibuku memanggilku dan berkata, \"Orang ini telah mengambil permadaniku.\" Lalu aku pergi menemui Nabi shallallahu 'alaihi wasallam dan mengabarkan hal tersebut, beliau pun berkata: \"Tahanlah dia!\" Lalu aku cengkeram bajunya, dan aku berdiri bersamanya di tempat kami. Kemudian Nabi shallallahu 'alaihi wasallam melihat kepada kami dalam keadaan berdiri, lalu beliau bersabda: \"Apa yang engkau kehendaki dengan tawananmu?\" Lalu aku melepaskannya, kemudian Nabi Allah shallallahu 'alaihi wasallam berdiri dan berkata kepada orang tersebut: \"Kembalikan kepada orang ini permadani milik ibunya yang telah engkau ambil!\" Orang tersebut berkata, \"Wahai Nabi Allah, sesungguhnya permadani tersebut telah hilang dari tanganku.\" Az Zubaib berkata, \"Kemudian Nabi Allah shallallahu 'alaihi wasallam melepas pedang laki-laki tersebut dan memberikannya kepadaku, kemudian beliau berkata kepada laki-laki itu: \"Pergi dan tambahlah beberapa sha' makanan!\" Az Zubaib berkata, \"Kemudian laki-laki itu menambahku beberapa sha' gandum.\""
            },
            {
                "number": 3134,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمِنْهَالِ الضَّرِيرُ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا ابْنُ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ سَعِيدِ بْنِ أَبِي بُرْدَةَ عَنْ أَبِيهِ عَنْ جَدِّهِ أَبِي مُوسَى الْأَشْعَرِيِّأَنَّ رَجُلَيْنِ ادَّعَيَا بَعِيرًا أَوْ دَابَّةً إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَتْ لِوَاحِدٍ مِنْهُمَا بَيِّنَةٌ فَجَعَلَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَهُمَاحَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ عَنْ سَعِيدٍ بِإِسْنَادِهِ وَمَعْنَاهُ حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ بِمَعْنَى إِسْنَادِهِ أَنَّ رَجُلَيْنِ ادَّعَيَا بَعِيرًا عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَبَعَثَ كُلُّ وَاحِدٍ مِنْهُمَا شَاهِدَيْنِ فَقَسَمَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَهُمَا نِصْفَيْنِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Minhal Adl Dlarir] telah menceritakan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Ibnu Abu 'Arubah] dari [Qatadah] dari [Sa'id bin Abu Burdah] dari [Ayahnya] dari kakeknya [Abu Musa Al Asy'ari] bahwa ada dua orang laki-laki mengklaim seekor unta atau seekor hewan kepada Nabi shallallahu 'alaihi wasallam, sementara keduanya tidak memiliki bukti. Nabi shallallahu 'alaihi wasallam lalu membagi unta tersebut untuk keduanya.\" Telah menceritakan kepada kami [Al Hasan bin Ali] telah menceritakan kepada kami [Yahya bin Adam] telah menceritakan kepada kami [Abdurrahim bin Sulaiman] dari [Sa'id] dengan sanad dan maknanya.\" Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Hajjaj bin Minhal] telah menceritakan kepada kami [Hammam] dari [Qatadah] dengan makna sanadnya, bahwa dua orang yang mengklaim seekor unta pada zaman Nabi shallallahu 'alaihi wasallam, lalu keduanya mengirimkan dua orang saksi, Nabi shallallahu 'alaihi wasallam kemudian membagi unta tersebut untuk mereka berdua.\""
            },
            {
                "number": 3135,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمِنْهَالِ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا ابْنُ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ خِلَاسٍ عَنْ أَبِي رَافِعٍ عَنْ أَبِي هُرَيْرَةَأَنَّ رَجُلَيْنِ اخْتَصَمَا فِي مَتَاعٍ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ لِوَاحِدٍ مِنْهُمَا بَيِّنَةٌ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَهِمَا عَلَى الْيَمِينِ مَا كَانَ أَحَبَّا ذَلِكَ أَوْ كَرِهَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Minhal] telah menceritakan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Ibnu Abu 'Arubah] dari [Qatadah] dari [Khilas] dari [Abu Rafi'] dari [Abu Hurairah] bahwa dua orang laki-laki mengadukan perselisihan tentang sebuah barang kepada Nabi shallallahu 'alaihi wasallam, sementara keduanya tidak memiliki bukti. Lalu Nabi shallallahu 'alaihi wasallam bersabda: \"Undilah untuk melakukan sumpah!\" Baik keduanya menyukai hal tersebut atau membencinya.\""
            },
            {
                "number": 3136,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ وَسَلَمَةُ بْنُ شَبِيبٍ قَالَا حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَحْمَدُ قَالَ حَدَّثَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا كَرِهَ الِاثْنَانِ الْيَمِينَ أَوْ اسْتَحَبَّاهَا فَلْيَسْتَهِمَا عَلَيْهَا قَالَ سَلَمَةُ قَالَ أَخْبَرَنَا مَعْمَرٌ وَقَالَ إِذَا أُكْرِهَ الِاثْنَانِ عَلَى الْيَمِينِحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ بِإِسْنَادِ ابْنِ مِنْهَالٍ مِثْلَهُ قَالَ فِي دَابَّةٍ وَلَيْسَ لَهُمَا بَيِّنَةٌ فَأَمَرَهُمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَسْتَهِمَا عَلَى الْيَمِينِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] dan [Salamah bin Syabib] mereka berkata; telah menceritakan kepada kami [Abdurrazzaq] [Ahmad] berkata; telah menceritakan kepada kami [Ma'mar] dari [Hammam bin Munabbih] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Apabila dua orang tidak senang bersumpah atau tidak menyukainya, maka hendaknya mereka berdua berundi untuk mendapatkannya.\" [Salamah] berkata; telah mengabarkan kepada kami [Ma'mar] dan ia berkata, \"Apabila dua orang dipaksa untuk bersumpah.\" Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Khalid bin Al Harits] dari [Sa'id bin Abu 'Arubah] dengan sanad Ibnu Minhal, \n\n(Yaitu; dari [Qatadah] dari [Khilas] dari [Abu Rafi'] dari [Abu Hurairah]) seperti itu. Ia menyebutkan tentang seekor hewan dan mereka tidak memiliki bukti, lalu Rasulullah shallallahu 'alaihi wasallam memerintahkan mereka berdua agar mengundi untuk mendapatkan hewan tersebut.\""
            },
            {
                "number": 3137,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ حَدَّثَنَا نَافِعُ بْنُ عُمَرَ عَنْ ابْنِ أَبِي مُلَيْكَةَ قَالَكَتَبَ إِلَيَّ ابْنُ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى بِالْيَمِينِ عَلَى الْمُدَّعَى عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah Al Al Qa'nabi] telah menceritakan kepada kami [Nafi' bin Umar] dari [Ibnu Abu Mulaikah] ia berkata, \" [Ibnu Abbas] menulis surat kepadaku bahwa Rasulullah shallallahu 'alaihi wasallam memberi putusan bahwa orang yang tertuduh harus bersumpah.\""
            },
            {
                "number": 3138,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو الْأَحْوَصِ حَدَّثَنَا عَطَاءُ بْنُ السَّائِبِ عَنْ أَبِي يَحْيَى عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَعْنِي لِرَجُلٍ حَلَّفَهُ احْلِفْ بِاللَّهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ مَا لَهُ عِنْدَكَ شَيْءٌ يَعْنِي لِلْمُدَّعِيقَالَ أَبُو دَاوُد أَبُو يَحْيَى اسْمُهُ زِيَادٌ كُوفِيٌّ ثِقَةٌ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abu Al Ahwash] telah menceritakan kepada kami ['Atha bin As Saib] dari [Abu Yahya] dari [Ibnu Abbas] bahwa Nabi shallallahu 'alaihi wasallam berkata kepada seorang laki-laki yang beliau perintahkan agar bersumpah: \"Bersumpahlah dengan nama Allah yang tidak ada tuhan yang berhak disembah melainkan Allah, bahwa ia tidak memiliki sesuatu yang diklaim ada padamu.\" Abu Daud berkata, \"Abu Yahya namanya Ziyad Kufi, ia adalah orang yang tsiqah.\""
            },
            {
                "number": 3139,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الْأَعْمَشُ عَنْ شَقِيقٍ عَنْ الْأَشْعَثِ قَالَكَانَ بَيْنِي وَبَيْنَ رَجُلٍ مِنْ الْيَهُودِ أَرْضٌ فَجَحَدَنِي فَقَدَّمْتُهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَكَ بَيِّنَةٌ قُلْتُ لَا قَالَ لِلْيَهُودِيِّ احْلِفْ قُلْتُ يَا رَسُولَ اللَّهِ إِذًا يَحْلِفُ وَيَذْهَبُ بِمَالِي فَأَنْزَلَ اللَّهُ{ إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ ثَمَنًا قَلِيلًا }إِلَى آخِرِ الْآيَةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Abu Mu'awiyah] telah menceritakan kepada kami [Al A'masy] dari [Syaqiq] dari [Al Asy'ats] ia berkata, \"Aku dan seorang laki-laki Yahudi berselisih atas sebuah lahan, kemudian ia mengingkariku. Maka aku pun datang menemui Nabi shallallahu 'alaihi wasallam dan mengadukan hal itu kepadanya, Nabi shallallahu 'alaihi wasallam lalu berkata kepadaku: \"Apakah engkau memiliki bukti?\" Aku menjawab, \"Tidak.\" Beliau bersabda kepada orang Yahudi tersebut: \"Bersumpahlah!\" Maka aku katakan, \"Wahai Rasulullah, jika demikian ia akan bersumpah dan membawa hartaku!\" Kemudian Allah menurunkan ayat: '(Sesungguhnya orang-orang yang menukar janji (nya dengan) Allah dan sumpah-sumpah mereka dengan harga yang sedikit…) ' (Qs. Ali Imran: 77) hingga akhir ayat.\""
            },
            {
                "number": 3140,
                "arab": "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ حَدَّثَنَا الْفَرْيَابِيُّ حَدَّثَنَا الْحَارِثُ بْنُ سُلَيْمَانَ حَدَّثَنِي كُرْدُوسٌ عَنْ الْأَشْعَثِ بْنِ قَيْسٍأَنَّ رَجُلًا مِنْ كِنْدَةَ وَرَجُلًا مِنْ حَضْرَمَوْتَ اخْتَصَمَا إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي أَرْضٍ مِنْ الْيَمَنِ فَقَالَ الْحَضْرَمِيُّ يَا رَسُولَ اللَّهِ إِنَّ أَرْضِي اغْتَصَبَنِيهَا أَبُو هَذَا وَهِيَ فِي يَدِهِ قَالَ هَلْ لَكَ بَيِّنَةٌ قَالَ لَا وَلَكِنْ أُحَلِّفُهُ وَاللَّهِ مَا يَعْلَمُ أَنَّهَا أَرْضِي اغْتَصَبَنِيهَا أَبُوهُ فَتَهَيَّأَ الْكِنْدِيُّ يَعْنِي لِلْيَمِينِ وَسَاقَ الْحَدِيثَ",
                "id": "Telah menceritakan kepada kami [Mahmud bin Khalid] telah menceritakan kepada kami [Al Faryabi] telah menceritakan kepada kami [Al Harits bin Sulaiman] telah menceritakan kepadaku [Kurdus] dari [Al Asy'ats bin Qais] bahwa seorang laki-laki dari Kindah dan seorang laki-laki dari Hadlramaut mengadukan perselisihan mereka tentang lahan yang ada di Yaman kepada Nabi shallallahu 'alaihi wasallam. Orang Hadlrami berkata, \"Wahai Rasulullah, sesungguhnya tanahku telah dirampas bapak orang ini. Dan tanah tersebut ada di tangannya.\" Beliau bersabda: \"Apakah engkau memiliki bukti?\" Aku katakan, \"Tidak, akan tetapi aku memintanya agar ia bersumpah. Demi Allah ia tidak mengetahui bahwa tanah tersebut adalah tanahku yang dirampas oleh bapaknya.\" Maka orang Kindah tersebut bersiap-siap untuk bersumpah…. Al Asy'ats lalu menyebutkan hadits tersebut.\""
            },
            {
                "number": 3141,
                "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ سِمَاكٍ عَنْ عَلْقَمَةَ بْنِ وَائِلِ بْنِ حُجْرٍ الْحَضْرَمِيِّ عَنْ أَبِيهِ قَالَجَاءَ رَجُلٌ مِنْ حَضْرَمَوْتَ وَرَجُلٌ مِنْ كِنْدَةَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ الْحَضْرَمِيُّ يَا رَسُولَ اللَّهِ إِنَّ هَذَا غَلَبَنِي عَلَى أَرْضٍ كَانَتْ لِأَبِي فَقَالَ الْكِنْدِيُّ هِيَ أَرْضِي فِي يَدِي أَزْرَعُهَا لَيْسَ لَهُ فِيهَا حَقٌّ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلْحَضْرَمِيِّ أَلَكَ بَيِّنَةٌ قَالَ لَا قَالَ فَلَكَ يَمِينُهُ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّهُ فَاجِرٌ لَيْسَ يُبَالِي مَا حَلَفَ لَيْسَ يَتَوَرَّعُ مِنْ شَيْءٍ فَقَالَ لَيْسَ لَكَ مِنْهُ إِلَّا ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Hannad bin As Sari] telah menceritakan kepada kami [Abu Al Ahwash] dari [Simak] dari ['Alqamah bin Wail bin Hujr Al Hadlrami] dari [Ayahnya] ia berkata, \"Seorang laki-laki Hadlramaut dan seorang laki-laki dari Kindah datang kepada Rasulullah shallallahu 'alaihi wasallam. Orang Hadlramaut tersebut berkata, \"Wahai Rasulullah, sesungguhnya orang ini telah menguasai tanah yang dahulu adalah milik ayahku.\" Kemudian orang Kindi tersebut berkata, \"Tanah itu adalah tanahku, ia ada padaku dan aku yang menanaminya, dia tidak memiliki hak pada tanah tersebut!\" 'Alqamah bin Wail berkata, \"Kemudian Nabi shallallahu 'alaihi wasallam bertanya kepada orang Hadlrami, \"Apakah engkau memiliki bukti?\" Orang Hadlrami itu menjawab, \"Tidak.\" Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Bagimu sumpahnya.\" Orang Hadlrami itu pun berkata, \"Wahai Rasulullah, dia itu orang yang suka berbuat dosa, dia tidak peduli dengan apa yang ia bersumpah atasnya! Ia tidak menjaga diri dari sesuatupun.\" Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Engkau tidak bisa melakukan apapun kecuali hanya itu.\""
            },
            {
                "number": 3142,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ حَدَّثَنَا رَجُلٌ مِنْ مُزَيْنَةَ وَنَحْنُ عِنْدَ سَعِيدِ بْنِ الْمُسَيِّبِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْنِي لِلْيَهُودِ أَنْشُدُكُمْ بِاللَّهِ الَّذِي أَنْزَلَ التَّوْرَاةَ عَلَى مُوسَى مَا تَجِدُونَ فِي التَّوْرَاةِ عَلَى مَنْ زَنَى وَسَاقَ الْحَدِيثَ فِي قِصَّةِ الرَّجْمِحَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ يَحْيَى أَبُو الْأَصْبَغِ حَدَّثَنِي مُحَمَّدٌ يَعْنِي ابْنَ سَلَمَةَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ الزُّهْرِيِّ بِهَذَا الْحَدِيثِ وَبِإِسْنَادِهِ قَالَ حَدَّثَنِي رَجُلٌ مِنْ مُزْيَنَةَ مِمَّنْ كَانَ يَتَّبِعُ الْعِلْمَ وَيَعِيهِ يُحَدِّثُ سَعِيدَ بْنَ الْمُسَيِّبِ وَسَاقَ الْحَدِيثَ بِمَعْنَاهُ حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ عِكْرِمَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهُ يَعْنِي لِابْنِ صُورِيَا أُذَكِّرُكُمْ بِاللَّهِ الَّذِي نَجَّاكُمْ مِنْ آلِ فِرْعَوْنَ وَأَقْطَعَكُمْ الْبَحْرَ وَظَلَّلَ عَلَيْكُمْ الْغَمَامَ وَأَنْزَلَ عَلَيْكُمْ الْمَنَّ وَالسَّلْوَى وَأَنْزَلَ عَلَيْكُمْ التَّوْرَاةَ عَلَى مُوسَى أَتَجِدُونَ فِي كِتَابِكُمْ الرَّجْمَ قَالَ ذَكَّرْتَنِي بِعَظِيمٍ وَلَا يَسَعُنِي أَنْ أَكْذِبَكَ وَسَاقَ الْحَدِيثَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris] telah menceritakan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] telah menceritakan kepada kami [seorang laki-laki Muzainah] -saat itu kami berada di sisi Sa'id bin Al Musayyab- dari [Abu Hurairah] ia berkata, \"Nabi shallallahu 'alaihi wasallam berkata kepada seorang Yahudi: \"Aku sumpahi kamu atas nama Allah yang telah menurunkan Taurat kepada Musa, hukuman apakah yang kalian dapatkan dalam Taurat terhadap orang yang berzina? Abu Hurairah menyebutkan terusan hadits tersebut dalam masalah rajam.\" Telah menceritakan kepada kami [Abdul Aziz bin Yahya Abu Al Ashbagh] telah menceritakan kepadaku [Muhammad bin Salamah] dari [Muhammad bin Ishaq] dari [Az Zuhri] dengan hadits ini dan dengan sanadnya. Ia berkata; telah menceritakan kepadaku [seorang laki-laki Muzainah] dari orang yang mengikuti ilmu dan memahaminya, ia menceritakan dari Sa'id bin Al Musayyab, lalu ia menyebutkan hadits tersebut dengan maknanya.\" Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Abdul A'la] telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Ikrimah] bahwa Nabi shallallahu 'alaihi wasallam berkata kepada Ibnu Shuriya: \"Aku ingatkan kalian kepada Allah yang telah menyelamatkan kalian dari keluarga Fir'aun, membelah laut untuk kalian, menaungi kalian dengan awan, menurunkan Al Mann dan As Salwa kepada kalian, serta menurunkan Taurat kepada Musa. Apakah kalian mendapatkan rajam dalam Kitab kalian?\" Ibnu Shuriya menjawab, \"Engkau telah mengingatkan aku dengan sesuatu yang agung, tidak ada alasan bagiku untuk mendustaimu….. lalu ia menyebutkan hadits tersebut.\""
            },
            {
                "number": 3143,
                "arab": "حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ نَجْدَةَ وَمُوسَى بْنُ مَرْوَانَ الرَّقِّيُّ قَالَا حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ عَنْ بَحِيرِ بْنِ سَعْدٍ عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ سَيْفٍ عَنْ عَوْفِ بْنِ مَالِكٍ أَنَّهُ حَدَّثَهُمْأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى بَيْنَ رَجُلَيْنِ فَقَالَ الْمَقْضِيُّ عَلَيْهِ لَمَّا أَدْبَرَ حَسْبِيَ اللَّهُ وَنِعْمَ الْوَكِيلُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ يَلُومُ عَلَى الْعَجْزِ وَلَكِنْ عَلَيْكَ بِالْكَيْسِ فَإِذَا غَلَبَكَ أَمْرٌ فَقُلْ حَسْبِيَ اللَّهُ وَنِعْمَ الْوَكِيلُ",
                "id": "Telah menceritakan kepada kami [Abdul Wahhab bin Najdah] dan [Musa bin Marwan Ar Raqqi] mereka berkata; telah menceritakan kepada kami [Baqiyyah bin Al Walid] dari [Bahir bin Sa'd] dari [Khalid bin Ma'dan] dari [Saif] dari ['Auf bin Malik] bahwa ia menceritakan kepada mereka, bahwa Nabi shallallahu 'alaihi wasallam telah memberikan keputusan di antara dua orang laki-laki, kemudian orang yang diputuskan atasnya ketika pergi mengatakan, \"Cukuplah Allah bagiku dan Dia adalah sebaik-baik pelindung.\" Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah mencela kelemahan, hendaklah kalian berlaku bijak, jika kalian mendapati sesuatu yang kalian tidak sukai maka ucapkanlah: HASBIALLAHU WA NI'MAL WAKIL (Cukuplah Allah bagiku dan Dia adalah sebaik-baik pelindung).\""
            },
            {
                "number": 3144,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ وَبْرِ بْنِ أَبِي دُلَيْلَةَ عَنْ مُحَمَّدِ بْنِ مَيْمُونٍ عَنْ عَمْرِو بْنِ الشَّرِيدِ عَنْ أَبِيهِعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيُّ الْوَاجِدِ يُحِلُّ عِرْضَهُ وَعُقُوبَتَهُقَالَ ابْنُ الْمُبَارَكِ يُحِلُّ عِرْضُهُ يُغَلَّظُ لَهُ وَعُقُوبَتَهُ يُحْبَسُ لَهُ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili] telah menceritakan kepada kami [Abdullah bin Al Mubarak] dari [Wabr bin Abu Dulailah] dari [Muhammad bin Maimun] dari ['Amru bin Asy Syarid] dari [Ayahnya] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Orang mampu yang menunda pembayaran hutangnya, maka kehormatan dan hukuman telah halal untuknya.\" Ibnu Al Mubarak berkata, \"Halal kehormatannya maksudnya boleh untuk mengeraskan suara (mencela), dan halal hukumannya maksudnya adalah memenjarakannya.\""
            },
            {
                "number": 3145,
                "arab": "حَدَّثَنَا مُعَاذُ بْنُ أَسَدٍ حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ أَخْبَرَنَا هِرْمَاسُ بْنُ حَبِيبٍ رَجُلٌ مِنْ أَهْلِ الْبَادِيَةِ عَنْ أَبِيهِ عَنْ جَدَّهِ قَالَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِغَرِيمٍ لِي فَقَالَ لِي الْزَمْهُ ثُمَّ قَالَ لِي يَا أَخَا بَنِي تَمِيمٍ مَا تُرِيدُ أَنْ تَفْعَلَ بِأَسِيرِكَ",
                "id": "Telah menceritakan kepada kami [Mu'adz bin Asad] telah menceritakan kepada kami [An Nadlr bin Syumail] telah mengabarkan kepada kami [Hirmas bin Habib] seorang laki-laki dari penduduk badui, dari [Ayahnya] dari [Kakeknya] ia berkata, \"Aku datang kepada Nabi shallallahu 'alaihi wasallam dengan membawa orang yang berhutang kepadaku, lalu beliau bersabda: \"Tetaplah bersamanya!\" Kemudian beliau bertanya: \"Wahai saudara Bani Tamim, apa yang engkau ingin engkau lakukan terhadap tawananmu?\""
            },
            {
                "number": 3146,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ عَنْ بَهْزِ بْنِ حَكِيمٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَبَسَ رَجُلًا فِي تُهْمَةٍ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Musa Ar Razi] telah mengabarkan kepada kami [Abdurrazzaq] dari [Ma'mar] dari [Bahz bin Hakim] dari [Ayahnya] dari [Kakeknya] bahwa Nabi shallallahu 'alaihi wasallam menahan seorang laki-laki karena suatu tuduhan.\""
            },
            {
                "number": 3147,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ قُدَامَةَ وَمُؤَمَّلُ بْنُ هِشَامٍ قَالَ ابْنُ قُدَامَةَ حَدَّثَنِي إِسْمَعِيلُ عَنْ بَهْزِ بْنِ حَكِيمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ ابْنُ قُدَامَةَ إِنَّ أَخَاهُ أَوْ عَمَّهُ وَقَالَ مُؤَمَّلٌإِنَّهُ قَامَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَخْطُبُ فَقَالَ جِيرَانِي بِمَا أُخِذُوا فَأَعْرَضَ عَنْهُ مَرَّتَيْنِ ثُمَّ ذَكَرَ شَيْئًا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَلُّوا لَهُ عَنْ جِيرَانِهِلَمْ يَذْكُرْ مُؤَمَّلٌ وَهُوَ يَخْطُبُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Qudamah] dan [Muammal bin Hisyam], [Ibnu Qudamah] berkata; telah menceritakan kepadaku [Isma'il] dari [Bahz bin Hakim] dari [Ayahnya] dari [kakeknya], Ibnu Qudamah berkata, \"Sesungguhnya saudaranya atau pamannya, sedangkan Mu`ammal berkata, \"Sesungguhnya ia bangkit menemui Nabi shallallahu 'alaihi wasallam saat beliau sedang berkhutbah. Lalu ia berkata, \"Karena apa para tetanggaku ditahan?\" kemudian beliau berpaling darinya sebanyak dua kali. Kemudian ia menyebutkan sesuatu, lalu Nabi shallallahu 'alaihi wasallam bersabda: \"Bebaskanlah para tetangganya!\" Namun Mu`ammal tidak menyebutkan lafadz, 'saat beliau sedang berkhutbah'.\""
            },
            {
                "number": 3148,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدِ بْنِ إِبْرَاهِيمَ حَدَّثَنَا عَمِّي حَدَّثَنَا أَبِي عَنْ ابْنِ إِسْحَقَ عَنْ أَبِي نُعَيْمٍ وَهْبِ بْنِ كَيْسَانَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّهُ سَمِعَهُ يُحَدِّثُ قَالَأَرَدْتُ الْخُرُوجَ إِلَى خَيْبَرَ فَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَلَّمْتُ عَلَيْهِ وَقُلْتُ لَهُ إِنِّي أَرَدْتُ الْخُرُوجَ إِلَى خَيْبَرَ فَقَالَ إِذَا أَتَيْتَ وَكِيلِي فَخُذْ مِنْهُ خَمْسَةَ عَشَرَ وَسْقًا فَإِنْ ابْتَغَى مِنْكَ آيَةً فَضَعْ يَدَكَ عَلَى تَرْقُوَتِهِ",
                "id": "Telah menceritakan kepada kami ['Ubaidullah bin Sa'dan bin Ibrahim] telah menceritakan kepada kami [Pamanku] telah menceritakan kepada kami [Ayahku] dari [Ibnu Ishaq] dari [Abu Nu'aim Wahb bin Kaisan] dari [Jabir bin Abdullah] bahwa ia mendengarnya menceritakan, ia berkata, \"Aku ingin pergi ke Khaibar, lalu aku datang menemui Rasulullah shallallahu 'alaihi wasallam, aku ucapkan salam kemudian berkata, \"Sesungguhnya aku ingin pergi ke Khaibar.\" Kemudian beliau bersabda: \"Apabila engkau datang kepada wakilku, maka ambillah darinya lima belas wasaq, dan apabila ia menginginkan tanda darimu maka letakkan tanganmu pada tulang bahunya!\" "
            },
            {
                "number": 3149,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا الْمُثَنَّى بْنُ سَعِيدٍ حَدَّثَنَا قَتَادَةُ عَنْ بُشَيْرِ بْنِ كَعْبٍ الْعَدَوِيِّ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا تَدَارَأْتُمْ فِي طَرِيقٍ فَاجْعَلُوهُ سَبْعَةَ أَذْرُعٍ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Al Mutsanna bin Sa'id] telah menceritakan kepada kami [Qatadah] dari [Busyair bin Ka'b Al 'Adawi] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika kalian berselisih dengan (batas), maka jadikanlah jalan tersebut lebarnya adalah tujuh hasta!\""
            },
            {
                "number": 3150,
                "arab": "حَدَّثَنَا مُسَدَّدٌ وَابْنُ أَبِي خَلَفٍ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اسْتَأْذَنَ أَحَدُكُمْ أَخَاهُ أَنْ يَغْرِزَ خَشَبَةً فِي جِدَارِهِ فَلَا يَمْنَعُهُ فَنَكَّسُوا فَقَالَ مَا لِي أَرَاكُمْ قَدْ أَعْرَضْتُمْ لَأُلْقِيَنَّهَا بَيْنَ أَكْتَافِكُمْقَالَ أَبُو دَاوُد وَهَذَا حَدِيثُ ابْنُ أَبِي خَلَفٍ وَهُوَ أَتَمُّ",
                "id": "Telah menceritakan kepada kami [Musaddad] dan [Ibnu Abu Khalaf] mereka berkata; telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Al A'raj] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian meminta izin kepada saudaranya untuk meletakkan kayu pada dindingnya maka izinkanlah, lalu mereka mengiyakan dengan kepalanya. Lalu dia berkata; 'Kenapa saya masih melihat kalian menolaknya. Sungguh saya akan menyampaikan kepada mereka.\" Abu Daud berkata; Ini adalah hadits Ibnu Abu Khalaf, dan merupakan yang paling lengkap. "
            },
            {
                "number": 3151,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ عَنْ يَحْيَى عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ لُؤْلُؤَةَ عَنْ أَبِي صِرْمَةَ قَالَ غَيْرَ قُتَيْبَةَ فِي هَذَا الْحَدِيثِ عَنْ أَبِي صِرْمَةَ صَاحِبِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ مَنْ ضَارَّ أَضَرَّ اللَّهُ بِهِ وَمَنْ شَاقَّ شَاقَّ اللَّهُ عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Al Laits] dari [Yahya] dari [Muhammad bin Yahya bin Habban] dari [Luluah] dari [Abu Shirmah] -selain Qutaibah telah menyebutkan hadits ini dari Shirmah- sahabat Nabi shallallahu 'alaihi wasallam, dari Nabi shallallahu 'alaihi wasallam, bahwa beliau bersabda: \"Barangsiapa menimpakan madharat (keburukan) kepada orang lain maka Allah akan menimpakan madharat kepadanya, dan barangsiapa memperberat orang lain maka Allah akan memperberat dirinya.\""
            },
            {
                "number": 3152,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْعَتَكِيُّ حَدَّثَنَا حَمَّادٌ حَدَّثَنَا وَاصِلٌ مَوْلَى أَبِي عُيَيْنَةَ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ مُحَمَّدَ بْنَ عَلِيٍّ يُحَدِّثُ عَنْ سَمُرَةَ بْنِ جُنْدُبٍأَنَّهُ كَانَتْ لَهُ عَضُدٌ مِنْ نَخْلٍ فِي حَائِطِ رَجُلٍ مِنْ الْأَنْصَارِ قَالَ وَمَعَ الرَّجُلِ أَهْلُهُ قَالَ فَكَانَ سَمُرَةُ يَدْخُلُ إِلَى نَخْلِهِ فَيَتَأَذَّى بِهِ وَيَشُقُّ عَلَيْهِ فَطَلَبَ إِلَيْهِ أَنْ يَبِيعَهُ فَأَبَى فَطَلَبَ إِلَيْهِ أَنْ يُنَاقِلَهُ فَأَبَى فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ ذَلِكَ لَهُ فَطَلَبَ إِلَيْهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَبِيعَهُ فَأَبَى فَطَلَبَ إِلَيْهِ أَنْ يُنَاقِلَهُ فَأَبَى قَالَ فَهِبْهُ لَهُ وَلَكَ كَذَا وَكَذَا أَمْرًا رَغَّبَهُ فِيهِ فَأَبَى فَقَالَ أَنْتَ مُضَارٌّ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلْأَنْصَارِيِّ اذْهَبْ فَاقْلَعْ نَخْلَهُ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Daud Al 'Ataki] telah menceritakan kepada kami [Hammad] telah menceritakan kepada kami [Washil] mantan budak Abu 'Uyainah, ia berkata; saya mendengar [Abu Ja'far Muhammad bin Ali] menceritakan dari [Samurah bin Jundub] bahwa ia dahulu memiliki pohon kurma kecil yang berada di kebun seorang laki-laki anshar.\" Samurah berkata, \"Laki-laki itu mempunyai keluarga.\" Muhammad berkata, \"Samurah pernah memasuki kebun kurmanya sehingga laki-laki Anshar tersebut merasa terganggu dan berat hati. Lalu ia meminta kepada Samurah untuk menjual pohon kurma tersebut, namun Samurah menolak. Lalu laki-laki Anshar itu meminta agar ia memindahnya, namun Samurah menolak. Maka ia pun datang menemui Nabi shallallahu 'alaihi wasallam dan menceritakan hal tersebut kepadanya. Nabi shallallahu 'alaihi wasallam kemudian meminta Samurah agar menjual pohon kurma tersebut, namun ia menolak, lalu beliau memintanya agar memindahkannya namun Samurah tetap menolak. Beliau pun bersabda: \"Berikan kepadanya dan bagimu demikian dan demikian.\" -sesuatu yang menyenangkan-, namun ia menolak. Beliau lalu bersabda: \"Engkau adalah orang yang menimbulkan madlarat (kesusahan).\" Rasulullah shallallahu 'alaihi wasallam kemudian berkata kepada orang Anshar tersebut: \"Pergi dan cabutlah pohon kurmanya!\""
            },
            {
                "number": 3153,
                "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا اللَّيْثِ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ أَنَّ عَبْدَ اللَّهِ بْنَ الزُّبَيْرِ حَدَّثَهُأَنَّ رَجُلًا خَاصَمَ الزُّبَيْرَ فِي شِرَاجِ الْحَرَّةِ الَّتِي يَسْقُونَ بِهَا فَقَالَ الْأَنْصَارِيُّ سَرِّحْ الْمَاءَ يَمُرُّ فَأَبَى عَلَيْهِ الزُّبَيْرُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلزُّبَيْرِ اسْقِ يَا زُبَيْرُ ثُمَّ أَرْسِلْ إِلَى جَارِكَ قَالَ فَغَضِبَ الْأَنْصَارِيُّ فَقَالَ يَا رَسُولَ اللَّهِ أَنْ كَانَ ابْنَ عَمَّتِكَ فَتَلَوَّنَ وَجْهُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ قَالَ اسْقِ ثُمَّ احْبِسْ الْمَاءَ حَتَّى يَرْجِعَ إِلَى الْجَدْرِفَقَالَ الزُّبَيْرُ فَوَاللَّهِ إِنِّي لَأَحْسَبُ هَذِهِ الْآيَةَ نَزَلَتْ فِي ذَلِكَ{ فَلَا وَرَبِّكَ لَا يُؤْمِنُونَ حَتَّى يُحَكِّمُوكَ }الْآيَةَ",
                "id": "Telah menceritakan kepada kami [Abu Al Walid Ath Thayalisi] telah menceritakan kepada kami [Al Laits] dari [Az Zuhri] dari ['Urwah] bahwa [Abdullah bin Az Zubair] menceritakan kepadanya, bahwa ada seorang laki-laki bermusuhan dengan Az Zubair mengenai saluran-saluran air pada tanah keras yang berbatu hitam yang mereka gunakan untuk mengairi tanaman. Kemudian orang anshar tersebut berkata, \"Biarkanlah air lewat!\" Namun Az Zubair menolak. Kemudian Rasulullah shallallahu 'alaihi wasallam berkata kepada Az Zubair: \"Siramilah tanamanmu wahai Az Zubair, kemudian alirkan kepada tetanggamu!\" Maka marahklah orang anshar tersebut, lalu ia berkata, \"Wahai Rasulullah, apakah karena ia itu anak bibimu!\" Maka rona muka Rasulullah shallallahu 'alaihi wasallam berubah, beliau bersabda: \"Siramlah tanamanmu, lalu tahanlah iar tersebut hingga ia kembali ke tempatnya semula.\" Az Zubair berkata, \"Demi Allah, sungguh aku mengira ayat ini turun mengenai hal tersebut; '(Maka demi Tuhanmu, mereka (pada hakekatnya) tidak beriman hingga mereka menjadikan kamu hakim…) ' (Qs. An Nisa: 65). "
            },
            {
                "number": 3154,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ الْوَلِيدِ يَعْنِي ابْنَ كَثِيرٍ عَنْ أَبِي مَالِكِ بْنِ ثَعْلَبَةَ عَنْ أَبِيهِ ثَعْلَبَةَ بْنِ أَبِي مَالِكٍ أَنَّهُ سَمِعَ كُبَرَاءَهُمْيَذْكُرُونَ أَنَّ رَجُلًا مِنْ قُرَيْشٍ كَانَ لَهُ سَهْمٌ فِي بَنِي قُرَيْظَةَ فَخَاصَمَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَهْزُورٍ يَعْنِي السَّيْلَ الَّذِي يَقْتَسِمُونَ مَاءَهُ فَقَضَى بَيْنَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ الْمَاءَ إِلَى الْكَعْبَيْنِ لَا يَحْبِسُ الْأَعْلَى عَلَى الْأَسْفَلِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala] telah menceritakan kepada kami [Abu Usamah] dari [Al Walid bin Katsir] dari [Abu Malik bin Tsa'labah] dari [Tsa'labah bin Malik] bahwa ia mendengar [para pembesar] mereka menyebutkan bahwa seorang laki-laki Quraisy memiliki saham pada Bani Quraizhah, kemudian ia memperkarakan kepada Rasulullah shallallahu 'alaihi wasallam mengenai aliran yang mereka berbagi dengan airnya. Kemudian Rasulullah shallallahu 'alaihi wasallam memberi putusan untuk mereka, bahwa batas genangan air adalah sebatas mata kaki, orang yang lahannya di atas tidak boleh menahan dari yang di bawah.\""
            },
            {
                "number": 3155,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ حَدَّثَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ حَدَّثَنِي أَبِي عَبْدُ الرَّحْمَنِ بْنُ الْحَارِثِ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى فِي السَّيْلِ الْمَهْزُورِ أَنْ يُمْسَكَ حَتَّى يَبْلُغَ الْكَعْبَيْنِ ثُمَّ يُرْسِلُ الْأَعْلَى عَلَى الْأَسْفَلِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin 'Abdah] telah menceritakan kepada kami [Al Mughirah bin Abdurrahman] telah menceritakan kepadaku ayahku [Abdurrahman bin Al Harits] dari ['Amru bin Syu'aib] dari [Ayahnya] dari [Kakeknya] bahwa Rasulullah shallallahu 'alaihi wasallam memberi putusan dalampembagian air, bahwa batas genangan air (pada tanaman) adalah setinggi mata kaki. Setelah itu orang yang lahannya di bagian atas memberikannya kepada orang yang lahannya di bawah.\""
            },
            {
                "number": 3156,
                "arab": "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ أَنَّ مُحَمَّدَ بْنَ عُثْمَانَ حَدَّثَهُمْ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ أَبِي طُوَالَةَ وَعَمْرُو بْنُ يَحْيَى عَنْ أَبِيهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَاخْتَصَمَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلَانِ فِي حَرِيمِ نَخْلَةٍ فِي حَدِيثِ أَحَدِهِمَا فَأَمَرَ بِهَا فَذُرِعَتْ فَوُجِدَتْ سَبْعَةَ أَذْرُعٍ وَفِي حَدِيثِ الْآخَرِ فَوُجِدَتْ خَمْسَةَ أَذْرُعٍ فَقَضَى بِذَلِكَقَالَ عَبْدُ الْعَزِيزِ فَأَمَرَ بِجَرِيدَةٍ مِنْ جَرِيدِهَا فَذُرِعَتْ",
                "id": "Telah menceritakan kepada kami [Mahmud bin Khalid] bahwa [Muhammad bin Utsman] menceritakan kepada mereka, ia berkata; telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Abu Thuwalah] dan ['Amru bin Yahya] dari [Ayahnya] dari [Abu Sa'id Al Khudri] ia berkata, \"Dua orang laki-laki mengadukan kepada Rasulullah shallallahu 'alaihi wasallam tentang batas kebun kurma mereka. Kemudian beliau memerintahkan agar mengukurnya, lalu batasan tersebut diukur dan didapati ukurannya adalah tujuh hasta. Dan dalam hadits yang lain, maka di dapati ukurannya adalah lima hasta, lalu beliau memutuskan dengan hal tersebut.\" Abdul Aziz berkata, \"Kemudian beliau memerintakan agar diambilkan salah satu dahan pohon kurma tersebut, kemudian batasan tersebut diukur.\""
            }
  ]
}