{
    "kategori": "Kitab Al Mahdi",
  "hadits": [
    {
                "number": 3731,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ عَنْ إِسْمَعِيلَ يَعْنِي ابْنَ أَبِي خَالِدٍ عَنْ أَبِيهِ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يَزَالُ هَذَا الدِّينُ قَائِمًا حَتَّى يَكُونَ عَلَيْكُمْ اثْنَا عَشَرَ خَلِيفَةً كُلُّهُمْ تَجْتَمِعُ عَلَيْهِ الْأُمَّةُ فَسَمِعْتُ كَلَامًا مِنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ أَفْهَمْهُ قُلْتُ لِأَبِي مَا يَقُولُ قَالَ كُلُّهُمْ مِنْ قُرَيْشٍ",
                "id": "Telah menceritakan kepada kami [Amru bin Utsman] berkata, telah menceritakan kepada kami [Marwan bin Mu'awiyah] dari [Isma'il] -maksudnya Ismail bin Abu Khalid- dari [Bapaknya] dari [Jabir bin Samurah] ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Agama ini akan senantiasa tegak hingga muncul di antara kalian dua belas khalifah, dan manusia akan ikut bersama mereka.\" Aku mendengar ucapan dari Nabi shallallahu 'alaihi wasallam yang tidak aku mengerti, lalu aku kepada bertanya bapakku tentang apa yang beliau katakan itu, ia (bapakku) menjawab, \"Mereka semua (para khalifah) dari bangsa Quraisy.\""
            },
            {
                "number": 3732,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا دَاوُدُ عَنْ عَامِرٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يَزَالُ هَذَا الدِّينُ عَزِيزًا إِلَى اثْنَيْ عَشَرَ خَلِيفَةً قَالَ فَكَبَّرَ النَّاسُ وَضَجُّوا ثُمَّ قَالَ كَلِمَةً خَفِيفَةً قُلْتُ لِأَبِي يَا أَبَتِ مَا قَالَ قَالَ كُلُّهُمْ مِنْ قُرَيْشٍحَدَّثَنَا ابْنُ نُفَيْلٍ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا زِيَادُ بْنُ خَيْثَمَةَ حَدَّثَنَا الْأَسْوَدُ بْنُ سَعِيدٍ الْهَمْدَانِيُّ عَنْ جَابِرِ بْنِ سَمُرَةَ بِهَذَا الْحَدِيثِ زَادَ فَلَمَّا رَجَعَ إِلَى مَنْزِلِهِ أَتَتْهُ قُرَيْشٌ فَقَالُوا ثُمَّ يَكُونُ مَاذَا قَالَ ثُمَّ يَكُونُ الْهَرْجُ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Wuhaib] berkata, telah menceritakan kepada kami [Dawud] dari [Amir] dari [Jabir bin Samurah] ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Agama ini akan tetap mulia hingga khalifah ke dua belas.\" Jabir berkata, \"Orang-orang bertakbir dan berteriak. Kemudian beliau mengatakan suatu ucapan yang pelan (hingga aku tidak mendengarnyanya, lalu aku bertanya kepada bapakku, \"Wahai bapakku, apa yang beliau katakan?\" Ia menjawab, \"Beliau mengatakan bahwa mereka dari bangsa Quraisy.\" Telah menceritakan kepada kami [Ibnu Nufail] berkata, telah menceritakan kepada kami [Zuhair] berkata, telah menceritakan kepada kami [Ziyad bin Khaitsamah] berkata, telah menceritakan kepada kami [Al Aswad bin Sa'id Al Hamdani] dari [Jabir bin Samurah] dengan hadits yang sama. Namun ia menambahkan, \"Ketika beliau kembali ke rumahnya, orang-orang Quraisy mendatanginya seraya bertanya, \"Setelah itu akan terjadi peristiwa apa?\" beliau menjawab: \"Akan terjadi pembunuhan.\""
            },
            {
                "number": 3733,
                "arab": "حَدَّثَنَا مُسَدَّدٌ أَنَّ عُمَرَ بْنَ عُبَيْدٍ حَدَّثَهُمْ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا أَبُو بَكْرٍ يَعْنِي ابْنَ عَيَّاشٍ ح و حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ ح و حَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى أَخْبَرَنَا زَائِدَةُ ح و حَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ فِطْرٍ الْمَعْنَى وَاحِدٌ كُلُّهُمْ عَنْ عَاصِمٍ عَنْ زِرٍّ عَنْ عَبْدِ اللَّهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَوْ لَمْ يَبْقَ مِنْ الدُّنْيَا إِلَّا يَوْمٌ قَالَ زَائِدَةُ فِي حَدِيثِهِ لَطَوَّلَ اللَّهُ ذَلِكَ الْيَوْمَ ثُمَّ اتَّفَقُوا حَتَّى يَبْعَثَ فِيهِ رَجُلًا مِنِّي أَوْ مِنْ أَهْلِ بَيْتِي يُوَاطِئُ اسْمُهُ اسْمِي وَاسْمُ أَبِيهِ اسْمُ أَبِي زَادَ فِي حَدِيثِ فِطْرٍ يَمْلَأُ الْأَرْضَ قِسْطًا وَعَدْلًا كَمَا مُلِئَتْ ظُلْمًا وَجَوْرًا وَقَالَ فِي حَدِيثِ سُفْيَانَ لَا تَذْهَبُ أَوْ لَا تَنْقَضِي الدُّنْيَا حَتَّى يَمْلِكَ الْعَرَبَ رَجُلٌ مِنْ أَهْلِ بَيْتِي يُوَاطِئُ اسْمُهُ اسْمِيقَالَ أَبُو دَاوُد لَفْظُ عُمَرَ وَأَبِي بَكْرٍ بِمَعْنَى سُفْيَانَ",
                "id": "Telah menceritakan kepada kami [Musaddad] bahwa [Umar bin Ubaid] menceritakan kepada mereka. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Al 'Ala] berkata, telah menceritakan kepada kami [Abu Bakr] -maksudnya Abu Bakar bin 'Ayyasy-. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Yahya] dari [Sufyan]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ahmad bin Ibrahim] berkata, telah menceritakan kepada kami [Ubaidullah bin Musa] berkata, telah mengabarkan kepada kami [Zaidah]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ahmad bin Ibrahim] berkata, telah menceritakan kepadaku [Ubaidullah bin Musa] dari [Fithr] dengan makna hadits yang sama. Dan semuanya dari [Ashim] dari [Zir] dari [Abdullah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sekiranya dunia ini tidak tersisa kecuali hanya sehari, Zaidah menyebutkan dalam haditsnya, \"maka Allah akan memanjangkan hari itu, \" kemudian mereka bersepakat -dalam menyebutkan lafadz- hingga Allah mengutus seorang laki-laki dariku, atau dari keluargaku; namanya mirip dengan namaku, dan nama bapaknya juga mirip dengan nama bapakku. Dalam hadits Fithr ditambahkan, \"Ia akan memenuhi bumi dengan keadilan, sebagaimana kezhaliman dan kelaliman pernah memenuhinya.\" Dalam hadits riwayat Sufyan beliau mengatakan: \"(Dunia) tidak akan pergi, atau tidak akan hancur hingga seorang laki-laki dari ahli baitku menguasai Arab; namanya seperti namanku.\" Abu Daud berkata; \"lafadz hadits Umar dan Abu Bakar semakna dengan lafadz Abu Sufyan.\""
            },
            {
                "number": 3734,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ حَدَّثَنَا فِطْرٌ عَنْ الْقَاسِمِ بْنِ أَبِي بَزَّةَ عَنْ أَبِي الطُّفَيْلِ عَنْ عَلِيٍ رَضِيَ اللَّهُ عَنْهُعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَوْ لَمْ يَبْقَ مِنْ الدَّهْرِ إِلَّا يَوْمٌ لَبَعَثَ اللَّهُ رَجُلًا مِنْ أَهْلِ بَيْتِي يَمْلَؤُهَا عَدْلًا كَمَا مُلِئَتْ جَوْرًا",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Al Fadhl bin Dukain] berkata, telah menceritakan kepada kami [Fithr] dari [Al Qasim bin Abu Bazzah] dari [Abu Ath Thufail] dari [Ali radliallahu 'anhu] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sekiranya dunia ini tidak lagi tersisa kecuali hanya sehari, sungguh Allah akan mengutus seorang laki-laki dari ahli baitku, ia akan memenuhi bumi dengan keadilan sebagaimana bumi pernah dipenuhi kajahatan.\""
            },
            {
                "number": 3735,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ الرَّقِّيُّ حَدَّثَنَا أَبُو الْمَلِيحِ الْحَسَنُ بْنُ عُمَرَ عَنْ زِيَادِ بْنِ بَيَانٍ عَنْ عَلِيِّ بْنِ نُفَيْلٍ عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ عَنْ أُمِّ سَلَمَةَ قَالَتْسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْمَهْدِيُّ مِنْ عِتْرَتِي مِنْ وَلَدِ فَاطِمَةَقَالَ عَبْدُ اللَّهِ بْنُ جَعْفَرٍ وَسَمِعْتُ أَبَا الْمَلِيحِ يُثْنِي عَلَى عَلِيِّ بْنِ نُفَيْلٍ وَيَذْكُرُ مِنْهُ صَلَاحًا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Ibrahim] berkata, telah menceritakan kepada kami [Abdullah bin Ja'far Ar Raqqi] berkata, telah menceritakan kepada kami [Abu Al Malih Al Hasan bin Umar] dari [Ziyad bin Bayan] dari [Ali bin Nufail] dari [Sa'id Ibnul Musayyab] dari [Ummu Salamah] ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Al Mahdi dari keturunanku, dari jalur Fatimah.\" Abdullah bin Ja'far berkata, \"Aku mendengar Abul Malih memuji Ali bin Nufail, dan ia menyebutkan akan kebaikannya.\""
            },
            {
                "number": 3736,
                "arab": "حَدَّثَنَا سَهْلُ بْنُ تَمَّامِ بْنِ بَزِيعٍ حَدَّثَنَا عِمْرَانُ الْقَطَّانُ عَنْ قَتَادَةَ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَهْدِيُّ مِنِّي أَجْلَى الْجَبْهَةِ أَقْنَى الْأَنْفِ يَمْلَأُ الْأَرْضَ قِسْطًا وَعَدْلًا كَمَا مُلِئَتْ جَوْرًا وَظُلْمًا يَمْلِكُ سَبْعَ سِنِينَ",
                "id": "Telah menceritakan kepada kami [Sahl bin Tammam bin Bazi'] berkata, telah menceritakan kepada kami [Imran Al Qaththan] dari [Qatadah] dari [Abu Nadhrah] dari [Abu Sa'id Al Khudri] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Al Mahdi itu dari keturunanku, dahinya lebar dan hidungnya mancung, ia akan memenuhi bumi dengan keadilan sebagaimana bumi pernah dipenuhi dengan kejahatan dan kezhaliman. Ia akan berkuasa selama tujuh tahun.\""
            },
            {
                "number": 3737,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنْ صَالِحٍ أَبِي الْخَلِيلِ عَنْ صَاحِبٍ لَهُ عَنْ أُمِّ سَلَمَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَكُونُ اخْتِلَافٌ عِنْدَ مَوْتِ خَلِيفَةٍ فَيَخْرُجُ رَجُلٌ مِنْ أَهْلِ الْمَدِينَةِ هَارِبًا إِلَى مَكَّةَ فَيَأْتِيهِ نَاسٌ مِنْ أَهْلِ مَكَّةَ فَيُخْرِجُونَهُ وَهُوَ كَارِهٌ فَيُبَايِعُونَهُ بَيْنَ الرُّكْنِ وَالْمَقَامِ وَيُبْعَثُ إِلَيْهِ بَعْثٌ مِنْ أَهْلِ الشَّامِ فَيُخْسَفُ بِهِمْ بِالْبَيْدَاءِ بَيْنَ مَكَّةَ وَالْمَدِينَةِ فَإِذَا رَأَى النَّاسُ ذَلِكَ أَتَاهُ أَبْدَالُ الشَّامِ وَعَصَائِبُ أَهْلِ الْعِرَاقِ فَيُبَايِعُونَهُ بَيْنَ الرُّكْنِ وَالْمَقَامِ ثُمَّ يَنْشَأُ رَجُلٌ مِنْ قُرَيْشٍ أَخْوَالُهُ كَلْبٌ فَيَبْعَثُ إِلَيْهِمْ بَعْثًا فَيَظْهَرُونَ عَلَيْهِمْ وَذَلِكَ بَعْثُ كَلْبٍ وَالْخَيْبَةُ لِمَنْ لَمْ يَشْهَدْ غَنِيمَةَ كَلْبٍ فَيَقْسِمُ الْمَالَ وَيَعْمَلُ فِي النَّاسِ بِسُنَّةِ نَبِيِّهِمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَيُلْقِي الْإِسْلَامُ بِجِرَانِهِ فِي الْأَرْضِ فَيَلْبَثُ سَبْعَ سِنِينَ ثُمَّ يُتَوَفَّى وَيُصَلِّي عَلَيْهِ الْمُسْلِمُونَقَالَ أَبُو دَاوُد قَالَ بَعْضُهُمْ عَنْ هِشَامٍ تِسْعَ سِنِينَ و قَالَ بَعْضُهُمْ سَبْعَ سِنِينَ حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا عَبْدُ الصَّمَدِ عَنْ هَمَّامٍ عَنْ قَتَادَةَ بِهَذَا الْحَدِيثِ وَقَالَ تِسْعَ سِنِينَ قَالَ أَبُو دَاوُد و قَالَ غَيْرُ مُعَاذٍ عَنْ هِشَامٍ تِسْعَ سِنِينَ حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ حَدَّثَنَا أَبُو الْعَوَّامِ حَدَّثَنَا قَتَادَةُ عَنْ أَبِي الْخَلِيلِ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ عَنْ أُمِّ سَلَمَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْحَدِيثِ وَحَدِيثُ مُعَاذٍ أَتَمُّ",
                "id": "Telah menceritakan kepada kami [Muhammad Ibnul Mutsanna] berkata, telah menceritakan kepada kami [Mu'adz bin Hisyam] berkata, telah menceritakan kepadaku [Bapakku] dari [Qatadah] dari [Shalih Abu Al Khalil] dari [Sahabatnya] dari [Ummu Salamah] isteri Nabi shallallahu 'alaihi wasallam, dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Akan terjadi perselisihan saat matinya khalifah, lalu seorang laki-laki (Al Mahdi) akan keluar dari Madinah pergi menuju Makkah. Lantas beberapa orang dari penduduk Makkah mendatanginya, mereka memaksanya keluar (dari dalam rumah) meskipun ia tidak menginginkannya. Orang-orang itu kemudian membaiatnya pada suatu tempat antara Rukun (Hajar Asawad) dan Maqam (Ibrahim). Lalu dikirimlah sepasukan dari penduduk Syam untuk memeranginya, tetapi pasukan itu justru ditenggelamkan oleh (Allah) di Al Baida, tempat antara Makkah dan Madinah. Maka ketika manusia melihat hal itu, orang-orang shalih dari Syam dan orang-orang terbaik dari penduduk Irak membaiatnya antara rukun dan Maqam. Lalu tumbuhlah seorang laki-laki dari bangsa Quraisy, paman-pamannya dari suku Kalb, ia lalu mengirimkan sepasukan untuk memerangi mereka (orang-orang yang berbaiat kepada Al mahdi) namun mereka dapat mengalahkan mereka (pasukan yang dikirim oleh lelaki Quraisy dari suku Kalb). Alangkah ruginya orang yang tidak ikut serta dalam pembagian ghanimah perang melawan suku Kalb. ia (Al Mahdi) lalu membagi ghanimah, dan membina manusia dengan sunnah Nabi mereka shallallahu 'alaihi wasallam dan menyampaikan Islam ke semua penduduk bumi. Ia berkuasa selama tujuh tahun, kemudian wafat dan dishalati oleh kaum muslimin.\" Abu Dawud berkata, \"Sebagian mereka menyebutkan dari Hisyam, \" selama sembilan tahun.\" Dan sebagian yang lain menyebutkan, \"Selama tujuh tahun.\" Telah menceritakan kepada kami [Harun bin Abdullah] berkata, telah menceritakan kepada kami [Abdu Ash Shamad] dari [Hammam] dari [Qatadah] dengan hadits yang sama. Beliau mengatakan, \"sembilan tahun.\" Abu Dawud berkata, \"Selain Mu'adz menyebutkan dari Hisyam, \"selama sembilan tahun.\" Telah menceritakan kepada kami [Ibnul Mutsanna] berkata, telah menceritakan kepada kami [Amru bin Ashim] berkata, telah menceritakan kepada kami [Abu Al Awwam] berkata, telah menceritakan kepada kami [Qatadah] dari [Abu Al Khalil] dari [Abdullah bin Al Harits] dari [Ummu Salamah] dari Nabi shallallahu 'alaihi wasallam seperti hadits ini, namun hadits Mu'adz lebih lengkap.\""
            },
            {
                "number": 3738,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ عَنْ عُبَيْدِ اللَّهِ ابْنِ الْقِبْطِيَّةِ عَنْ أُمِّ سَلَمَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقِصَّةِ جَيْشِ الْخَسْفِ قُلْتُ يَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَيْفَ بِمَنْ كَانَ كَارِهًا قَالَ يُخْسَفُ بِهِمْ وَلَكِنْ يُبْعَثُ يَوْمَ الْقِيَامَةِ عَلَى نِيَّتِهِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Jarir] dari [Abdul Aziz bin rufai'] dari [Ubaidullah bin Al Qibthiyyah] dari [Ummu Salamah] dari Nabi shallallahu 'alaihi wasallam berkenaan dengan kisah pasukan yang ditenggelamkan. Aku bertanya, \"Wahai Rasulullah shallallahu 'alaihi wasallam, bagaimana dengan orang yang terpaksa (bersama tentara yang ditenggelamkan)?\" beliau menjawab: \"Ia juga akan ditenggelamkan, hanyasaja pada hari kiamat ia akan dibangkitkan sesuai dengan niatnya.\""
            },
            {
                "number": 3739,
                "arab": "قَالَ أَبُو دَاوُد حُدِّثْتُ عَنْ هَارُونَ بْنِ الْمُغِيرَةِ قَالَ حَدَّثَنَا عَمْرُو بْنُ أَبِي قَيْسٍ عَنْ شُعَيْبِ بْنِ خَالِدٍ عَنْ أَبِي إِسْحَقَ قَالَقَالَ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُ وَنَظَرَ إِلَى ابْنِهِ الْحَسَنِ فَقَالَ إِنَّ ابْنِي هَذَا سَيِّدٌ كَمَا سَمَّاهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَسَيَخْرُجُ مِنْ صُلْبِهِ رَجُلٌ يُسَمَّى بِاسْمِ نَبِيِّكُمْ يُشْبِهُهُ فِي الْخُلُقِ وَلَا يُشْبِهُهُ فِي الْخَلْقِ ثُمَّ ذَكَرَ قِصَّةً يَمْلَأُ الْأَرْضَ عَدْلًاو قَالَ هَارُونُ حَدَّثَنَا عَمْرُو بْنُ أَبِي قَيْسٍ عَنْ مُطَرِّفِ بْنِ طَرِيفٍ عَنْ أَبِي الْحَسَنِ عَنْ هِلَالِ بْنِ عَمْرٍو قَالَ سَمِعْتُ عَلِيًّا رَضِيَ اللَّهُ عَنْهُ يَقُولُ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْرُجُ رَجُلٌ مِنْ وَرَاءِ النَّهْرِ يُقَالُ لَهُ الْحَارِثُ بْنُ حَرَّاثٍ عَلَى مُقَدِّمَتِهِ رَجُلٌ يُقَالُ لَهُ مَنْصُورٌ يُوَطِّئُ أَوْ يُمَكِّنُ لِآلِ مُحَمَّدٍ كَمَا مَكَّنَتْ قُرَيْشٌ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَجَبَ عَلَى كُلِّ مُؤْمِنٍ نَصْرُهُ أَوْ قَالَ إِجَابَتُهُ",
                "id": "Abu Dawud berkata; Aku diceritakan dari [Harun Ibnul Mughirah] ia berkata; telah menceritakan kepada kami [Amru bin Abu Qais] dari [Syu'aib bin Khalid] dari [Abu Ishaq] ia berkata; Sambil melihat puteranya Al hasan, Ali radliallahu 'anhu berkata berkata, \"Puteraku ini adalah seorang pemimpin sebagaimana yang disebutkan oleh Nabi shallallahu 'alaihi wasallam, dan akan keluar dari keturunannya seorang laki-laki yang bernama seperti nama Nabi kalian, akhlaqnya sama tetapi tidak untuk postur tubuhnya.\" Kemudian beliau menyebutkan kisahnya, \"Ia akan memenuhi bumi dengan keadilan.\" Harun berkata, \"Telah menceritakan kepada kami [Amru bin Abu Qais] dari [Mutharrif bin Tharif] dari [Abu Al Hasan] dari [Hilal bin Amru] ia berkata; Aku mendengar [Ali radliallahu 'anhu] berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Akan keluar seorang laki-laki dari seberang sungai (seperti Bukhara dan Samarqan), dia bernama Al Harits bin Hurrats, lalu setelahnya akan keluar seorang laki-laki bernama Manshur. Ia memperkokoh keluarga Muhammad sebagaimana bangsa Quraisy memperkokoh Rasulullah shallallahu 'alaihi wasallam. Maka wajib atas setiap mukmin menolongnya, atau beliau mengatakan: \"memenuhi seruannya.\""
            }
  ]
}