{
    "kategori": "Kitab Nikah",
  "hadits": [
    {
                "number": 1750,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ قَالَإِنِّي لَأَمْشِي مَعَ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ بِمِنًى إِذْ لَقِيَهُ عُثْمَانُ فَاسْتَخْلَاهُ فَلَمَّا رَأَى عَبْدُ اللَّهِ أَنْ لَيْسَتْ لَهُ حَاجَةٌ قَالَ لِي تَعَالَ يَا عَلْقَمَةُ فَجِئْتُ فَقَالَ لَهُ عُثْمَانُ أَلَا نُزَوِّجُكَ يَا أَبَا عَبْدِ الرَّحْمَنِ بِجَارِيَةٍ بِكْرٍ لَعَلَّهُ يَرْجِعُ إِلَيْكَ مِنْ نَفْسِكَ مَا كُنْتَ تَعْهَدُ فَقَالَ عَبْدُ اللَّهِ لَئِنْ قُلْتَ ذَاكَ لَقَدْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ اسْتَطَاعَ مِنْكُمْ الْبَاءَةَ فَلْيَتَزَوَّجْ فَإِنَّهُ أَغَضُّ لِلْبَصَرِ وَأَحْصَنُ لِلْفَرْجِ وَمَنْ لَمْ يَسْتَطِعْ مِنْكُمْ فَعَلَيْهِ بِالصَّوْمِ فَإِنَّهُ لَهُ وِجَاءٌ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah], telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Ibrahim] dari ['Alqamah], ia berkata; sungguh aku pernah berjalan bersama [Abdullah bin Mas'ud] di Mina, tiba-tiba ia bertemu dengan Utsman, kemudian ia mengajaknya menyendiri. Kemudian tatkala Abdullah melihat bahwa ia tidak memiliki keperluan dengannya ia berkata kepadaku; kemarilah wahai 'Alqamah! Kemudian aku datang. Kemudian Utsman berkata kepadanya; maukah kami menikahkanmu wahai Abu Abdurrahman dengan seorang gadis, agar kembali kepadamu semangat dan keperkasaanmu seperti dahulu? Kemudian Abdullah berkata; jika engkau mengatakan demikian sungguh aku telah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa di antara kalian yang memiliki kemampuan maka hendaknya ia menikah, karena hal tersebut lebih dapat menundukkan pandangannya dan lebih menjaga kemaluannya, dan barangsiapa di antara kalian yang belum mampu maka hendaknya ia berpuasa, karena puasa adalah kendali baginya.\""
            },
            {
                "number": 1751,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى يَعْنِي ابْنَ سَعِيدٍ حَدَّثَنِي عُبَيْدُ اللَّهِ حَدَّثَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تُنْكَحُ النِّسَاءُ لِأَرْبَعٍ لِمَالِهَا وَلِحَسَبِهَا وَلِجَمَالِهَا وَلِدِينِهَا فَاظْفَرْ بِذَاتِ الدِّينِ تَرِبَتْ يَدَاكَ",
                "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Yahya bin Sa'id], telah menceritakan kepadaku ['Ubaidullah], telah menceritakan kepadaku [Sa'id bin Abu Sa'id], dari [ayahnya], dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau berkata: \"Wanita dinikahi karena empat perkara, yaitu: karena hartanya, keturunannya, kecantikannya dan karena agamannya. Carilah yang memiliki agama yang baik, maka engkau akan beruntung.\""
            },
            {
                "number": 1752,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ أَخْبَرَنَا الْأَعْمَشُ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَزَوَّجْتَ قُلْتُ نَعَمْ قَالَ بِكْرًا أَمْ ثَيِّبًا فَقُلْتُ ثَيِّبًا قَالَ أَفَلَا بِكْرٌ تُلَاعِبُهَا وَتُلَاعِبُكَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal], telah menceritakan kepada kami [Abu Mu'awiyah], telah mengabarkan kepada kami [Al A'masy] dari [Salim bin Abu Al Ja'd] dari [Jabir bin Abdullah], ia berkata; Rasulullah shallallahu 'alaihi wasallam berkata kepadaku: \"Apakah engkau telah menikah?\" Aku katakan; Iya. Beliau bertanya: \"Gadis atau janda?\" Aku katakan; janda. Beliau berkata: \"Mengapa engkau tidak menikah dengan seorang gadis, sehingga engkau dapat bercanda dengannya dan dia bercanda denganmu?\""
            },
            {
                "number": 1753,
                "arab": "قَالَ أَبُو دَاوُد كَتَبَ إِلَيَّ حُسَيْنُ بْنُ حُرَيْثٍ الْمَرْوَزِيُّ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى عَنْ الْحُسَيْنِ بْنِ وَاقِدٍ عَنْ عُمَارَةَ بْنِ أَبِي حَفْصَةَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَجَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ امْرَأَتِي لَا تَمْنَعُ يَدَ لَامِسٍ قَالَ غَرِّبْهَا قَالَ أَخَافُ أَنْ تَتْبَعَهَا نَفْسِي قَالَ فَاسْتَمْتِعْ بِهَا",
                "id": "Abu Daud berkata; [Husain bin Huraits Al Marwazi] menulis surat kepadaku; telah menceritakan kepada kami [Al Fadhl bin Musa] dari [Al Husain bin Waqid] dari ['Umarah bin Abu Hafsh] dari [Ikrimah] dari [Ibnu Abbas], ia berkata; seorang laki-laki datang kepada Nabi shallallahu 'alaihi wasallam dan berkata; istriku tidak menolak tangan orang yang menyentuhnya. Beliau menjawab: Ceraikanlah dia! Dia berkata lagi; aku khawatir diriku sangat berhasrat kepadanya (sangat mencintainya). Beliau berkata: \"Kalau begitu, bersenang-senanglah dengannya!\""
            },
            {
                "number": 1754,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا مُسْتَلِمُ بْنُ سَعِيدٍ ابْنَ أُخْتِ مَنْصُورِ بْنِ زَاذَانَ عَنْ مَنْصُورٍ يَعْنِي ابْنَ زَاذَانَ عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ عَنْ مَعْقِلِ بْنِ يَسَارٍ قَالَجَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنِّي أَصَبْتُ امْرَأَةً ذَاتَ حَسَبٍ وَجَمَالٍ وَإِنَّهَا لَا تَلِدُ أَفَأَتَزَوَّجُهَا قَالَ لَا ثُمَّ أَتَاهُ الثَّانِيَةَ فَنَهَاهُ ثُمَّ أَتَاهُ الثَّالِثَةَ فَقَالَ تَزَوَّجُوا الْوَدُودَ الْوَلُودَ فَإِنِّي مُكَاثِرٌ بِكُمْ الْأُمَمَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Ibrahim], telah menceritakan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Mustalim bin Sa'id anak saudari Manshur bin Zadzan], dari [Manshur bin Zadzan] dari [Mu'awiyah bin Qurrah] dari [Ma'qil bin Yasar], ia berkata; seorang laki-laki datang kepada Nabi Shallallahu 'alaihi sallam lalu berkata; sesungguhnya aku mendapati seorang wanita yang mempunyai keturunan yang baik dan cantik, akan tetapi dia mandul, apakah aku boleh menikahinya? Beliau menjawab: \"Tidak.\" Kemudian dia datang lagi kedua kalinya dan beliau melarangnya, kemudian ia datang ketiga kalinya lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Nikahkanlah wanita-wanita yang penyayang dan subur (banyak keturunan), karena aku akan berbangga kepada umat yang lain dengan banyaknya kalian.\""
            },
            {
                "number": 1755,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُحَمَّدٍ التَّيْمِيُّ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ بْنِ الْأَخْنَسِ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ مَرْثَدَ بْنَ أَبِي مَرْثَدٍ الْغَنَوِيَّ كَانَ يَحْمِلُ الْأَسَارَى بِمَكَّةَ وَكَانَ بِمَكَّةَ بَغِيٌّ يُقَالُ لَهَا عَنَاقُ وَكَانَتْ صَدِيقَتَهُ قَالَ جِئْتُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ أَنْكِحُ عَنَاقَ قَالَ فَسَكَتَ عَنِّي فَنَزَلَتْ{ وَالزَّانِيَةُ لَا يَنْكِحُهَا إِلَّا زَانٍ أَوْ مُشْرِكٌ }فَدَعَانِي فَقَرَأَهَا عَلَيَّ وَقَالَ لَا تَنْكِحْهَا",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Muhammad At Taimi], telah menceritakan kepada kami [Yahya], dari ['Ubaidullah bin Al Akhnas] dari ['Amr bin Syu'aib] dari [ayahnya], dari [kakeknya] bahwa Martsad bin Abu Martsad Al Ghanawi membawa tawanan dari Mekkah dan di Mekkah terdapat seorang pelacur yang dikenal dengan nama 'Anaq dan dia dahulu adalah teman wanitanya. Martsad berkata; Aku menemui Nabi Shallallahu 'alaihi sallam lalu aku berkata; wahai Rasulullah, bolehkah aku menikahi 'Anaq? Martsad berkata; kemudian beliau diam, lalu turun ayat: \" Seorang wanita pezina tidaklah boleh dinikahi kecuali oleh seorang laki-laki pezina atau orang musyrik\". Lalu beliau memanggilku dan membacakan ayat tersebut di hadapanku seraya bersabda, \"Janganlah kamu menikahinya.\""
            },
            {
                "number": 1756,
                "arab": "حَدَّثَنَا مُسَدَّدٌ وَأَبُو مَعْمَرٍ قَالَا حَدَّثَنَا عَبْدُ الْوَارِثِ عَنْ حَبِيبٍ حَدَّثَنِي عَمْرُو بْنُ شُعَيْبٍ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَنْكِحُ الزَّانِي الْمَجْلُودُ إِلَّا مِثْلَهُو قَالَ أَبُو مَعْمَرٍ حَدَّثَنِي حَبِيبٌ الْمُعَلِّمُ عَنْ عَمْرِو بْنِ شُعَيْبٍ",
                "id": "Telah menceritakan kepada kami [Musaddad] dan [Abu Ma'mar], mereka berkata; telah menceritakan kepada kami [Abdul Warits] dari [Habib], telah menceritakan kepadaku ['Amr bin Syu'aib] dari [Sa'id Al Maqburi] dari [Abu Hurairah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang pezina yang didera tidak boleh menikah kecuali dengan wanita seperti dirinya.\" [Abu Ma'mar] berkata; telah menceritakan kepadaku [Habib Al Mu'allim] dari ['Amr bin Syu'aib]. "
            },
            {
                "number": 1757,
                "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ حَدَّثَنَا عَبْثَرٌ عَنْ مُطَرِّفٍ عَنْ عَامِرٍ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَى قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَعْتَقَ جَارِيَتَهُ وَتَزَوَّجَهَا كَانَ لَهُ أَجْرَانِ",
                "id": "Telah menceritakan kepada kami [Hannad bin As Sari], telah menceritakan kepada kami ['Abtsar] dari [Mutharrif] dari ['Amir] dari [Abu Burdah] dari [Abu Musa], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang membebaskan budak wanita dan menikahinya, maka baginya dua pahala.\""
            },
            {
                "number": 1758,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ وَعَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْتَقَ صَفِيَّةَ وَجَعَلَ عِتْقَهَا صَدَاقَهَا",
                "id": "Telah menceritakan kepada kami ['Amr bin 'Aun], telah mengabarkan kepada kami [Abu 'Awanah] dari [Qatadah] dan [Abdul Aziz bin Shuhaib] dari [Anas bin Malik] bahwa Nabi shallallahu 'alaihi wasallam telah membebaskan Shafiyyah dan menjadikan pembebasannya sebagai maharnya. "
            },
            {
                "number": 1759,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَحْرُمُ مِنْ الرَّضَاعَةِ مَا يَحْرُمُ مِنْ الْوِلَادَةِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik] dari [Abdullah bin Dinar] dari [Sulaiman bin Yasar] dari ['Urwah] dari [Aisyah] isteri Nabi shallallahu 'alaihi wasallam bahwa Nabi shallallahu 'alaihi wasallam berkata: \"Sesuatu yang diharamkan karena persusuan, diharamkan seperti (diharamkan) karena nasab (keturunan).\""
            },
            {
                "number": 1760,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا زُهَيْرٌ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ عُرْوَةَ عَنْ زَيْنَبَ بِنْتِ أُمِّ سَلَمَةَ عَنْ أُمِّ سَلَمَةَأَنَّ أُمَّ حَبِيبَةَ قَالَتْ يَا رَسُولَ اللَّهِ هَلْ لَكَ فِي أُخْتِي قَالَ فَأَفْعَلُ مَاذَا قَالَتْ فَتَنْكِحُهَا قَالَ أُخْتَكِ قَالَتْ نَعَمْ قَالَ أَوَتُحِبِّينَ ذَلِكَ قَالَتْ لَسْتُ بِمُخْلِيَةٍ بِكَ وَأَحَبُّ مَنْ شَرِكَنِي فِي خَيْرٍ أُخْتِي قَالَ فَإِنَّهَا لَا تَحِلُّ لِي قَالَتْ فَوَاللَّهِ لَقَدْ أُخْبِرْتُ أَنَّكَ تَخْطُبُ دُرَّةَ أَوْ ذُرَّةَ شَكَّ زُهَيْرٌ بِنْتَ أَبِي سَلَمَةَ قَالَ بِنْتَ أُمِّ سَلَمَةَ قَالَتْ نَعَمْ قَالَ أَمَا وَاللَّهِ لَوْ لَمْ تَكُنْ رَبِيبَتِي فِي حِجْرِي مَا حَلَّتْ لِي إِنَّهَا ابْنَةُ أَخِي مِنْ الرَّضَاعَةِ أَرْضَعَتْنِي وَأَبَاهَا ثُوَيْبَةُ فَلَا تَعْرِضْنَ عَلَيَّ بَنَاتِكُنَّ وَلَا أَخَوَاتِكُنَّ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili], telah menceritakan kepada kami [Zuhair], dari [Hisyam bin 'Urwah] dari ['Urwah] dari [Zainab binti Ummu Salamah] bahwa [Ummu Salamah] berkata; wahai Rasulullah, apakah engkau memiliki keinginan terhadap saudariku? Beliau berkata: \"Apa yang meski aku lakukan?\" Ia berkata; engkau menikahinya. Beliau berkata: \"Saudarimu?\" Ia berkata; Iya. Beliau berkata: \"Apakah engkau menginginkan hal tersebut?\" Ia berkata; bukan aku saja yang memilikimu, dan orang yang paling aku sukai untuk bersekutu denganku dalam kebaikan adalah saudariku. Beliau bersabda: \"Ia tidak halal bagiku.\" Ummu Habibah berkata; sungguh aku telah diberitahu bahwa engkau hendak meminang Durrah atau Dzurrah -Zuhair merasa ragu dalam hal tersebut- binti Abu Salamah. Beliau berkata: \"Binti Ummu Salamah?\" Ia berkata; Iya. Beliau berkata: \"Ketahuilah, demi Allah, seandainya ia bukan anak isteriku yang ada dalam pemeliharaanku, tidaklah ia halal bagiku, karena ia adalah anak saudaraku sepersusuan. Aku dan ayahnya telah disusui oleh Tsuwaibah, maka janganlah kalian menawarkan anak-anak dan saudara-saudara wanita kalian kepadaku."
            },
            {
                "number": 1761,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ الْعَبْدِيُّ أَخْبَرَنَا سُفْيَانُ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ عُرْوَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْدَخَلَ عَلَيَّ أَفْلَحُ بْنُ أَبِي الْقُعَيْسِ فَاسْتَتَرْتُ مِنْهُ قَالَ تَسْتَتِرِينَ مِنِّي وَأَنَا عَمُّكِ قَالَتْ قُلْتُ مِنْ أَيْنَ قَالَ أَرْضَعَتْكِ امْرَأَةُ أَخِي قَالَتْ إِنَّمَا أَرْضَعَتْنِي الْمَرْأَةُ وَلَمْ يُرْضِعْنِي الرَّجُلُ فَدَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَحَدَّثْتُهُ فَقَالَ إِنَّهُ عَمُّكِ فَلْيَلِجْ عَلَيْكِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir Al 'Abdi], telah mengabarkan kepada kami [Sufyan] dari [Hisyam bin 'Urwah] dari ['Urwah] dari [Aisyah] radliallahu 'anha, ia berkata; Aflah bin Abu Al Qu'ais menemuiku, kemudian aku menutup diri darinya. Ia berkata; apakah engkau menutup diri dariku? Aku adalah pamanmu. Aisyah berkata; aku katakan; dari mana? Ia berkata; engkau telah disusui isteri saudaraku. Aisyah berkata; sesungguhnya aku disusui oleh seorang wanita dan tidak disusui oleh seorang laki-laki. Kemudian Rasulullah shallallahu 'alaihi wasallam menemuiku dan aku menceritakannya kepada beliau. Lalu beliau berkata: \"Sesungguhnya ia adalah pamanmu, maka silahkan ia menemuimu.\""
            },
            {
                "number": 1762,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ ح و حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ أَشْعَثَ بْنِ سُلَيْمٍ عَنْ أَبِيهِ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ الْمَعْنَى وَاحِدٌأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا وَعِنْدَهَا رَجُلٌ قَالَ حَفْصٌ فَشَقَّ ذَلِكَ عَلَيْهِ وَتَغَيَّرَ وَجْهُهُ ثُمَّ اتَّفَقَا قَالَتْ يَا رَسُولَ اللَّهِ إِنَّهُ أَخِي مِنْ الرَّضَاعَةِ فَقَالَ انْظُرْنَ مَنْ إِخْوَانُكُنَّ فَإِنَّمَا الرَّضَاعَةُ مِنْ الْمَجَاعَةِ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar], telah menceritakan kepada kami [Syu'bah], dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Muhammad bin Katsir], telah mengabarkan kepada kami [Sufyan] dari [Asy'ats bin Sulaim] dari [ayahnya] dari [Masruq] dari [Aisyah] dengan makna yang sama bahwa Rasulullah shallallahu 'alaihi wasallam menemuinya dan terdapat seorang laki-laki yang bersamanya -Hafsh berkata; hal tersebut terasa berat bagi beliau dan raut wajah beliau berubah. Kemudian Syu'bah dan Muhammad bin Katsir sama bersepakat mengatakan; Aisyah berkata; wahai Rasulallah, dia adalah saudaraku sepersusuan. Beliau berkata: \"Lihatlah siapa saudara-saudara sepersusuan kalian, sesungguhnya persusuan itu adalah karena lapar.\""
            },
            {
                "number": 1763,
                "arab": "حَدَّثَنَا عَبْدُ السَّلَامِ بْنُ مُطَهَّرٍ أَنَّ سُلَيْمَانَ بْنَ الْمُغِيرَةِ حَدَّثَهُمْ عَنْ أَبِي مُوسَى عَنْ أَبِيهِ عَنْ ابْنٍ لِعَبْدِ اللَّهِ بْنِ مَسْعُودٍ عَنْ ابْنِ مَسْعُودٍ قَالَلَا رِضَاعَ إِلَّا مَا شَدَّ الْعَظْمَ وَأَنْبَتَ اللَّحْمَفَقَالَ أَبُو مُوسَى لَا تَسْأَلُونَا وَهَذَا الْحَبْرُ فِيكُمْ حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ حَدَّثَنَا وَكِيعٌ عَنْ سُلَيْمَانَ بْنِ الْمُغِيرَةِ عَنْ أَبِي مُوسَى الْهِلَالِيِّ عَنْ أَبِيهِ عَنْ ابْنِ مَسْعُودٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَاهُ وَقَالَ أَنْشَزَ الْعَظْمَ",
                "id": "Telah menceritakan kepada kami [Abdussalam bin Muthahhar] bahwa [Sulaiman bin Al Mughirah], menceritakan kepada mereka dari [Abu Musa] dari [ayahnya] dari [Ibnu Abdullah bin Mas'ud] dari [Ibnu Mas'ud], ia berkata; Tidaklah (dianggap) persusuan kecuali yang dapat menguatkan tulang dan menumbuhkan daging. Abu Musa berkata; jangan kalian bertanya kepada kami sementara orang alim ini berada di antara kalian. Telah menceritakan kepada kami [Muhammad bin Sulaiman Al Anbari], telah menceritakan kepada kami [Waki'] dari [Sulaiman bin Al Mughirah] dari [Abu Musa Al Hilali], dari [ayahnya] dari [Ibnu Mas'ud] dari Nabi shallallahu 'alaihi wasallam dengan makna yang sama dengannya, dan ia berkata; serta menumbuhkan tulang. "
            },
            {
                "number": 1764,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا عَنْبَسَةُ حَدَّثَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ حَدَّثَنِي عُرْوَةُ بْنُ الزُّبَيْرِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأُمِّ سَلَمَةَأَنَّ أَبَا حُذَيْفَةَ بْنَ عُتْبَةَ بْنِ رَبِيعَةَ بْنِ عَبْدِ شَمْسٍ كَانَ تَبَنَّى سَالِمًا وَأَنْكَحَهُ ابْنَةَ أَخِيهِ هِنْدَ بِنْتَ الْوَلِيدِ بْنِ عُتْبَةَ بْنِ رَبِيعَةَ وَهُوَ مَوْلًى لِامْرَأَةٍ مِنْ الْأَنْصَارِ كَمَا تَبَنَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَيْدًا وَكَانَ مَنْ تَبَنَّى رَجُلًا فِي الْجَاهِلِيَّةِ دَعَاهُ النَّاسُ إِلَيْهِ وَوُرِّثَ مِيرَاثَهُ حَتَّى أَنْزَلَ اللَّهُ سُبْحَانَهُ وَتَعَالَى فِي ذَلِكَ{ ادْعُوهُمْ لِآبَائِهِمْ إِلَى قَوْلِهِ فَإِخْوَانُكُمْ فِي الدِّينِ وَمَوَالِيكُمْ }فَرُدُّوا إِلَى آبَائِهِمْ فَمَنْ لَمْ يُعْلَمْ لَهُ أَبٌ كَانَ مَوْلًى وَأَخًا فِي الدِّينِ فَجَاءَتْ سَهْلَةُ بِنْتُ سُهَيْلِ بْنِ عَمْرٍو الْقُرَشِيِّ ثُمَّ الْعَامِرِيِّ وَهِيَ امْرَأَةُ أَبِي حُذَيْفَةَ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّا كُنَّا نَرَى سَالِمًا وَلَدًا وَكَانَ يَأْوِي مَعِي وَمَعَ أَبِي حُذَيْفَةَ فِي بَيْتٍ وَاحِدٍ وَيَرَانِي فُضْلًا وَقَدْ أَنْزَلَ اللَّهُ عَزَّ وَجَلَّ فِيهِمْ مَا قَدْ عَلِمْتَ فَكَيْفَ تَرَى فِيهِ فَقَالَ لَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْضِعِيهِ فَأَرْضَعَتْهُ خَمْسَ رَضَعَاتٍ فَكَانَ بِمَنْزِلَةِ وَلَدِهَا مِنْ الرَّضَاعَةِ فَبِذَلِكَ كَانَتْ عَائِشَةُ رَضِيَ اللَّهُ عَنْهَا تَأْمُرُ بَنَاتِ أَخَوَاتِهَا وَبَنَاتِ إِخْوَتِهَا أَنْ يُرْضِعْنَ مَنْ أَحَبَّتْ عَائِشَةُ أَنْ يَرَاهَا وَيَدْخُلَ عَلَيْهَا وَإِنْ كَانَ كَبِيرًا خَمْسَ رَضَعَاتٍ ثُمَّ يَدْخُلُ عَلَيْهَا وَأَبَتْ أُمُّ سَلَمَةَ وَسَائِرُ أَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُدْخِلْنَ عَلَيْهِنَّ بِتِلْكَ الرَّضَاعَةِ أَحَدًا مِنْ النَّاسِ حَتَّى يَرْضَعَ فِي الْمَهْدِ وَقُلْنَ لِعَائِشَةَ وَاللَّهِ مَا نَدْرِي لَعَلَّهَا كَانَتْ رُخْصَةً مِنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِسَالِمٍ دُونَ النَّاسِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih], telah menceritakan kepada kami ['Anbasah], telah menceritakan kepadaku [Yunus] dari [Ibnu Syihab], telah menceritakan kepadaku ['Urwah bin Az Zubair], dari [Aisyah] isteri Nabi shallallahu 'alaihi wasallam serta [Ummu Salamah] bahwa Abu Hudzaifah bin 'Utbah bin Rabi'ah bin Abdu Syams pernah mengangkat Salim sebagai anak, dan menikahkannya dengan anak saudaranya yaitu Hindun binti Al Walid bin 'Utbah bin Rabi'ah, sementara Salim adalah mantan budak seorang wanita anshar, sebagaimana Rasulullah shallallahu 'alaihi wasallam mengangkat Zaid sebagai anak. Dahulu pada masa jahiliyah orang yang mengangkat seseorang sebagai anak, maka orang-orang memanggilnya dengan menisbatkannya kepadanya dan diberi warisannya hingga Allah subhanahu wa ta'ala menurunkan wahyu mengenai hal tersebut: \"Panggilah mereka (anak-anak angkat itu) dengan (memakai) nama bapak-bapak mereka; itulah yang lebih adil pada sisi Allah, dan jika kamu tidak mengetahui bapak-bapak mereka, maka (panggilah mereka sebagai) saudara-saudaramu seagama dan maula-maulamu.\" Kemudian mereka dikembalikan nasabnya kepada bapak-bapak mereka, sedangkan yang tidak diketahui ayahnya maka ia adalah seorang maula dan saudara seagama. Kemudian Sahlah binti Suhail bin 'Amr Al Qurasyi Al 'Amiri yang merupakan isteri Abu Hudzaifah datang dan berkata; wahai Rasulullah, sesungguhnya dahulu kami melihat Salim masih kecil, dan ia tinggal bersamaku dan bersama Abu Hudzaifah dalam satu rumah. Ia melihatku dalam keadaan memakai pakaian kerja, sedangkan Allah 'azza wajalla telah menurunkan wahyu yang engkau mengerti, maka bagaimana pendapat engkau dalam hal tersebut? Kemudian Nabi shallallahu 'alaihi wasallam berkata kepadanya: \"Susuilah dia!\" Lalu Sahlah menyusuinya lima kali susuan, maka Salim sama seperti anaknya sepersusuan. Oleh karena itu Aisyah memerintahkan anak-anak wanita saudari-saudarinya serta anak-anak wanita saudara-saudaranya agar menyusui orang yang ia ingin melihat serta menemuinya walaupun ia adalah orang dewasa sebanyak lima kali susuan, kemudian orang tersebut dapat menemuinya. Sedangkan Ummu Salamah dan isteri-isteri Nabi yang lain menolak memasukkan seseorang kepada mereka dengan persusuan tersebut kecuali menyusu pada saat masih bayi. Dan mereka berkata kepada Aisyah; demi Allah, kami tidak tahu, kemungkinan hal tersebut merupakan keringanan dari Nabi shallallahu 'alaihi wasallam untuk Salim, bukan orang selainnya. "
            },
            {
                "number": 1765,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ أَنَّهَا قَالَتْكَانَ فِيمَا أَنْزَلَ اللَّهُ عَزَّ وَجَلَّ مِنْ الْقُرْآنِ عَشْرُ رَضَعَاتٍ يُحَرِّمْنَ ثُمَّ نُسِخْنَ بِخَمْسٍ مَعْلُومَاتٍ يُحَرِّمْنَ فَتُوُفِّيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُنَّ مِمَّا يُقْرَأُ مِنْ الْقُرْآنِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah Al Qa'nabi], dari [Malik] dari [Abdullah bin Abu Bakr bin Muhammad bin 'Amr bin Hazm] dari ['Amrah binti Abdurrahman], dari [Aisyah] bahwa ia berkata; dahulu di antara ayat yang diturunkan adalah sepuluh kali susuan mengharamkan (untuk dinikahi). Kemudian ayat tersebut dinaskh (dihapus) menjadi lima kali susuan mengharamkan (untuk dinikahi). Lalu Nabi Shallallahu 'alaihi sallam meninggal dan ayat tersebut termasuk di antara bagian Al Qur'an yang dibaca. "
            },
            {
                "number": 1766,
                "arab": "حَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ حَدَّثَنَا إِسْمَعِيلُ عَنْ أَيُّوبَ عَنْ ابْنِ أَبِي مُلَيْكَةَ عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُحَرِّمُ الْمَصَّةُ وَلَا الْمَصَّتَانِ",
                "id": "Telah menceritakan kepada kami [Musaddad bin Musarhd], telah menceritakan kepada kami [Isma'il] dari [Ayyub] dari [Ibnu Abu Mulaikah] dari [Abdullah bin Az Zubair] dari [Aisyah] radliallahu 'anha, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Satu kali isapan dan dua kali isapan tidaklah mengharamkan.\""
            },
            {
                "number": 1767,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا أَبُو مُعَاوِيَةَ ح و حَدَّثَنَا ابْنُ الْعَلَاءِ حَدَّثَنَا ابْنُ إِدْرِيسَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ حَجَّاجِ بْنِ حَجَّاجٍ عَنْ أَبِيهِ قَالَقُلْتُ يَا رَسُولَ اللَّهِ مَا يُذْهِبُ عَنِّي مَذَمَّةَ الرَّضَاعَةِ قَالَ الْغُرَّةُ الْعَبْدُ أَوْ الْأَمَةُ قَالَ النُّفَيْلِيُّ حَجَّاجُ بْنُ حَجَّاجٍ الْأَسْلَمِيُّ وَهَذَا لَفْظُهُ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili], telah menceritakan kepada kami [Abu Mu'awiyah], dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Ibnu Al 'Ala`], telah menceritakan kepada kami [Ibnu Idris] dari [Hisyam bin 'Urwah] dari [ayahnya] dari [Hajjaj] dari [ayahnya], ia berkata; aku katakan; wahai Rasulullah, apakah yang dapat menghilangkan hak persusuan? Beliau berkata: \"Seorang budak laki-laki atau seorang budak wanita.\""
            },
            {
                "number": 1768,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا دَاوُدُ بْنُ أَبِي هِنْدٍ عَنْ عَامِرٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُنْكَحُ الْمَرْأَةُ عَلَى عَمَّتِهَا وَلَا الْعَمَّةُ عَلَى بِنْتِ أَخِيهَا وَلَا الْمَرْأَةُ عَلَى خَالَتِهَا وَلَا الْخَالَةُ عَلَى بِنْتِ أُخْتِهَا وَلَا تُنْكَحُ الْكُبْرَى عَلَى الصُّغْرَى وَلَا الصُّغْرَى عَلَى الْكُبْرَى",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili], telah menceritakan kepada kami [Zuhair], telah menceritakan kepada kami [Daud bin Abu Hindun], dari ['Amir], dari [Abu Hurairah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak boleh seorang wanita dinikahi sebagai madu bibinya (saudari ayah), dan seorang bibi dinikahi sebagai madu anak wanita saudara laki-lakinya, dan tidak boleh seorang wanita dinikahi sebagai madu bibinya (saudari ibu) dan seorang bibi sebagai madu bagi anak wanita saudara wanitanya. Dan tidak boleh seorang kakak wanita dinikahi sebagai madu adik wanitanya, dan adik wanita dinikahi sebagai madu kakak wanitanya.\""
            },
            {
                "number": 1769,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا عَنْبَسَةُ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي قَبِيصَةُ بْنُ ذُؤَيْبٍ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُجْمَعَ بَيْنَ الْمَرْأَةِ وَخَالَتِهَا وَبَيْنَ الْمَرْأَةِ وَعَمَّتِهَا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih], telah menceritakan kepada kami ['Anbasah], telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab], telah mengabarkan kepadaku [Qabishah bin Dzuaib] bahwa ia mendengar [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam melarang menggabungkan (dalam satu perkawinan) antara seorang wanita dengan bibi (saudara wanita ibu) serta seorang wanita dengan bibi (saudara wanita ayah). "
            },
            {
                "number": 1770,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا خَطَّابُ بْنُ الْقَاسِمِ عَنْ خُصَيْفٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَرِهَ أَنْ يُجْمَعَ بَيْنَ الْعَمَّةِ وَالْخَالَةِ وَبَيْنَ الْخَالَتَيْنِ وَالْعَمَّتَيْنِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili], telah menceritakan kepada kami [Khaththab bin Al Qasim], dari [Khushaif] dari [Ikrimah] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam bahwa beliau tidak menyukai untuk menggabungkan (dalam satu perkawinan) antara seorang bibi (dari pihak bapak) dengan bibi (dari pihak ibu), serta antara dua bibi (dari pihak ibu) dengan dua bibi (dari pihak ayah). "
            },
            {
                "number": 1771,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ الْمِصْرِيُّ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ أَنَّهُ سَأَلَ عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَعَنْ قَوْلِ اللَّهِ تَعَالَى{ وَإِنْ خِفْتُمْ أَلَّا تُقْسِطُوا فِي الْيَتَامَى فَانْكِحُوا مَا طَابَ لَكُمْ مِنْ النِّسَاءِ }قَالَتْ يَا ابْنَ أُخْتِي هِيَ الْيَتِيمَةُ تَكُونُ فِي حِجْرِ وَلِيِّهَا فَتُشَارِكُهُ فِي مَالِهِ فَيُعْجِبُهُ مَالُهَا وَجَمَالُهَا فَيُرِيدُ وَلِيُّهَا أَنْ يَتَزَوَّجَهَا بِغَيْرِ أَنْ يُقْسِطَ فِي صَدَاقِهَا فَيُعْطِيَهَا مِثْلَ مَا يُعْطِيهَا غَيْرُهُ فَنُهُوا أَنْ يَنْكِحُوهُنَّ إِلَّا أَنْ يُقْسِطُوا لَهُنَّ وَيَبْلُغُوا بِهِنَّ أَعْلَى سُنَّتِهِنَّ مِنْ الصَّدَاقِ وَأُمِرُوا أَنْ يَنْكِحُوا مَا طَابَ لَهُمْ مِنْ النِّسَاءِ سِوَاهُنَّ قَالَ عُرْوَةُ قَالَتْ عَائِشَةُ ثُمَّ إِنَّ النَّاسَ اسْتَفْتَوْا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَ هَذِهِ الْآيَةِ فِيهِنَّ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ{ وَيَسْتَفْتُونَكَ فِي النِّسَاءِ قُلْ اللَّهُ يُفْتِيكُمْ فِيهِنَّ وَمَا يُتْلَى عَلَيْكُمْ فِي الْكِتَابِ فِي يَتَامَى النِّسَاءِ اللَّاتِي لَا تُؤْتُونَهُنَّ مَا كُتِبَ لَهُنَّ وَتَرْغَبُونَ أَنْ تَنْكِحُوهُنَّ }قَالَتْ وَالَّذِي ذَكَرَ اللَّهُ أَنَّهُ يُتْلَى عَلَيْهِمْ فِي الْكِتَابِ الْآيَةُ الْأُولَى الَّتِي قَالَ اللَّهُ سُبْحَانَهُ فِيهَا{ وَإِنْ خِفْتُمْ أَلَّا تُقْسِطُوا فِي الْيَتَامَى فَانْكِحُوا مَا طَابَ لَكُمْ مِنْ النِّسَاءِ }قَالَتْ عَائِشَةُ وَقَوْلُ اللَّهِ عَزَّ وَجَلَّ فِي الْآيَةِ الْآخِرَةِ{ وَتَرْغَبُونَ أَنْ تَنْكِحُوهُنَّ }هِيَ رَغْبَةُ أَحَدِكُمْ عَنْ يَتِيمَتِهِ الَّتِي تَكُونُ فِي حِجْرِهِ حِينَ تَكُونُ قَلِيلَةَ الْمَالِ وَالْجَمَالِ فَنُهُوا أَنْ يَنْكِحُوا مَا رَغِبُوا فِي مَالِهَا وَجَمَالِهَا مِنْ يَتَامَى النِّسَاءِ إِلَّا بِالْقِسْطِ مِنْ أَجْلِ رَغْبَتِهِمْ عَنْهُنَّ قَالَ يُونُسُ وَقَالَ رَبِيعَةُ فِي قَوْلِ اللَّهِ عَزَّ وَجَلَّ{ وَإِنْ خِفْتُمْ أَلَّا تُقْسِطُوا فِي الْيَتَامَى }قَالَ يَقُولُ اتْرُكُوهُنَّ إِنْ خِفْتُمْ فَقَدْ أَحْلَلْتُ لَكُمْ أَرْبَعًا",
                "id": "Telah menceritakan kepada kami [Ahmad bin 'Amr bin As Sarh Al Mishri], telah menceritakan kepada kami [Ibnu Wahb], telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab], ia berkata; telah mengabarkan kepadaku ['Urwah bin Az Zubair] bahwa ia pernah bertanya kepada [Aisyah] radliallahu 'anha istri Rasulullah shallallahu 'alaihi wasallam mengenai firman Allah: \"Dan jika kamu takut tidak akan dapat berlaku adil terhadap (hak-hak) perempuan yang yatim (bilamana kamu mengawininya), maka kawinilah wanita-wanita (lain) yang kamu senangi.\" Dia berkata: wahai anak saudariku, yang dimaksud adalah wanita yatim yang berada di bawah asuhan seorang walinya, kemudian wanita tersebut berserikat dalam hartanya, kemudian walinya tertarik dengan hartanya dan kecantikannya. Kemudian walinya tersebut ingin menikahinya dengan tanpa berbuat adil dalam memberikan maharnya, dia memberikannya sebagaimana yang diberikan orang lain. Maka mereka dilarang untuk menikahi para wanita yatim tersebut kecuali bersikap adil kepada mereka dan memberikan mahar yang lebih tinggi dari mahar mereka yang biasa. Dan para wali tersebut diperintahkan untuk menikahi wanita lain yang mereka senangi. Urwah berkata; Aisyah berkata; kemudian orang-orang meminta fatwa kepada Rasulullah shallallahu 'alaihi wasallam setelah turunnya ayat mengenai mereka ini. Lalu Allah menurunkan \"Dan mereka minta fatwa kepadamu tentang para wanita. Katakanlah: \"Allah memberi fatwa kepadamu tentang mereka, dan apa yang dibacakan kepadamu dalam Al Quran (juga memfatwakan) tentang para wanita yatim yang kamu tidak memberikan kepada mereka apa yang ditetapkan untuk mereka, sedang kamu ingin mengawini mereka).\" Aisyah berkata; yang Allah sebutkan bahwa sesuatu tersebut yang dibacakan atas mereka dalam Al Qur'an adalah ayat pertama yang Allah firmankan: \"(Dan jika kamu takut tidak akan dapat berlaku adil terhadap (hak-hak) perempuan yang yatim (bilamana kamu mengawininya), Maka kawinilah wanita-wanita (lain) yang kamu senangi) \". Aisyah berkata: sedangkan firman Allah dalam ayat terakhir: \"(sedang kamu ingin mengawini mereka), \" adalah ketidaksenangan salah seorang di antara kalian kepada wanita yatimnya yang berada dalam asuhannya ketika kecantikan dan harta mereka sedikit. Maka mereka dilarang menikahi wanita yatim yang ingin dinikahinya karena kecantikan dan hartanya kecuali dengan keadilan karena ketidak senangan kepada mereka. Yunus berkata; Rabi'ah berkata tentang firman Allah: \"(Dan jika kamu takut tidak akan dapat berlaku adil terhadap (hak-hak) perempuan yang yatim (bilamana kamu mengawininya). Maka kawinilah wanita-wanita (lain) yang kamu senangi), \" ia berkata; tinggalkanlah mereka, dan jika kamu khawatir tidak dapat menahan nafsu, maka Aku telah menghalalkan bagi kalian empat wanita. "
            },
            {
                "number": 1772,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنِي أَبِي عَنْ الْوَلِيدِ بْنِ كَثِيرٍ حَدَّثَنِي مُحَمَّدُ بْنُ عَمْرِو بْنِ حَلْحَلَةَ الدِّيْلِيُّ أَنَّ ابْنَ شِهَابٍ حَدَّثَهُ أَنَّ عَلِيَّ بْنَ الْحُسَيْنِ حَدَّثَهُأَنَّهُمْ حِينَ قَدِمُوا الْمَدِينَةَ مِنْ عِنْدِ يَزِيدَ بْنِ مُعَاوِيَةَ مَقْتَلَ الْحُسَيْنِ بْنِ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُمَا لَقِيَهُ الْمِسْوَرُ بْنُ مَخْرَمَةَ فَقَالَ لَهُ هَلْ لَكَ إِلَيَّ مِنْ حَاجَةٍ تَأْمُرُنِي بِهَا قَالَ فَقُلْتُ لَهُ لَا قَالَ هَلْ أَنْتَ مُعْطِيَّ سَيْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِنِّي أَخَافُ أَنْ يَغْلِبَكَ الْقَوْمُ عَلَيْهِ وَايْمُ اللَّهِ لَئِنْ أَعْطَيْتَنِيهِ لَا يُخْلَصُ إِلَيْهِ أَبَدًا حَتَّى يُبْلَغَ إِلَى نَفْسِي إِنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ خَطَبَ بِنْتَ أَبِي جَهْلٍ عَلَى فَاطِمَةَ رَضِيَ اللَّهُ عَنْهَا فَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَخْطُبُ النَّاسَ فِي ذَلِكَ عَلَى مِنْبَرِهِ هَذَا وَأَنَا يَوْمَئِذٍ مُحْتَلِمٌ فَقَالَ إِنَّ فَاطِمَةَ مِنِّي وَأَنَا أَتَخَوَّفُ أَنْ تُفْتَنَ فِي دِينِهَا قَالَ ثُمَّ ذَكَرَ صِهْرًا لَهُ مِنْ بَنِي عَبْدِ شَمْسٍ فَأَثْنَى عَلَيْهِ فِي مُصَاهَرَتِهِ إِيَّاهُ فَأَحْسَنَ قَالَ حَدَّثَنِي فَصَدَقَنِي وَوَعَدَنِي فَوَفَّى لِي وَإِنِّي لَسْتُ أُحَرِّمُ حَلَالًا وَلَا أُحِلُّ حَرَامًا وَلَكِنْ وَاللَّهِ لَا تَجْتَمِعُ بِنْتُ رَسُولِ اللَّهِ وَبِنْتُ عَدُوِّ اللَّهِ مَكَانًا وَاحِدًا أَبَدًاحَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ وَعَنْ أَيُّوبَ عَنْ ابْنِ أَبِي مُلَيْكَةَ بِهَذَا الْخَبَرِ قَالَ فَسَكَتَ عَلِيٌّ عَنْ ذَلِكَ النِّكَاحِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal], telah menceritakan kepada kami [Ya'qub bin Ibrahim bin Sa'd], telah menceritakan kepadaku [ayahku] dari [Al Walid bin Katsir], telah menceritakan kepadaku [Muhammad bin 'Amr bin Halhalah Ad Dili], bahwa [Ibnu Syihab] telah menceritakan kepadanya bahwa [Ali bin Al Husain] telah menceritakan kepada mereka ketika datang ke Madinah dari sisi Yazid bin Mu'awiyah pada waktu terbunuhnya Al Husain bin Ali radliallahu 'anhuma [Al Miswar bin Makhramah] menemuinya dan berkata; apakah engkau memiliki keperluan kepadaku? Ali bin Al Husain berkata; aku katakan kepadanya; tidak. Ia berkata; apakah engkau akan memberikan pedang Rasulullah shallallahu 'alaihi wasallam kepadaku? Sesungguhnya aku khawatir orang-orang mengalahkanmu untuk mendapatkannya. Demi Allah, apabila engkau memberikannya kepadaku maka tidak akan ada orang yang dapat mengambilnya hingga nyawaku di cabut. Sesungguhnya Ali bin Abu Thalib radliallahu 'anhu meminang anak wanita Abu Jahl sebagai madu Fathimah radliallahu 'anha, lalu aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda ketika sedang berkhutbah kepada orang-orang mengenai hal tersebut di atas mimbar beliau ini, sementara pada saat itu aku adalah orang yang sudah baligh: \"Sesungguhnya Fathimah adalah bagian dariku dan aku khawatir ia terfitnah dalam agamanya.\" Kemudian beliau menyebutkan besan beliau yang berasal dari Bani Abdu Syams, kemudian beliau memujinya dalam berbesanan dengan beliau. Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ia berbicara kepadaku dan membenarkanku, berjanji kepadaku dan menepati janjinya kepadaku, sesungguhnya aku tidak mengharamkan sesuatu yang halal dan menghalalkan sesuatu yang haram. Akan tetapi demi Allah, tidak boleh berkumpul anak wanita Rasulullah dan anak wanita musuh Allah dalam satu tempat untuk selamanya.\" Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris], telah menceritakan kepada kami [Abdurrazzaq], telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari ['Urwah] dari [Ayyub] dari [Ibnu Abu Mulaikah] dengan khabar ini. Ia berkata; Ali menahan dari pernikahan tersebut. "
            },
            {
                "number": 1773,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ وَقُتَيْبَةُ بْنُ سَعِيدٍ الْمَعْنَى قَالَ أَحْمَدُ حَدَّثَنَا اللَّيْثُ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عُبَيْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ الْقُرَشِيُّ التَّيْمِيُّ أَنَّ الْمِسْوَرَ بْنَ مَخْرَمَةَ حَدَّثَهُأَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ يَقُولُ إِنَّ بَنِي هِشَامِ بْنِ الْمُغِيرَةِ اسْتَأْذَنُونِي أَنْ يُنْكِحُوا ابْنَتَهُمْ مِنْ عَلِيِّ بْنِ أَبِي طَالِبٍ فَلَا آذَنُ ثُمَّ لَا آذَنُ ثُمَّ لَا آذَنُ إِلَّا أَنْ يُرِيدَ ابْنُ أَبِي طَالِبٍ أَنْ يُطَلِّقَ ابْنَتِي وَيَنْكِحَ ابْنَتَهُمْ فَإِنَّمَا ابْنَتِي بَضْعَةٌ مِنِّي يُرِيبُنِي مَا أَرَابَهَا وَيُؤْذِينِي مَا آذَاهَاوَالْإِخْبَارُ فِي حَدِيثِ أَحْمَدَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus], dan [Qutaibah bin Sa'id] secara makna, Ahmad berkata; telah menceritakan kepada kami [Al Laits], telah menceritakan kepadaku [Abdullah bin 'Ubaidullah bin Abu Mulaikah Al Qurasyi At Taimi] bahwa [Al Miswar bin Makhramah] telah menceritakan kepadanya bahwa ia mendengar Rasulullah shallallahu 'alaihi wasallam di atas mimbar berkata: \"Sesungguhnya Bani Hisyam bin Al Mughirah telah meminta izin kepadaku untuk menikahkan anak wanita mereka dengan Ali bin Abu Thalib, maka aku tidak memberikan izin, kemudian tidak memberikan izin, kemudian tidak memberikan izin, kecuali Ibnu Abu Thalib ingin menceraikan anak wanitaku dan menikahi anak wanita mereka. Sesungguhnya anak wanitaku adalah bagian dariku, meragukannya apa yang meragukanku dan menyakitiku apa yang menyakitinya.\" Dan pengabaran ada dalam hadits Ahmad. "
            },
            {
                "number": 1774,
                "arab": "حَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ حَدَّثَنَا عَبْدُ الْوَارِثِ عَنْ إِسْمَعِيلَ بْنِ أُمَيَّةَ عَنْ الزُّهْرِيِّ قَالَكُنَّا عِنْدَ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ فَتَذَاكَرْنَا مُتْعَةَ النِّسَاءِ فَقَالَ لَهُ رَجُلٌ يُقَالُ لَهُ رَبِيعُ بْنُ سَبْرَةَ أَشْهَدُ عَلَى أَبِي أَنَّهُ حَدَّثَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْهَا فِي حَجَّةِ الْوَدَاعِ",
                "id": "Telah menceritakan kepada kami [Musaddad bin Musarhad], telah menceritakan kepada kami [Abdul Warits] dari [Isma'il bin Umayyah] dari [Az Zuhri], ia berkata; kami pernah berada di sisi Umar bin Abdul Aziz, kemudian kami saling menyebutkan menikahi wanita secara mut'ah. Lalu terdapat seorang laki-laki yang dipanggil [Rabi' bin Sabrah] yang berkata; aku bersaksi atas [ayahku] bahwa ia telah menceritakan bahwa Rasulullah shallallahu 'alaihi wasallam telah melarang darinya pada saat haji wada'. "
            },
            {
                "number": 1775,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ رَبِيعِ بْنِ سَبْرَةَ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَرَّمَ مُتْعَةَ النِّسَاءِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris], telah menceritakan kepada kami [Abdurrazzaq], telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Rabi' bin Sabrah] dari [ayahnya] bahwa Nabi shallallahu 'alaihi wasallam telah mengharamkan menikahi wanita secara mut'ah. "
            },
            {
                "number": 1776,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ ح و حَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ كِلَاهُمَا عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الشِّغَارِزَادَ مُسَدَّدٌ فِي حَدِيثِهِ قُلْتُ لِنَافِعٍ مَا الشِّغَارُ قَالَ يَنْكِحُ ابْنَةَ الرَّجُلِ وَيُنْكِحُهُ ابْنَتَهُ بِغَيْرِ صَدَاقٍ وَيَنْكِحُ أُخْتَ الرَّجُلِ وَيُنْكِحُهُ أُخْتَهُ بِغَيْرِ صَدَاقٍ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik], dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Musaddad bin Musarhad], telah menceritakan kepada kami [Yahya] dari ['Ubaidullah], keduanya dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam telah melarang dari nikah syighar. Musaddad menambahkan dalam haditsnya; aku katakan kepada Nafi'; apakah syighar itu? Ia berkata; seseorang menikahi anak wanita seseorang dengan imbalan ia menikahkan anak wanitanya dengan wali dari wanita yang dinikahi tersebut tanpa mahar, serta seseorang menikahi saudari seseorang dan orang tersebut menikahkannya dengan saudarinya tanpa mahar. "
            },
            {
                "number": 1777,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَبِي عَنْ ابْنِ إِسْحَقَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ هُرْمُزَ الْأَعْرَجُأَنَّ الْعَبَّاسَ بْنَ عَبْدِ اللَّهِ بْنِ الْعَبَّاسِ أَنْكَحَ عَبْدَ الرَّحْمَنِ بْنَ الْحَكَمِ ابْنَتَهُ وَأَنْكَحَهُ عَبْدُ الرَّحْمَنِ ابْنَتَهُ وَكَانَا جَعَلَا صَدَاقًا فَكَتَبَ مُعَاوِيَةُ إِلَى مَرْوَانَ يَأْمُرُهُ بِالتَّفْرِيقِ بَيْنَهُمَا وَقَالَ فِي كِتَابِهِ هَذَا الشِّغَارُ الَّذِي نَهَى عَنْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris], telah menceritakan kepada kami [Ya'qub bin Ibrahim], telah menceritakan kepada kami [ayahku] dari [Ibnu Ishaq], telah menceritakan kepadaku [Abdurrahman bin Hurmuz Al A'raj], bahwa Al Abbas bin Abdullah bin Al Abbas telah menikahkan Abdurrahman bin Al Hakam dengan anak wanitanya, dan Abdurrahman menikahkannya dengan anak wanitanya dan mereka berdua memberikan mahar. Kemudian [Mu'awiyah] menulis surat kepada Marwan dan memerintahkannya agar menceraikan antara keduanya. Dan dalam suratnya ia mengatakan; ini adalah syighar yang dilarang Rasulullah shallallahu 'alaihi wasallam. "
            },
            {
                "number": 1778,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنِي إِسْمَعِيلُ عَنْ عَامِرٍ عَنْ الْحَارِثِ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ إِسْمَعِيلُ وَأُرَاهُ قَدْ رَفَعَهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَعَنَ اللَّهُ الْمُحَلِّلَ وَالْمُحَلَّلَ لَهُحَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ عَنْ خَالِدٍ عَنْ حُصَيْنٍ عَنْ عَامِرٍ عَنْ الْحَارِثِ الْأَعْوَرِ عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَرَأَيْنَا أَنَّهُ عَلِيٌّ عَلَيْهِ السَّلَام عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَاهُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus], telah menceritakan kepada kami [Zuhair], telah menceritakan kepadaku [Isma'il] dari [Amir] dari [Al Harits] dari [Ali] radliallahu 'anhu, Isma'il berkata; aku melihat ia merafa'kan hadits ini kepada Nabi shallallahu 'alaihi wasallam, bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Semoga Allah melaknat muhallil (seseorang yang menikahi wanita yang telah dicerai tiga kali oleh suaminya untuk diceraikan lagi agar halal dinikahi kembali oleh suaminya yang pertama, dan ini dilakukan atas perintah suami pertama tersebut) dan muhallal lahu (seseorang -suami pertama- yang menyurh orang lain agar menikahi isterinya yang telah dicerai tiga kali agar halal dinikahi kembali). Telah menceritakan kepada kami [Wahb bin Baqiyyah] dari [Khalid] dari [Hushain] dari [Amir] dari [Al Harits Al A'war] dari seorang sahabat Nabi shallallahu 'alaihi wasallam, ia berkata; kami melihat bahwa ia adakah [Ali] radliallahu 'anhu, dari Nabi shallallahu 'alaihi wasallam dengan makna yang sama. "
            },
            {
                "number": 1779,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ وَهَذَا لَفْظُ إِسْنَادِهِ وَكِلَاهُمَا عَنْ وَكِيعٍ حَدَّثَنَا الْحَسَنُ بْنُ صَالِحٍ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ عَنْ جَابِرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّمَا عَبْدٍ تَزَوَّجَ بِغَيْرِ إِذْنِ مَوَالِيهِ فَهُوَ عَاهِرٌ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] serta [Utsman bin Abu Syaibah], dan ini adalah lafazh sanadnya. Keduanya berasal dari [Waki'], telah menceritakan kepada kami [Al Hasan bin Shalih] dari [Abdullah bin Muhammad bin 'Aqil] dari [Jabir], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapapun budak yang menikah tanpa seizin tuannya, maka ia adalah pezina.\""
            },
            {
                "number": 1780,
                "arab": "حَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ حَدَّثَنَا أَبُو قُتَيْبَةَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا نَكَحَ الْعَبْدُ بِغَيْرِ إِذْنِ مَوْلَاهُ فَنِكَاحُهُ بَاطِلٌقَالَ أَبُو دَاوُد هَذَا الْحَدِيثُ ضَعِيفٌ وَهُوَ مَوْقُوفٌ وَهُوَ قَوْلُ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا",
                "id": "Telah menceritakan kepada kami ['Uqbah bin Mukram], telah menceritakan kepada kami [Abu Qutaibah] dari [Abdullah bin Umar], dari [Nafi'], dari [Ibnu Umar] bahwa Nabi Shallallahu 'alaihi sallam bersabda: Apabila seorang budak menikah tanpa izin dari tuannya, maka nikahnya batal. Abu Daud berkata; hadits ini lemah dan mauquf, hanya perkataan Ibnu Umar radliallahu 'anhuma. "
            },
            {
                "number": 1781,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَخْطُبُ الرَّجُلُ عَلَى خِطْبَةِ أَخِيهِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin 'Amr bin As Sarh], telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Sa'id bin Al Musayyab] dari [Abu Hurairah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak boleh seorang laki-laki meminang pinangan saudaranya.\""
            },
            {
                "number": 1782,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَخْطُبْ أَحَدُكُمْ عَلَى خِطْبَةِ أَخِيهِ وَلَا يَبِعْ عَلَى بَيْعِ أَخِيهِ إِلَّا بِإِذْنِهِ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali], telah menceritakan kepada kami [Abdullah bin Numair] dari ['Ubaidullah] dari [Nafi'] dari [Ibnu Umar], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah salah seorang diantara kalian meminang pinangan saudaranya, dan janganlah ia menjual sesuatu yang sedang dalam penawaran saudaranya kecuali dengan seizinnya.\""
            },
            {
                "number": 1783,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ عَنْ دَاوُدَ بْنِ حُصَيْنٍ عَنْ وَاقِدِ بْنِ عَبْدِ الرَّحْمَنِ يَعْنِي ابْنَ سَعْدِ بْنِ مُعَاذٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا خَطَبَ أَحَدُكُمْ الْمَرْأَةَ فَإِنْ اسْتَطَاعَ أَنْ يَنْظُرَ إِلَى مَا يَدْعُوهُ إِلَى نِكَاحِهَا فَلْيَفْعَلْقَالَ فَخَطَبْتُ جَارِيَةً فَكُنْتُ أَتَخَبَّأُ لَهَا حَتَّى رَأَيْتُ مِنْهَا مَا دَعَانِي إِلَى نِكَاحِهَا وَتَزَوُّجِهَا فَتَزَوَّجْتُهَا",
                "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Abdul Wahid bin Ziyad], telah menceritakan kepada kami [Muhammad bin Ishaq], dari [Daud bin Hushain], dari [Waqid bin Abdurrahman bin Sa'd bin Mu'adz] dari [Jabir bin Abdullah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang di antara kalian meminang seorang wanita, jika ia mampu untuk melihat sesuatu yang mendorongannya untuk menikahinya hendaknya ia melakukannya.\" Jabir berkata; kemudian aku meminang seorang gadis dan aku bersembunyi untuk melihatnya hingga aku melihat darinya apa yang mendorongku untuk menikahinya, lalu aku pun menikahinya. "
            },
            {
                "number": 1784,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ أَخْبَرَنَا ابْنُ جُرَيْجٍ عَنْ سُلَيْمَانَ بْنِ مُوسَى عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّمَا امْرَأَةٍ نَكَحَتْ بِغَيْرِ إِذْنِ مَوَالِيهَا فَنِكَاحُهَا بَاطِلٌ ثَلَاثَ مَرَّاتٍ فَإِنْ دَخَلَ بِهَا فَالْمَهْرُ لَهَا بِمَا أَصَابَ مِنْهَا فَإِنْ تَشَاجَرُوا فَالسُّلْطَانُ وَلِيُّ مَنْ لَا وَلِيَّ لَهُحَدَّثَنَا الْقَعْنَبِيُّ حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ جَعْفَرٍ يَعْنِي ابْنَ رَبِيعَةَ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَاهُ قَالَ أَبُو دَاوُد جَعْفَرٌ لَمْ يَسْمَعْ مِنْ الزُّهْرِيِّ كَتَبَ إِلَيْهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir], telah mengabarkan kepada kami [Sufyan], telah mengabarkan kepada kami [Ibnu Juraij], dari [Sulaiman bin Musa] dari [Az Zuhri] dari [Urwah], dari [Aisyah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Setiap wanita yang menikah tanpa seizin walinya, maka pernikahannya adalah batal.\" Beliau mengucapkannya sebanyak tiga kali. Apabila ia tleah mencampurinya maka baginya mahar karena apa yang ia peroleh darinya, kemudian apabila mereka berselisih maka penguasa adalah wali bagi orang yang tidak memiliki wali. Telah menceritakan kepada kami [Al Qa'nabi], telah menceritakan kepada kami [Ibnu Luhai'ah], dari [Ja'far bin Rabi'ah], dari [Ibnu Syihab] dari ['Urwah] dari [Aisyah] dari Nabi shallallahu 'alaihi wasallam semakna dengannya. Abu Daud berkata; jal'far tidak mendengar dari Az Zuhri, ia menulis surat kepadanya. "
            },
            {
                "number": 1785,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ قُدَامَةَ بْنِ أَعْيَنَ حَدَّثَنَا أَبُو عُبَيْدَةَ الْحَدَّادُ عَنْ يُونُسَ وَإِسْرَائِيلَ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَىأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا نِكَاحَ إِلَّا بِوَلِيٍّقَالَ أَبُو دَاوُد وَهُوَ يُونُسُ عَنْ أَبِي بُرْدَةَ وَإِسْرَائِيلُ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي بُرْدَةَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Qudamah bin A'yan], Telah menceritakan kepada kami [Abu 'Ubaidah Al Haddad] dari [Yunus], dan [Israil] dari [Abu Ishaq] dari [Abu Burdah] dari [Abu Musa] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak ada (tidak sah) pernikahan kecuali dengan wali.\" Abu Daud berkata; Yunus meriwayatkan dari Abu Burddah, sedangkan Israil meriwayatkan dari Abu Ishaq dari Abu Burdah. "
            },
            {
                "number": 1786,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ أُمِّ حَبِيبَةَأَنَّهَا كَانَتْ عِنْدَ ابْنِ جَحْشٍ فَهَلَكَ عَنْهَا وَكَانَ فِيمَنْ هَاجَرَ إِلَى أَرْضِ الْحَبَشَةِ فَزَوَّجَهَا النَّجَاشِيُّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهِيَ عِنْدَهُمْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris], telah menceritakan kepada kami [Abdurrazzaq] dari [Ma'mar] dari [Az Zuhri] dari ['Urwah bin Az Zubai] dari [Ummu Habibah], bahwa ia dahulu adalah isteri Ibnu Jahsy, kemudian Ibnu Jahsy meninggal. Ia adalah di antara orang-orang yang berhijrah ke Negeri Habasyah, kemudian An Najasyi menikahkan Ummu Habibah dengan Rasulullah shallallahu 'alaihi wasallam, sementara Ummu Habibah bersama dengan mereka. "
            },
            {
                "number": 1787,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنِي أَبُو عَامِرٍ حَدَّثَنَا عَبَّادُ بْنُ رَاشِدٍ عَنْ الْحَسَنِ حَدَّثَنِي مَعْقِلُ بْنُ يَسَارٍ قَالَكَانَتْ لِي أُخْتٌ تُخْطَبُ إِلَيَّ فَأَتَانِي ابْنُ عَمٍّ لِي فَأَنْكَحْتُهَا إِيَّاهُ ثُمَّ طَلَّقَهَا طَلَاقًا لَهُ رَجْعَةٌ ثُمَّ تَرَكَهَا حَتَّى انْقَضَتْ عِدَّتُهَا فَلَمَّا خُطِبَتْ إِلَيَّ أَتَانِي يَخْطُبُهَا فَقُلْتُ لَا وَاللَّهِ لَا أُنْكِحُهَا أَبَدًا قَالَ فَفِيَّ نَزَلَتْ هَذِهِ الْآيَةُ{ وَإِذَا طَلَّقْتُمْ النِّسَاءَ فَبَلَغْنَ أَجَلَهُنَّ فَلَا تَعْضُلُوهُنَّ أَنْ يَنْكِحْنَ أَزْوَاجَهُنَّ }الْآيَةَ قَالَ فَكَفَّرْتُ عَنْ يَمِينِي فَأَنْكَحْتُهَا إِيَّاهُ",
                "id": "Telah menceritakan kepada kami [Muhammad Al Mutsanna], telah menceritakan kepadaku [Abu 'Amir], telah menceritakan kepada kami ['Abbad bin Rasyid] dari [Al Hasan], telah menceritakan kepadaku [Ma'qil bin Yasar], ia berkata; dahulu aku memiliki seorang saudara wanita, kemudian anak pamanku datang kepadaku, lalu aku menikahkan saudara wanitaku dengannya. Kemudian ia mencerainya, dengan perceraian yang memiliki kemungkinan untuk kembali, kemudian ia membiarkannya hinga habis masa iddahnya. Kemudian tatkala saudariku tersebut dipinang ia datang kepadaku untuk meminangnya. Lalu aku katakan; tidak, demi Allah, aku tidak akan menikahkannya denganmu selamanya. Ma'qil berkata; kemudian turunlah ayat ini mengenai diriku: \"Apabila kamu mentalak isteri-isterimu, lalu habis masa iddahnya, maka janganlah kamu (para wali) menghalangi mereka kawin lagi dengan bakal suaminya.\" Ma'qil berkata; kemudian aku membayar kafarah sumpahku, lalu menikahkan saudariku dengannya. "
            },
            {
                "number": 1788,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هِشَامٌ ح و حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا هَمَّامٌ ح و حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ الْمَعْنَى عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَيُّمَا امْرَأَةٍ زَوَّجَهَا وَلِيَّانِ فَهِيَ لِلْأَوَّلِ مِنْهُمَا وَأَيُّمَا رَجُلٍ بَاعَ بَيْعًا مِنْ رَجُلَيْنِ فَهُوَ لِلْأَوَّلِ مِنْهُمَا",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim], telah menceritakan kepada kami [Hisyam], dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Muhammad bin Katsir], telah mengabarkan kepada kami [Hammam], dan telah diriwayatkan dari jalur yang lain: telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Hammad] secara makna, dari [Qatadah] dari [Al Hasan] dari [Samurah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Setiap wanita yang dinikahkan oleh dua orang wali, maka ia menjadi hak bagi wali yang pertama di antara keduanya. Dan setiap orang yang menjual sesuatu kepada dua orang, maka barang tersebut menjadi hak bagi orang pertama (membeli) di antara mereka berdua.\""
            },
            {
                "number": 1789,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا أَسْبَاطُ بْنُ مُحَمَّدٍ حَدَّثَنَا الشَّيْبَانِيُّ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ الشَّيْبَانِيُّ وَذَكَرَهُ عَطَاءٌ أَبُو الْحَسَنِ السُّوَائِيُّ وَلَا أَظُنُّهُ إِلَّا عَنْ ابْنِ عَبَّاسٍفِي هَذِهِ الْآيَةِ{ لَا يَحِلُّ لَكُمْ أَنْ تَرِثُوا النِّسَاءَ كَرْهًا وَلَا تَعْضُلُوهُنَّ }قَالَ كَانَ الرَّجُلُ إِذَا مَاتَ كَانَ أَوْلِيَاؤُهُ أَحَقَّ بِامْرَأَتِهِ مِنْ وَلِيِّ نَفْسِهَا إِنْ شَاءَ بَعْضُهُمْ زَوَّجَهَا أَوْ زَوَّجُوهَا وَإِنْ شَاءُوا لَمْ يُزَوِّجُوهَا فَنَزَلَتْ هَذِهِ الْآيَةُ فِي ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Mani'], telah menceritakan kepada kami [Asbath bin Muhammad], Telah menceritakan kepada kami [Asy Syaibani] dari [Ikrimah] dari [Ibnu Abbas], [Asy Syaibani] berkata; dan telah disebutkan oleh ['Atha` Abu Al Hasan As Suwai], dan aku kira berasal dari [Ibnu Abbas] mengenai ayat: \"Tidak halal bagi kamu mempusakai (mewariskan) wanita dengan jalan paksa dan janganlah kamu menyusahkan mereka.\" Ia berkata; dahulu apabila seorang laki-laki meninggal, maka para walinya lebih berhak terhadap istrinya daripada wali wanita tersebut, apabila sebagian mereka berkehendak maka mereka akan menikahkannya dan apabila mereka berkehendak maka mereka tidak menikahkannya. Kemudian turunlah ayat ini mengenai hal tersebut."
            },
            {
                "number": 1790,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ ثَابِتٍ الْمَرْوَزِيُّ حَدَّثَنِي عَلِيُّ بْنُ حُسَيْنِ بْنِ وَاقِدٍ عَنْ أَبِيهِ عَنْ يَزِيدَ النَّحْوِيِّ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ{ لَا يَحِلُّ لَكُمْ أَنْ تَرِثُوا النِّسَاءَ كَرْهًا وَلَا تَعْضُلُوهُنَّ لِتَذْهَبُوا بِبَعْضِ مَا آتَيْتُمُوهُنَّ إِلَّا أَنْ يَأْتِينَ بِفَاحِشَةٍ مُبَيِّنَةٍ }وَذَلِكَ أَنَّ الرَّجُلَ كَانَ يَرِثُ امْرَأَةَ ذِي قَرَابَتِهِ فَيَعْضُلُهَا حَتَّى تَمُوتَ أَوْ تَرُدَّ إِلَيْهِ صَدَاقَهَا فَأَحْكَمَ اللَّهُ عَنْ ذَلِكَ وَنَهَى عَنْ ذَلِكَحَدَّثَنَا أَحْمَدُ بْنُ شَبُّوَيْهِ الْمَرْوَزِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُثْمَانَ عَنْ عِيسَى بْنِ عُبَيْدٍ عَنْ عُبَيْدِ اللَّهِ مَوْلَى عُمَرَ عَنْ الضَّحَّاكِ بِمَعْنَاهُ قَالَ فَوَعَظَ اللَّهُ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Muhammad bin Tsabit Al Marwazi], telah menceritakan kepadaku [Ali bin Husain bin Waqid] dari [ayahnya] dari [Yazid An Nahwi], dari [Ikrimah] dari [Ibnu Abbas], ia berkata; \"Tidak halal bagi kalian untuk mewariskan wanita secara paksa, dan janganlah kamu menyusahkan mereka karena hendak mengambil kembali sebagian dari apa yang telah kamu berikan kepadanya, terkecuali bila mereka melakukan pekerjaan keji yang nyata.\" Yang demikian itu adalah bahwa seorang laki-laki mewarisi isteri kerabatnya, kemudian ia menyusahkannya hingga meninggal atau wanita tersebut mengembalikan kepadanya maharnya. Kemudian Allah menetapkan dari hal tersebut dan melarang dari hal tersebut. Telah menceritakan kepada kami [Ahmad bin Syabbuwaih Al Marwazi], telah menceritakan kepada kami [Abdullah bin Utsman] dari [Isa bin 'Ubaid] dari ['Ubaidullah] mantan budak Umar, dari [Adh Dhahhak], dengan makna yang sama. Ia berkata; kemudian Allah memberikan nasehat hal tersebut. "
            },
            {
                "number": 1791,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَبَانُ حَدَّثَنَا يَحْيَى عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُنْكَحُ الثَّيِّبُ حَتَّى تُسْتَأْمَرَ وَلَا الْبِكْرُ إِلَّا بِإِذْنِهَا قَالُوا يَا رَسُولَ اللَّهِ وَمَا إِذْنُهَا قَالَ أَنْ تَسْكُتَ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim], Telah menceritakan kepada kami [Aban], telah menceritakan kepada kami [Yahya] dari [Abu Salamah] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Seorang janda tidak boleh dinikahkan hingga ia dimintai pertimbangan, dan seorang gadis tidak boleh dinikahkan kecuali dengan seizinnya.\" Para sahabat bertanya; wahai Rasulullah, bagaimana izinya? Beliau bersabda: \"Dengan cara diam.\""
            },
            {
                "number": 1792,
                "arab": "حَدَّثَنَا أَبُو كَامِلٍ حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ ح و حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ الْمَعْنَى حَدَّثَنِي مُحَمَّدُ بْنُ عَمْرٍو حَدَّثَنَا أَبُو سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تُسْتَأْمَرُ الْيَتِيمَةُ فِي نَفْسِهَا فَإِنْ سَكَتَتْ فَهُوَ إِذْنُهَا وَإِنْ أَبَتْ فَلَا جَوَازَ عَلَيْهَاوَالْإِخْبَارُ فِي حَدِيثِ يَزِيدَ قَالَ أَبُو دَاوُد وَكَذَلِكَ رَوَاهُ أَبُو خَالِدٍ سُلَيْمَانُ بْنُ حَيَّانَ وُمُعَاذُ بْنُ مُعَاذٍ عَنْ مُحَمَّدِ بْنِ عَمْرٍو حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا ابْنُ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ عَمْرٍو بِهَذَا الْحَدِيثِ بِإِسْنَادِهِ زَادَ فِيهِ قَالَ فَإِنْ بَكَتْ أَوْ سَكَتَتْ زَادَ بَكَتْ قَالَ أَبُو دَاوُد وَلَيْسَ بَكَتْ بِمَحْفُوظٍ وَهُوَ وَهْمٌ فِي الْحَدِيثِ الْوَهْمُ مِنْ ابْنِ إِدْرِيسَ أَوْ مِنْ مُحَمَّدِ بْنِ الْعَلَاءِ قَالَ أَبُو دَاوُد وَرَوَاهُ أَبُو عَمْرٍو ذَكْوَانُ عَنْ عَائِشَةَ قَالَتْ يَا رَسُولَ اللَّهِ إِنَّ الْبِكْرَ تَسْتَحِي أَنْ تَتَكَلَّمَ قَالَ سُكَاتُهَا إِقْرَارُهَا",
                "id": "Telah menceritakan kepada kami [Abu Kamil], telah menceritakan kepada kami [Yazid bin Zurai'], dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepadaku [Musa bin Isma'il], telah menceritakan kepada kami [Hammad] secara makna. Telah menceritakan kepadaku [Muhammad bin 'Amr], telah menceritakan kepada kami [Abu Salamah] dari [Abu Hurairah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang wanita yatim dimintai pertimbangan terhadap dirinya, apabila ia diam maka hal itu adalah izinnya, dan apabila ia menolak maka tidak boleh memaksakannya.\" Hadits Yazid dengan menggunakan bentuk pengabaran. Abu Daud berkata; begitu juga hadits tersebut diriwayatkan oleh [Abu Khalid Sulaiman bin Hayyan], serta [Mu'adz bin Mu'adz] dari [Muhammad bin 'Amr] telah menceritakan kepada kami [Muhammad bin Al 'Ala`], telah menceritakan kepada kami [Ibnu Idris], dari [Muhammad bin 'Amr] dengan hadits ini dengan sanadnya, dalam hadits tersebut ia menambahkan; beliau berkata: \"Apabila ia menangis atau diam, \" ia menambahkan kata \"menangis.\" Abu Daud berkata; kata \"menangis\" bukanlah sesuatu yang terhafalkan (terjaga), hal itu adalah sebuah kesalahan. Dalam hadits tersebut terdapat kesalahan dari Ibnu Idris, atau dari Muhammad bin Al 'Ala`. Abu Daud berkata; dan hadits tersebut diriwayatkan oleh [Abu 'Amr Dzakwan] dari [Aisyah], ia berkata; wahai Rasulullah, sesungguhnya seorang gadis akan merasa malu untuk berbicara. Beliau berkata; diamnya adalah persetujuannya. "
            },
            {
                "number": 1793,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ عَنْ سُفْيَانَ عَنْ إِسْمَعِيلَ بْنِ أُمَيَّةَ حَدَّثَنِي الثِّقَةُ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ آمِرُوا النِّسَاءَ فِي بَنَاتِهِنَّ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah], telah menceritakan kepada kami [Mu'awiyah bin Hisyam], dari [Sufyan], dari [Isma'il bin Umayyah], telah menceritakan kepadaku [orang yang tsiqah] dari [Ibnu Umar], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ajaklah para wanita untuk bermusyawarah mengenai anak-anak wanita mereka!\""
            },
            {
                "number": 1794,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا حُسَيْنُ بْنُ مُحَمَّدٍ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ عَنْ أَيُّوبَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍأَنَّ جَارِيَةً بِكْرًا أَتَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَتْ أَنَّ أَبَاهَا زَوَّجَهَا وَهِيَ كَارِهَةٌ فَخَيَّرَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَحَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ عِكْرِمَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْحَدِيثِ قَالَ أَبُو دَاوُد لَمْ يَذْكُرْ ابْنَ عَبَّاسٍ وَكَذَلِكَ رَوَاهُ النَّاسُ مُرْسَلًا مَعْرُوفٌ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah], telah menceritakan kepada kami [Husain bin Muhammad], telah menceritakan kepada kami [Jarir bin Hazim], dari [Ayyub], dari [Ikrimah] dari [Ibnu Abbas], bahwa seorang gadis datang kepada Nabi shallallahu 'alaihi wasallam dan menyebutkan bahwa ayahnya telah menikahkannya sementara ia tidak senang. Kemudian beliau beliau memberikan pilihan. Telah menceritakan kepada kami [Muhammad bin 'Ubaid], telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Ikrimah] dari Nabi shallallahu 'alaihi wasallam dengan hadits ini. Abu Daud berkata; Muhammad bin 'Ubaid tidak menyebutkan Ibnu Abbas. Begitu pula hadits tersebut telah diriwayatkan oleh beberapa ulama secara mursal adalah sesuatu yang telah diketahui. "
            },
            {
                "number": 1795,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ وَعَبْدُ اللَّهِ بْنُ مَسْلَمَةَ قَالَا أَخْبَرَنَا مَالِكٌ عَنْ عَبْدِ اللَّهِ بْنِ الْفَضْلِ عَنْ نَافِعِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْأَيِّمُ أَحَقُّ بِنَفْسِهَا مِنْ وَلِيِّهَا وَالْبِكْرُ تُسْتَأْذَنُ فِي نَفْسِهَا وَإِذْنُهَا صُمَاتُهَاوَهَذَا لَفْظُ الْقَعْنَبِيِّ حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا سُفْيَانُ عَنْ زِيَادِ بْنِ سَعْدٍ عَنْ عَبْدِ اللَّهِ بْنِ الْفَضْلِ بِإِسْنَادِهِ وَمَعْنَاهُ قَالَ الثَّيِّبُ أَحَقُّ بِنَفْسِهَا مِنْ وَلِيِّهَا وَالْبِكْرُ يَسْتَأْمِرُهَا أَبُوهَا قَالَ أَبُو دَاوُد أَبُوهَا لَيْسَ بِمَحْفُوظٍ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus], serta [Abdullah bin Maslamah], mereka berkata; telah mengabarkan kepada kami [Malik], dari [Abdullah bin Al Fadhl] dari [Nafi' bin Jubair] dari [Ibnu Abbas], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang janda lebih berhak terhadap dirinya daripada walinya, seorang gadis dimintai izinnya dalam urusan dirinya, dan izinnya adalah diamnya.\" Lafazh ini adalah lafazh Al Qa'nabi. Telah menceritakan kepada kami [Ahmad bin Hanbal], telah menceritakan kepada kami [Sufyan], dari [Ziyad bin Sa'd] dari [Abdullah bin Al Fadhl] dengan sanad serta maknanya, beliau bersabda: \"Seorang janda lebih berhak terhadap dirinya daripada walinya, dan seorang gadis dimintai pertimbangannya oleh ayahnya.\" Abu Daud berkata; kata \"ayahnya\" bukanlah sesuatu yang dihafal (dijaga). "
            },
            {
                "number": 1796,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ صَالِحِ بْنِ كَيْسَانَ عَنْ نَافِعِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ لِلْوَلِيِّ مَعَ الثَّيِّبِ أَمْرٌ وَالْيَتِيمَةُ تُسْتَأْمَرُ وَصَمْتُهَا إِقْرَارُهَا",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali], telah menceritakan kepada kami [Abdurrazzaq], telah mengabarkan kepada kami [Ma'mar] dari [Shalih bin Kaisan] dari [Nafi' bin Jubair bin Muth'im] dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang wali tidak memiliki kuasa memaksa terhadap seorang janda, dan seorang wanita yatim dimintai pertimbangannya, dan diamnya adalah persetujuannya.\""
            },
            {
                "number": 1797,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَبْدِ الرَّحْمَنِ وَمُجَمِّعٍ ابْنَيْ يَزِيدَ الْأَنْصَارِيَّيْنِ عَنْ خَنْسَاءَ بِنْتِ خِذَامٍ الْأَنْصَارِيَّةِأَنَّ أَبَاهَا زَوَّجَهَا وَهِيَ ثَيِّبٌ فَكَرِهَتْ ذَلِكَ فَجَاءَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَتْ ذَلِكَ لَهُ فَرَدَّ نِكَاحَهَا",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi], dari [Malik], dari [Abdurrahman bin Al Qasim], dari [ayahnya] dari [Abdurrahman] dan [Mujammi'], keduanya adalah anak Yazid Al Anshari dari [Khansa` binti Khidzam Al Anshariyyah], bahwa ayahnya telah menikahkannya sementara ia adalah seorang janda, kemudian ia tidak menyukai hal tersebut, lalu datang kepada Rasulullah shallallahu 'alaihi wasallam dan menceritakan hal tersebut kepada beliau. Maka beliau menolak pernikahannya."
            },
            {
                "number": 1798,
                "arab": "حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ غِيَاثٍ حَدَّثَنَا حَمَّادٌ حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَأَنَّ أَبَا هِنْدٍ حَجَمَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْيَافُوخِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا بَنِي بَيَاضَةَ أَنْكِحُوا أَبَا هِنْدٍ وَأَنْكِحُوا إِلَيْهِ وَقَالَ وَإِنْ كَانَ فِي شَيْءٍ مِمَّا تَدَاوُونَ بِهِ خَيْرٌ فَالْحِجَامَةُ",
                "id": "Telah menceritakan kepada kami [Abdul Wahid bin Ghiyats], telah menceritakan kepada kami [Hammad], telah menceritakan kepada kami [Muhammad bin 'Amr], dari [Abu Salamah] dari [Abu Hurairah], bahwa Abu Hindun telah membekam Nabi shallallahu 'alaihi wasallam pada bagian ubun-ubun, kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Wahai Bani Bayadhah, nikahkanlah Abu Hindun, dan nikahkanlah anak-anak wanitanya.\" Dan beliau bersabda: \"Seandainya ada sesuatu yang lebih baik yang kalian gunakan untuk berobat, maka sesuatu tersebut adalah berbekam.\""
            },
            {
                "number": 1799,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ وَمُحَمَّدُ بْنُ الْمُثَنَّى الْمَعْنَى قَالَا حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ بْنِ مِقْسَمٍ الثَّقَفِيُّ مِنْ أَهْلِ الطَّائِفِ حَدَّثَتْنِي سَارَةُ بِنْتُ مِقْسَمٍ أَنَّهَا سَمِعَتْ مَيْمُونَةَ بِنْتَ كَرْدَمٍ قَالَتْخَرَجْتُ مَعَ أَبِي فِي حَجَّةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَدَنَا إِلَيْهِ أَبِي وَهُوَ عَلَى نَاقَةٍ لَهُ فَوَقَفَ لَهُ وَاسْتَمَعَ مِنْهُ وَمَعَهُ دِرَّةٌ كَدِرَّةِ الْكُتَّابِ فَسَمِعْتُ الْأَعْرَابَ وَالنَّاسَ وَهُمْ يَقُولُونَ الطَّبْطَبِيَّةَ الطَّبْطَبِيَّةَ الطَّبْطَبِيَّةَ فَدَنَا إِلَيْهِ أَبِي فَأَخَذَ بِقَدَمِهِ فَأَقَرَّ لَهُ وَوَقَفَ عَلَيْهِ وَاسْتَمَعَ مِنْهُ فَقَالَ إِنِّي حَضَرْتُ جَيْشَ عِثْرَانَ قَالَ ابْنُ الْمُثَنَّى جَيْشَ غِثْرَانَ فَقَالَ طَارِقُ بْنُ الْمُرَقَّعِ مَنْ يُعْطِينِي رُمْحًا بِثَوَابِهِ قُلْتُ وَمَا ثَوَابُهُ قَالَ أُزَوِّجُهُ أَوَّلَ بِنْتٍ تَكُونُ لِي فَأَعْطَيْتُهُ رُمْحِي ثُمَّ غِبْتُ عَنْهُ حَتَّى عَلِمْتُ أَنَّهُ قَدْ وُلِدَ لَهُ جَارِيَةٌ وَبَلَغَتْ ثُمَّ جِئْتُهُ فَقُلْتُ لَهُ أَهْلِي جَهِّزْهُنَّ إِلَيَّ فَحَلَفَ أَنْ لَا يَفْعَلَ حَتَّى أُصْدِقَهُ صَدَاقًا جَدِيدًا غَيْرَ الَّذِي كَانَ بَيْنِي وَبَيْنَهُ وَحَلَفْتُ لَا أُصْدِقُ غَيْرَ الَّذِي أَعْطَيْتُهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبِقَرْنِ أَيِّ النِّسَاءِ هِيَ الْيَوْمَ قَالَ قَدْ رَأَتْ الْقَتِيرَ قَالَ أَرَى أَنْ تَتْرُكَهَا قَالَ فَرَاعَنِي ذَلِكَ وَنَظَرْتُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا رَأَى ذَلِكَ مِنِّي قَالَ لَا تَأْثَمُ وَلَا يَأْثَمُ صَاحِبُكَقَالَ أَبُو دَاوُد الْقَتِيرُ الشَّيْبُ حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي إِبْرَاهِيمُ بْنُ مَيْسَرَةَ أَنَّ خَالَتَهُ أَخْبَرَتْهُ عَنِ امْرَأَةٍ قَالَتْ هِيَ مُصَدَّقَةٌ امْرَأَةُ صِدْقٍ قَالَتْ بَيْنَا أَبِي فِي غَزَاةٍ فِي الْجَاهِلِيَّةِ إِذْ رَمِضُوا فَقَالَ رَجُلٌ مَنْ يُعْطِينِي نَعْلَيْهِ وَأُنْكِحُهُ أَوَّلَ بِنْتٍ تُولَدُ لِي فَخَلَعَ أَبِي نَعْلَيْهِ فَأَلْقَاهُمَا إِلَيْهِ فَوُلِدَتْ لَهُ جَارِيَةٌ فَبَلَغَتْ وَذَكَرَ نَحْوَهُ لَمْ يَذْكُرْ قِصَّةَ الْقَتِيرِ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali], serta [Muhammad bin Al Mutsanna] secara makna, mereka berkata; telah menceritakan kepada kami [Yazid bin Harun], telah mengabarkan kepada kami [Abdullah bin Yazid bin Miqsam Ats Tsaqafi] yang merupakan penduduk Thaif, telah menceritakan kepadaku [Sarah binti Miqsam] bahwa ia mendengar [Maimunah binti Kardam] berkata; aku pernah keluar bersama ayahku pada saat Rasulullah shallallahu 'alaihi wasallam melakukan haji. Aku melihat Rasulullah shallallahu 'alaihi wasallam, kemudian ayahku mendekat kepada beliau sementera beliau berada di atas untanya. Kemudian beliau berhenti dan mendengar darinya dengan membawa cambuk seperti cambuk orang mengajar anak-anak. Kemudian aku mendengar orang-orang badui serta orang-orang yang lain mereka berkata; jangan bersuara! Jangan bersuara! Jangan bersuara! Kemudian ayahku mendekat kepada beliau, mengambil posisi di hadapan beliau, dan mengakui risalah serta kenabian beliau dan beliau berhenti serta mendengarkan darinya. Kemudian ia berkata; sesungguhnya aku telah menghadiri pasukan 'Itsran -Ibnu Al Mutsanna menyebutnya; pasukan Ghitsran- kemudian Thariq bin Al Muraqqa' berkata; siapa yang memberiku tombak akan mendapatkan balasannya. Aku katakan; apakah balasannya? Ia berkata; aku akan menikahkannya dengan anak perempuanku yang pertama. Lalu aku memberikan tombakku kepadanya, kemudian aku menghilang darinya hingga aku mengetahui bahwa anak wanitanya telah lahir dan telah mencapai usia baligh. Kemudian aku mendatanginya dan aku katakan kepadanya; persiapkan isteriku agar datang kepadaku. Kemudian ia bersumpah bahwa ia tidak akan melakukannya kecuali aku memberinya mahar baru bukan mahar yang dahulu aku berikan kepadanya, dan aku pun bersumpah tidak akan memberikan mahar selain yang telah aku berikan kepadanya. Kemudian Rasulullah shallallahu 'alaihi wasallam berkata: \"Seumuran wanita manakah ia sekarang?\" Ia berkata; ia telah melihat uban (sudah dewasa). Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku berpendapat agar Engkau meninggalkannya.\" Kardam berkata; hal tersebut mengagetkanku, dan aku melihat kepada Rasulullah shallallahu 'alaihi wasallam. Kemudian tatkala beliau melihat rasa kagetku beliau berkata: Engkau tidak berdosa dan sahabatmu tidak berdosa.\" Abu Daud berkata; Al Qatir adalah uban. Telah menceritakan kepada kami [Ahmad bin Shalih], telah menceritakan kepada kami [Abdurrazzaq], telah mengabarkan kepada kami [Ibnu Juraij], telah mengabarkan kepadaku [Ibrahim bin Maisarah], bahwa [bibinya] telah mengabarkan kepadanya dari [seorang wanita], ia berkata; ia adalah wanita yang dipercaya dan jujur, ia berkata; ketika ayahku berada dalam sebuah peperangan pada masa jahiliyah tiba-tiba mereka merasakan panas di kaki mereka, kemudian seorang laki-laki berkata; siapa yang memberikan kedua sandalnya kepadaku maka aku akan menikahkannya dengan anak wanitaku yang lahir pertama. Lalu aku melemparkan kedua sandalku kepadanya, kemudian ia memiliki anak wanita yang telah berusia baligh, dan Ahmad bin Shalih menyebutkan seperti itu dan tidak menyebutkan kisah mengenai uban."
            },
            {
                "number": 1800,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ حَدَّثَنَا يَزِيدُ بْنُ الْهَادِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي سَلَمَةَ قَالَسَأَلْتُ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا عَنْ صَدَاقِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ ثِنْتَا عَشْرَةَ أُوقِيَّةً وَنَشٌّ فَقُلْتُ وَمَا نَشٌّ قَالَتْ نِصْفُ أُوقِيَّةٍ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili], telah menceritakan kepada kami [Abdul Aziz bin Muhammad], telah menceritakan kepada kami [Yazid bin Al Had] dari [Muhammad bin Ibrahim] dari [Abu Salamah]. Ia berkata; aku bertanya kepada [Aisyah] radliallahu 'anha mengenai mahar Nabi shallallahu 'alaihi wasallam, ia berkata; dua belas uqiyah dan nusy. Kemudian aku katakan; apakah nusy itu? Ia berkata; setengah uqiyah. "
            },
            {
                "number": 1801,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ مُحَمَّدٍ عَنْ أَبِي الْعَجْفَاءِ السُّلَمِيِّ قَالَخَطَبَنَا عُمَرُ رَحِمَهُ اللَّهُ فَقَالَ أَلَا لَا تُغَالُوا بِصُدُقِ النِّسَاءِ فَإِنَّهَا لَوْ كَانَتْ مَكْرُمَةً فِي الدُّنْيَا أَوْ تَقْوَى عِنْدَ اللَّهِ لَكَانَ أَوْلَاكُمْ بِهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أَصْدَقَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ امْرَأَةً مِنْ نِسَائِهِ وَلَا أُصْدِقَتْ امْرَأَةٌ مِنْ بَنَاتِهِ أَكْثَرَ مِنْ ثِنْتَيْ عَشْرَةَ أُوقِيَّةً",
                "id": "Telah menceritakan kepada kami [Muhammad bin 'Ubaid], telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Muhammad] dari [Abu Al 'Ajfa` As Sulami], ia berkata; [Umar] radliallahu 'anhu berkhutbah kepada kami, ia berkata; ketahuilah, janganlah kalian berlebihan dalam memberi mahar kepada para wanita, seandainya hal itu adalah sebuah kemuliaan di dunia atau sebagai bentuk ketakwaan di sisi Allah, niscaya orang yang paling dahulu melakukannya adalah Nabi shallallahu 'alaihi wasallam, tidaklah Rasulullah shallallahu 'alaihi wasallam memberikan mahar kepada salah seorang dari isteri-isteri beliau, dan tidak juga diberikan kepada puteri-puteri beliau jumlah mahar yang melebihi dua belas uqiyah. "
            },
            {
                "number": 1802,
                "arab": "حَدَّثَنَا حَجَّاجُ بْنُ أَبِي يَعْقُوبَ الثَّقَفِيُّ حَدَّثَنَا مُعَلَّى بْنُ مَنْصُورٍ حَدَّثَنَا ابْنُ الْمُبَارَكِ حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ أُمِّ حَبِيبَةَأَنَّهَا كَانَتْ تَحْتَ عُبَيْدِ اللَّهِ بْنِ جَحْشٍ فَمَاتَ بِأَرْضِ الْحَبَشَةِ فَزَوَّجَهَا النَّجَاشِيُّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَمْهَرَهَا عَنْهُ أَرْبَعَةَ آلَافٍ وَبَعَثَ بِهَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَعَ شُرَحْبِيلَ ابْنِ حَسَنَةَقَالَ أَبُو دَاوُد حَسَنَةُ هِيَ أُمُّهُ",
                "id": "Telah menceritakan kepada kami [Hajjaj bin Ya'qub Ats Tsaqafi], telah menceritakan kepada kami [Mu'alla bin Manshur], telah menceritakan kepada kami [Ibnu Al Mubarak], telah menceritakan kepada kami [Ma'mar], dari [Az Zuhri] dari ['Urwah] dari [Ummu Habibah] bahwa ia pernah menjadi isteri 'Ubaidullah bin Jahsy, kemudian ia meninggal di Negeri Habasyah, lalu An Najasyi menikahkannya dengan Nabi shallallahu 'alaihi wasallam. An Najasyi memberikan mahar empat ribu, dan ia mengirimnya kepada Rasulullah shallallahu 'alaihi wasallam bersama Syurahbil bin Hasanah. Abu Daud berkata; Hasanah adalah ibunya. "
            },
            {
                "number": 1803,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ بَزِيعٍ حَدَّثَنَا عَلِيُّ بْنُ الْحَسَنِ بْنِ شَقِيقٍ عَنْ ابْنِ الْمُبَارَكِ عَنْ يُونُسَ عَنْ الزُّهْرِيِّأَنَّ النَّجَاشِيَّ زَوَّجَ أُمَّ حَبِيبَةَ بِنْتَ أَبِي سُفْيَانَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى صَدَاقِ أَرْبَعَةِ آلَافِ دِرْهَمٍ وَكَتَبَ بِذَلِكَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَبِلَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Hatim bin Bazi'], telah menceritakan kepada kami [Ali bin Al Hasan bin Syaqiq] dari [Ibnu Al Mubarak] dari [Yunus] dari [Az Zuhri] bahwa An Najasyi telah menikahkan Ummu Habibah binti Abu Sufyan dengan Rasulullah shallallahu 'alaihi wasallam dengan mahar empat ribu dirham, dan menuliskan hal tersebut kepada Rasulullah shallallahu 'alaihi wasallam, kemudian beliau menerimanya. "
            },
            {
                "number": 1804,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ ثَابِتٍ الْبُنَانِيِّ وَحُمَيْدٍ عَنْ أَنَسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ وَعَلَيْهِ رَدْعُ زَعْفَرَانٍ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَهْيَمْ فَقَالَ يَا رَسُولَ اللَّهِ تَزَوَّجْتُ امْرَأَةً قَالَ مَا أَصْدَقْتَهَا قَالَ وَزْنَ نَوَاةٍ مِنْ ذَهَبٍ قَالَ أَوْلِمْ وَلَوْ بِشَاةٍ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Hammad] dari [Tsabit Al Bunani], serta [Humaid] dari [Anas] bahwa Rasulullah shallallahu 'alaihi wasallam melihat Abdurrahman bin 'Auf padanya terdapat bekas minyak za'faran. Kemudian Nabi shallallahu 'alaihi wasallam berkata: \"Apakah ini?\" Lalu ia berkata; wahai Rasulullah, aku telah menikahi seorang wanita. Beliau berkata: \"Mahar apakah yang telah engkau berikan kepadanya?\" Ia berkata; emas sebesar biji kurma. Beliau berkata: \"Rayakanlah (adakanlah walimah) walaupun hanya dengan menyembelih satu ekor kambing.\""
            },
            {
                "number": 1805,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ جِبْرَائِيلَ الْبَغْدَادِيُّ أَخْبَرَنَا يَزِيدُ أَخْبَرَنَا مُوسَى بْنُ مُسْلِمِ بْنِ رُومَانَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَعْطَى فِي صَدَاقِ امْرَأَةٍ مِلْءَ كَفَّيْهِ سَوِيقًا أَوْ تَمْرًا فَقَدْ اسْتَحَلَّقَالَ أَبُو دَاوُد رَوَاهُ عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ صَالِحِ بْنِ رُومَانَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ مَوْقُوفًا وَرَوَاهُ أَبُو عَاصِمٍ عَنْ صَالِحِ بْنِ رُومَانَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ كُنَّا عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَسْتَمْتِعُ بِالْقُبْضَةِ مِنْ الطَّعَامِ عَلَى مَعْنَى الْمُتْعَةِ قَالَ أَبُو دَاوُد رَوَاهُ ابْنُ جُرَيْجٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ عَلَى مَعْنَى أَبِي عَاصِمٍ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Jibrail Al Baghdadi], telah mengabarkan kepada kami [Yazid], telah mengabarkan kepada kami [Musa bin Muslim bin Ruman], dari [Abu Az Zubair] dari [Jabir bin Abdullah] bahwa Nabi shallallahu 'alaihi wasallam berkata: \"Barangsiapa yang memberi mahar seorang wanita berupa gandum atau kurma sepenuh dua telapak tangannya, maka (pemberiannya) itu ia telah menghalalkannya (menjadi mahar bagi istrinya)).\" Abu Daud berkata; hadits tersebut diriwayatkan oleh [Abdurrahman bin Mahdi] dari [Shalih bin Ruman] dari [Abu Az Zubair] dari [Jabir] secara mauquf. Dan diriwayatkan oleh [Abu 'Ashim] dari [Shalih bin Ruman] dari [Abu Az Zubair] dari [Jabir], ia berkata; kami pada zaman Rasulullah shallallahu 'alaihi wasallam menikah mut'ah dengan memberikan mahar satu genggam makanan. Abu Daud berkata; hadits tersebut diriwayatkan oleh [Ibnu Juraij] dari [Abu Az Zubair] dari [Jabir] seperti ma'na hadits Abu 'Ashim. "
            },
            {
                "number": 1806,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ أَبِي حَازِمِ بْنِ دِينَارٍ عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَاءَتْهُ امْرَأَةٌ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي قَدْ وَهَبْتُ نَفْسِي لَكَ فَقَامَتْ قِيَامًا طَوِيلًا فَقَامَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ زَوِّجْنِيهَا إِنْ لَمْ يَكُنْ لَكَ بِهَا حَاجَةٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَلْ عِنْدَكَ مِنْ شَيْءٍ تُصْدِقُهَا إِيَّاهُ فَقَالَ مَا عِنْدِي إِلَّا إِزَارِي هَذَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّكَ إِنْ أَعْطَيْتَهَا إِزَارَكَ جَلَسْتَ وَلَا إِزَارَ لَكَ فَالْتَمِسْ شَيْئًا قَالَ لَا أَجِدُ شَيْئًا قَالَ فَالْتَمِسْ وَلَوْ خَاتَمًا مِنْ حَدِيدٍ فَالْتَمَسَ فَلَمْ يَجِدْ شَيْئًا فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَهَلْ مَعَكَ مِنْ الْقُرْآنِ شَيْءٌ قَالَ نَعَمْ سُورَةُ كَذَا وَسُورَةُ كَذَا لِسُوَرٍ سَمَّاهَا فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ زَوَّجْتُكَهَا بِمَا مَعَكَ مِنْ الْقُرْآنِحَدَّثَنَا أَحْمَدُ بْنُ حَفْصِ بْنِ عَبْدِ اللَّهِ حَدَّثَنِي أَبِي حَفْصُ بْنُ عَبْدِ اللَّهِ حَدَّثَنِي إِبْرَاهِيمُ بْنُ طَهْمَانَ عَنْ الْحَجَّاجِ بْنِ الْحَجَّاجِ الْبَاهِلِيِّ عَنْ عِسْلٍ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ عَنْ أَبِي هُرَيْرَةَ نَحْوَ هَذِهِ الْقِصَّةِ لَمْ يَذْكُرْ الْإِزَارَ وَالْخَاتَمَ فَقَالَ مَا تَحْفَظُ مِنْ الْقُرْآنِ قَالَ سُورَةَ الْبَقَرَةِ أَوْ الَّتِي تَلِيهَا قَالَ فَقُمْ فَعَلِّمْهَا عِشْرِينَ آيَةً وَهِيَ امْرَأَتُكَ حَدَّثَنَا هَارُونُ بْنُ زَيْدِ بْنِ أَبِي الزَّرْقَاءِ حَدَّثَنَا أَبِي حَدَّثَنَا مُحَمَّدُ بْنُ رَاشِدٍ عَنْ مَكْحُولٍ نَحْوَ خَبَرِ سَهْلٍ قَالَ وَكَانَ مَكْحُولٌ يَقُولُ لَيْسَ ذَلِكَ لِأَحَدٍ بَعْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Abu Hazim bin Dinar] dari [Sahl bin Sa'd As Sa'idi] bahwa Rasulullah shallallahu 'alaihi wasallam didatangi oleh seorang wanita seraya berkata; wahai Rasulullah, aku menghibahkan diriku kepadamu. Kemudian wanita tersebut berdiri lama, lalu terdapat seorang laki-laki yang berdiri dan berkata; wahai Rasulullah, nikahkan aku dengannya apabila engkau tidak butuh kepadanya. Kemudian Rasulullah shallallahu 'alaihi wasallam berkata: \"Apakah kamu memiliki sesuatu yang dapat kamu berikan kepadanya sebagai mahar?\" Orang tersebut berkata; aku tidak memiliki sesuatu kecuali sarungku ini. Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila kamu memberikan sarungmu, maka kamu akan telanjang dan kamu tidak memiliki sarung, carilah sesuatu!\" Orang tersebut berkata; aku tidak mendapatkan sesuatu. Beliau berkata: \"Carilah (yang lain) walaupun hanya sebuah cincin besi!\" Kemudian orang tersebut mencari dan tidak mendapatkan sesuatu pun. Kemudian Rasulullah shallallahu 'alaihi wasallam berkata kepadanya: \"Apakah engkau hafal sebagian dari Al Qur'an?\" Orang tersebut berkata; ya, surat ini dan surat ini. Ia menyebutkan surat yang telah ia hafal. Kemudian Rasulullah shallallahu 'alaihi wasallam berkata kepadanya: \"Aku telah menikahkanmu dengan apa yang engkau miliki (hafal) dari Al Qur'an.\" Telah menceritakan kepada kami [Ahmad bin Hafsh bin Abdullah], telah menceritakan kepadaku [Abu Hafsh bin Abdullah], telah menceritakan kepadaku [Ibrahim bin Thahman] dari [Al Hajjaj bin Al Hajjaj Al Bahili] dari ['Asl] dari ['Atha` bin Abu Rabah] dari [Abu Hurairah] seperti kisah ini, namun ia tidak menyebutkan sarung dan cincin. Beliau berkata: \"Surat apakah yang engkau hafal dari Al Qur'an?\" Orang tersebut berkata; Surat Al Baqarah, atau surat yang setelahnya. Beliau berkata: \"Berdirilah dan ajarkanlah dua puluh ayat kepadanya! Ia adalah isterimu.\" Telah menceritakan kepada kami [Harun bin Zaid bin Abu Az Zarqa`], telah menceritakan kepada kami [ayahku], telah menceritakan kepada kami [Muhammad bin Rasyid] dari [Makhul] seperti hadits Sahl. Ia berkata; dan Makhul pernah berkata; hal tersebut bukan hal bagi seseorang setelah Rasulullah shallallahu 'alaihi wasallam. "
            },
            {
                "number": 1807,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ سُفْيَانَ عَنْ فِرَاسٍ عَنْ الشَّعْبِيِّ عَنْ مَسْرُوقٍ عَنْ عَبْدِ اللَّهِ فِي رَجُلٍ تَزَوَّجَ امْرَأَةً فَمَاتَ عَنْهَا وَلَمْ يَدْخُلْ بِهَا وَلَمْ يَفْرِضْ لَهَا الصَّدَاقَ فَقَالَ لَهَا الصَّدَاقُ كَامِلًا وَعَلَيْهَا الْعِدَّةُ وَلَهَا الْمِيرَاثُفَقَالَ مَعْقِلُ بْنُ سِنَانٍ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى بِهِ فِي بِرْوَعَ بِنْتِ وَاشِقٍحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ وَابْنُ مَهْدِيٍّ عَنْ سُفْيَانَ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ وَسَاقَ عُثْمَانُ مِثْلَهُ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ خِلَاسٍ وَأَبِي حَسَّانَ عَنْ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ أَنَّ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ أُتِيَ فِي رَجُلٍ بِهَذَا الْخَبَرِ قَالَ فَاخْتَلَفُوا إِلَيْهِ شَهْرًا أَوْ قَالَ مَرَّاتٍ قَالَ فَإِنِّي أَقُولُ فِيهَا إِنَّ لَهَا صَدَاقًا كَصَدَاقِ نِسَائِهَا لَا وَكْسَ وَلَا شَطَطَ وَإِنَّ لَهَا الْمِيرَاثَ وَعَلَيْهَا الْعِدَّةُ فَإِنْ يَكُ صَوَابًا فَمِنْ اللَّهِ وَإِنْ يَكُنْ خَطَأً فَمِنِّي وَمِنْ الشَّيْطَانِ وَاللَّهُ وَرَسُولُهُ بَرِيئَانِ فَقَامَ نَاسٌ مِنْ أَشْجَعَ فِيهِمْ الْجَرَّاحُ وَأَبُو سِنَانٍ فَقَالُوا يَا ابْنَ مَسْعُودٍ نَحْنُ نَشْهَدُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَاهَا فِينَا فِي بِرْوَعَ بِنْتِ وَاشِقٍ وَإِنَّ زَوْجَهَا هِلَالُ بْنُ مُرَّةَ الْأَشْجَعِيُّ كَمَا قَضَيْتَ قَالَ فَفَرِحَ عَبْدُ اللَّهِ بْنُ مَسْعُودٍ فَرَحًا شَدِيدًا حِينَ وَافَقَ قَضَاؤُهُ قَضَاءَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah], telah menceritakan kepada kami [Abdurrahman bin Mahdi] dari [Sufyan] dari [Firas] dari [Asy Sya'bi] dari [Masruq] dari [Abdullah] mengenai seorang laki-laki yang menikahi seorang wanita kemudian lelaki tersebut meninggal dunia, dan belum bercampur dengannya (menggaulinya) serta belum memberikan mahar kepadanya. Kemudian beliau berkata; baginya mahar secara sempurna dan ia wajib ber'iddah serta baginya warisan. Kemudian [Ma'qil bin Sinan] berkata; aku mendengar Rasulullah shallallahu 'alaihi wasallam memutuskan dengan hal tersebut pada diri Barwa' binti Wasyiq. Telah menceritakan kepada kami [Utsman bin Abu Syaibah], telah menceritakan kepada kami [Yazid bin Harun] dan [Ibnu Mahdi] dari [Sufyan] dari [Manshur] dari [Ibrahim] dari ['Al Qamah] dari [Abdullah], dan Utsman menyebutkan seperti itu. Telah menceritakan kepada kami [Ubaidullah bin Umar], telah menceritakan kepada kami [Yazid bin Zurai'], telah menceritakan kepada kami [Sa'id bin Abu 'Arubah] dari [Qatadah] dari [Khalas] serta [Abu Hassan] dari [Abdullah bin 'Utbah bin Mas'ud] bahwa [Abdullah bin Mas'ud] dihadapkan pada masalah mengenai seorang laki-laki seperti hadits ini. Abdullah bin Utbah berkata; kemudian orang-orang datang kepadanya selama satu bulan. Atau ia mengatakan; selama beberapa kali. Abdullah bin Mas'ud berkata; sesungguhnya aku katakan mengenainya; bahwa baginya mahar seperti mahar wanita-wanita yang setara dengannya, tidak kurang dan tidak lebih, dan baginya warisan, serta berkewajiban untuk ber'iddah. Apabila (perkataan itu) benar maka berasal dari Allah, dan apabila salah maka hal tersebut berasal dariku dan dari syetan, Allah dan rasul-Nya berlepas diri. Kemudian orang-orang dari Asyja' diantara mereka adalah [Al Jarrah], dan [Abu Sinan] berkata; wahai Ibnu Mas'ud, kami bersaksi bahwa Rasulullah shallallahu 'alaihi wasallam telah memutuskan hal tersebut diantara kami mengenai diri Barwa' binti Wasyiq yang suaminya adalah Hilal bin Murrah seperti yang telah engkau putuskan. Abdullah bin 'Utbah berkata; kemudian Abdullah bin Mas'ud sangat senang sekali ketika keputusannya sama dengan keputusan Rasulullah shallallahu 'alaihi wasallam. "
            },
            {
                "number": 1808,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ الذُّهْلِيُّ وَمُحَمَّدُ بْنُ الْمُثَنَّى وَعُمَرُ بْنُ الْخَطَّابِ قَالَ مُحَمَّدٌ حَدَّثَنَا أَبُو الْأَصْبَغِ الْجَزَرِيُّ عَبْدُ الْعَزِيزِ بْنُ يَحْيَى أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنْ أَبِي عَبْدِ الرَّحِيمِ خَالِدِ بْنِ أَبِي يَزِيدَ عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ مَرْثَدِ بْنِ عَبْدِ اللَّهِ عَنْ عُقْبَةَ بْنِ عَامِرٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِرَجُلٍ أَتَرْضَى أَنْ أُزَوِّجَكَ فُلَانَةَ قَالَ نَعَمْ وَقَالَ لِلْمَرْأَةِ أَتَرْضَيْنَ أَنْ أُزَوِّجَكِ فُلَانًا قَالَتْ نَعَمْ فَزَوَّجَ أَحَدَهُمَا صَاحِبَهُ فَدَخَلَ بِهَا الرَّجُلُ وَلَمْ يَفْرِضْ لَهَا صَدَاقًا وَلَمْ يُعْطِهَا شَيْئًا وَكَانَ مِمَّنْ شَهِدَ الْحُدَيْبِيَةَ وَكَانَ مَنْ شَهِدَ الْحُدَيْبِيَةَ لَهُ سَهْمٌ بِخَيْبَرَ فَلَمَّا حَضَرَتْهُ الْوَفَاةُ قَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَوَّجَنِي فُلَانَةَ وَلَمْ أَفْرِضْ لَهَا صَدَاقًا وَلَمْ أُعْطِهَا شَيْئًا وَإِنِّي أُشْهِدُكُمْ أَنِّي أَعْطَيْتُهَا مِنْ صَدَاقِهَا سَهْمِي بِخَيْبَرَ فَأَخَذَتْ سَهْمًا فَبَاعَتْهُ بِمِائَةِ أَلْفٍقَالَ أَبُو دَاوُد وَزَادَ عُمَرُ بْنُ الْخَطَّابِ وَحَدِيثُهُ أَتَمُّ فِي أَوَّلِ الْحَدِيثِ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرُ النِّكَاحِ أَيْسَرُهُ وَقَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلرَّجُلِ ثُمَّ سَاقَ مَعْنَاهُ قَالَ أَبُو دَاوُد يُخَافُ أَنْ يَكُونَ هَذَا الْحَدِيثُ مُلْزَقًا لِأَنَّ الْأَمْرَ عَلَى غَيْرِ هَذَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris Adz Dzuhli], serta [Muhammad bin Al Mutsanna] dan [Umar bin Al Khathab], Muhammad berkata; telah menceritakan kepada kami [Abu Al Ashbagh Al Jazari Abdul Aziz bin Yahya], telah mengabarkan kepada kami [Muhammad bin Salamah] dari [Abu Abdurrahim Khalid bin Abu Yazid] dari [Zaid bin Abu Unaisah], dari [Yazid bin Abu Habib] dari [Martsad bin Abdullah] dari ['Uqbah bin 'Amir], bahwa Nabi shallallahu 'alaihi wasallam berkata kepada seorang laki-laki: \"Apakah engkau rela aku nikahkah engkau dengan Fulanah?\" Ia berkata; Iya. Beliau berkata kepada wanita tersebut: \"Apakah engkau rela aku nikahkan engkau dengan Fulan?\" Wanita tersebut berkata; Iya. Kemudian beliau menikahkan mereka berdua. Kemudian laki-laki tersebut bercampur dengannya (menggaulinya) dalam keadaan belum menentukan mahar dan belum memberikan sesuatupun kepadanya. Ia termasuk orang-orang yang menyaksikan perdamaian Al Hudaibiyah, orang yang menghadiri perdamaian Al Hudaibiyah, dan memiliki saham di Khaibar. Kemudian tatkala kematian menjemputnya ia berkata; sesungguhnya Rasulullah shallallahu 'alaihi wasallam telah menikahkanku dengan Fulanah dan aku belum menentukan mahar untuknya dan belum memberikan sesuatupun kepadanya, dan aku meminta persaksian kalian bahwa aku telah memberikan kepadanya sahamku di Khaibar sebagai mahar. Kemudian wanita tersebut mengambil saham tersebut dan menjualnya seratus ribu. Abu Daud berkata; dan [Umar bin Al Khathab] menambahkan pada awal hadits, dan haditsnya lebih sempurna; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sebaik-baik pernikahan adalah yang paling mudah.\" Ia berkata; Rasulullah shallallahu 'alaihi wasallam berkata kepada laki-laki tersebut: Kemudian ia menyebutkan hadits tersebut dengan maknanya. Abu Daud berkata; hadits ini dikhawatirkan merupakan hadits tambahan karena kondisinya tidak demikian. "
            },
            {
                "number": 1809,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي عُبَيْدَةَ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ فِي خُطْبَةِ الْحَاجَةِ فِي النِّكَاحِ وَغَيْرِهِ ح و حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ الْمَعْنَى حَدَّثَنَا وَكِيعٌ عَنْ إِسْرَائِيلَ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي الْأَحْوَصِ وَأَبِي عُبَيْدَةَ عَنْ عَبْدِ اللَّهِ قَالَعَلَّمَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُطْبَةَ الْحَاجَةِ أَنْ الْحَمْدُ لِلَّهِ نَسْتَعِينُهُ وَنَسْتَغْفِرُهُ وَنَعُوذُ بِهِ مِنْ شُرُورِ أَنْفُسِنَا مَنْ يَهْدِ اللَّهُ فَلَا مُضِلَّ لَهُ وَمَنْ يُضْلِلْ فَلَا هَادِيَ لَهُ وَأَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ يَا أَيُّهَا الَّذِينَ آمَنُوا{ اتَّقُوا اللَّهَ الَّذِي تَسَاءَلُونَ بِهِ وَالْأَرْحَامَ إِنَّ اللَّهَ كَانَ عَلَيْكُمْ رَقِيبًا }{ يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ حَقَّ تُقَاتِهِ وَلَا تَمُوتُنَّ إِلَّا وَأَنْتُمْ مُسْلِمُونَ }{ يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَقُولُوا قَوْلًا سَدِيدًا يُصْلِحْ لَكُمْ أَعْمَالَكُمْ وَيَغْفِرْ لَكُمْ ذُنُوبَكُمْ وَمَنْ يُطِعْ اللَّهَ وَرَسُولَهُ فَقَدْ فَازَ فَوْزًا عَظِيمًا }لَمْ يَقُلْ مُحَمَّدُ بْنُ سُلَيْمَانَ أَنْ حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو عَاصِمٍ حَدَّثَنَا عِمْرَانُ عَنْ قَتَادَةَ عَنْ عَبْدِ رَبِّهِ عَنْ أَبِي عِيَاضٍ عَنْ ابْنِ مَسْعُودٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا تَشَهَّدَ ذَكَرَ نَحْوَهُ وَقَالَ بَعْدَ قَوْلِهِ وَرَسُولُهُ أَرْسَلَهُ بِالْحَقِّ بَشِيرًا وَنَذِيرًا بَيْنَ يَدَيْ السَّاعَةِ مَنْ يُطِعْ اللَّهَ وَرَسُولَهُ فَقَدْ رَشَدَ وَمَنْ يَعْصِهِمَا فَإِنَّهُ لَا يَضُرُّ إِلَّا نَفْسَهُ وَلَا يَضُرُّ اللَّهَ شَيْئًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir], telah mengabarkan kepada kami [Sufyan] dari [Abu Ishaq] dari [Abu 'Ubaidah] dari [Abdullah bin Mas'ud] mengenai khutbah hajah dalam pernikahan dan yang lainnya, dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Muhammad bin Sulaiman Al Anbari] secara makna, telah menceritakan kepada kami [Waki'] dari [Israil], dari [Abu Ishaq] dari [Abu Al Ahwash] dan [Abu 'Ubaidah] dari [Abdullah], ia berkata; Rasulullah shallallahu 'alaihi wasallam telah mengajarkan kepada khutbah hajah, yaitu: INNAL HAMDA LILLAAH, NAHMADUHU WA NASTA'IINUHU WA NASTAGHFIRUH, WA NA'UUDZU BILLAAHI MIN SYURUURI ANFUSINAA MAN YAHDIHILLAAHU FALAA MUDHILLALAH, WA MAN YUDHLIL FALAA HAADIYALAH. ASYHADU ANLAA ILAAHA ILLALLAAHU WA ASYHADU ANNA MUHAMMADAN 'ABDUHU WA RASUULUH. YAA AYYUHALLADZIINA AAMANUT TAQULLAAHAL LADZII TASAA-ALUUNA BIHII WAL ARHAAM, INNALLAAHA KAANA 'ALAIKUM RAQIIBAA. YAA AYYUHALLADZIINA AAMANUT TAQULLAAHA HAQQA TUQAATIHI WA LAA TAMUUTUNNA ILLAA WA ANTUM MUSLIMUUN, YAA AYYUHALLADZIINA AAMANUUT TAQULLAAHA WA QUULUU QAULAN SADIIDAA, YUSHLIH LAKUM A'MAALAKUM WA YAGHFIRLAKUM DZUNUUBAKUM WA MAYYUTHI'ILLAAHA WA RASUULAHU FAQAD FAAZA FAUZAN 'AZHIIMAA (Segala puji bagi Allah, kami memuji dan memohon pertolongan serta ampunan kepadaNya, dan berlindung kepada Allah dari keburukan diri kita, barangsiapa yang Allah beri petunjuk maka tidak ada yang dapat menyesatkannya dan barangsiapa yang Allah sesatkan, maka tidak ada yang dapat memberinya petunjuk. Aku bersaksi bahwa tidak ada tuhan yang berhak disembah kecuali Allah dan Muhammad adalah hamba serta rasulNya. Hai orang-orang yang beriman, bertakwalah kepada Allah yang dengan (mempergunakan) nama-Nya kamu saling meminta satu sama lain, dan (peliharalah) hubungan silaturrahim. Sesungguhnya Allah selalu menjaga dan mengawasi kamu. Hai orang-orang yang beriman, bertakwalah kepada Allah sebenar-benar takwa kepada-Nya; dan janganlah sekali-kali kamu mati melainkan dalam keadaan beragama Islam. Hai orang-orang yang beriman, bertakwalah kamu kepada Allah dan katakanlah perkataan yang benar, niscaya Allah memperbaiki bagimu amalan-amalanmu dan mengampuni bagimu dosa-dosamu. Dan barangsiapa mentaati Allah dan Rasul-Nya, maka sesungguhnya ia telah mendapat kemenangan yang besar(. Muhammad bin Sulaiman tidak menyebutkan khutbah tersebut. Telah menceritakan kepada kami [Muhammad bin Basysyar], telah menceritakan kepada kami [Abu 'Ashim], telah menceritakan kepada kami ['Imran] dari [Qatadah] dari [Abdu Rabbih] dari [Abu 'Iyadh] dari [Ibnu Mas'ud] bahwa Rasulullah shallallahu 'alaihi wasallam apabila bertasayahud menyebutkan seperti itu. Dan ia mengatakan setelah ucapannya: \"dan rasulNya\" yang Allah utus dengan kebenaran sebagai pemberi kabar gembira dan pemberi peringatan di hadapan Hari Kiamat. Barangsiapa yang mentaati Allah dan rasulNya maka sungguh ia telah mendapatkan petunjuk dan barangsiapa yang mendurhakai mereka berdua, maka sesungguhnya ia tidak merugikan kecuali terhadap dirinya sendiri, dan tidak merugikan Allah sedikitpun. "
            },
            {
                "number": 1810,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا بَدَلُ بْنُ الْمُحَبَّرِ أَخْبَرَنَا شُعْبَةُ عَنْ الْعَلَاءِ ابْنَ أَخِي شُعَيْبٍ الرَّازِيِّ عَنْ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ عَنْ رَجُلٍ مِنْ بَنِي سُلَيْمٍ قَالَخَطَبْتُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُمَامَةَ بِنْتَ عَبْدِ الْمُطَّلِبِ فَأَنْكَحَنِي مِنْ غَيْرِ أَنْ يَتَشَهَّدَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar], telah menceritakan kepada kami [Badal bin Al Muhabbar], telah mengabarkan kepada kami [Syu'bah] dari [Al 'Ala`] anak saudara Syu'aib Ar Razi dari [Isma'il bin Ibrahim] dari [seorang laki-laki dari Bani Sulaim], ia berkata; aku meminang Umamah binti Abdul Muththalib kepada Rasulullah shallallahu 'alaihi wasallam kemudian beliau menikahkanku tanpa beliau mengucapkan syahadat. "
            },
            {
                "number": 1811,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ وَأَبُو كَامِلٍ قَالَا حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْتَزَوَّجَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا بِنْتُ سَبْعٍ قَالَ سُلَيْمَانُ أَوْ سِتٍّ وَدَخَلَ بِي وَأَنَا بِنْتُ تِسْعٍ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb], serta [Abu Kamil], mereka berkata; Telah menceritakan kepada kami [Hammad bin Zaid] dari [Hisyam bin 'Urwah] dari [ayahnya] dari [Aisyah], ia berkata; Rasulullah shallallahu 'alaihi wasallam menikahiku sementara aku berumur tujuh tahun. Sulaiman berkata; atau enam tahun, dan beliau bercampur denganku sementara aku berumur sembilan tahun. "
            },
            {
                "number": 1812,
                "arab": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ أَبِي بَكْرٍ عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي بَكْرٍ عَنْ أَبِيهِ عَنْ أُمِّ سَلَمَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا تَزَوَّجَ أُمَّ سَلَمَةَ أَقَامَ عِنْدَهَا ثَلَاثًا ثُمَّ قَالَ لَيْسَ بِكِ عَلَى أَهْلِكِ هَوَانٌ إِنْ شِئْتِ سَبَّعْتُ لَكِ وَإِنْ سَبَّعْتُ لَكِ سَبَّعْتُ لِنِسَائِي",
                "id": "Telah menceritakan kepada kami [Zuhair bin Harb], telah menceritakan kepada kami [Yahya] dari [Sufyan], ia berkata; telah menceritakan kepadaku [Muhammad bin Abu Bakr], dari [Abdul Malik bin Abu Bakr] dari [ayahnya] dari [Ummu Salamah] bahwa Rasulullah shallallahu 'alaihi wasallam tatkala menikahi Ummu Salamah beliau tinggal di rumahnya selama tiga hari, kemudian beliau berkata: \"Engkau tidaklah direndahkan dan dikurangi hak kamu oleh keluargamu (maksudnya Rasulullah shallallahu 'alaihi wasallam), apabila engkau mau maka aku akan memberimu (giliran) tujuh hari, dan apabila aku memberimu (giliran) tujuh hari, maka aku memberi isteri-isteriku (giliran) tujuh hari (juga).\""
            },
            {
                "number": 1813,
                "arab": "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ عَنْ هُشَيْمٍ عَنْ حُمَيْدٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَلَمَّا أَخَذَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَفِيَّةَ أَقَامَ عِنْدَهَا ثَلَاثًا زَادَ عُثْمَانُ وَكَانَتْ ثَيِّبًاو قَالَ حَدَّثَنِي هُشَيْمٌ أَخْبَرَنَا حُمَيْدٌ أَخْبَرَنَا أَنَسٌ",
                "id": "Telah menceritakan kepada kami [Wahb bin Baqiyyah], serta [Utsman bin Abu Syaibah], dari [Husyaim] dari [Humaid], dari [Anas bin Malik], ia berkata; tatkala Rasulullah shallallahu 'alaihi wasallam mengambil (menikahi) Shafiyyah beliau tinggal di rumahnya selama tiga hari. Utsman menambahkan; dan ia adalah seorang janda. dan ia berkata; telah menceritakan kepadaku [Husyaim], telah mengabarkan kepada kami [Humaid], telah mengabarkan kepada kami [Anas]. "
            },
            {
                "number": 1814,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا هُشَيْمٌ وَإِسْمَعِيلُ ابْنُ عُلَيَّةَ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ أَبِي قِلَابَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَإِذَا تَزَوَّجَ الْبِكْرَ عَلَى الثَّيِّبِ أَقَامَ عِنْدَهَا سَبْعًا وَإِذَا تَزَوَّجَ الثَّيِّبَ أَقَامَ عِنْدَهَا ثَلَاثًا وَلَوْ قُلْتُ إِنَّهُ رَفَعَهُ لَصَدَقْتُ وَلَكِنَّهُ قَالَ السُّنَّةُ كَذَلِكَ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah], telah menceritakan kepada kami [Husyaim], dan [Isma'il bin 'Ulayyah], dari [Khalid Al Hadzdza`] dari [Abu Qilabah] dari [Anas bin Malik], ia berkata; apabila seseorang menikahi seorang gadis sebagai madu seorang janda maka ia tinggal di rumahnya selama tujuh hari, dan apabila menikahi seorang janda maka ia tinggal di rumahnya selama tiga hari. Jika aku mengatakan ia telah merafa'kan hadits tersebut, maka aku telah benar, akan tetapi ia mengatakan; sunnah. Demikianlah. "
            },
            {
                "number": 1815,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ إِسْمَعِيلَ الطَّالَقَانِيُّ حَدَّثَنَا عَبْدَةُ حَدَّثَنَا سَعِيدٌ عَنْ أَيُّوبَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَلَمَّا تَزَوَّجَ عَلِيٌّ فَاطِمَةَ قَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْطِهَا شَيْئًا قَالَ مَا عِنْدِي شَيْءٌ قَالَ أَيْنَ دِرْعُكَ الْحُطَمِيَّةُ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Isma'il Ath Thalaqani], telah menceritakan kepada kami ['Abdah], telah menceritakan kepada kami [Sa'id], dari [Ayyub] dari [Ikrimah] dari [Ibnu Abbas], ia berkata; tatkala Ali menikahi Fathimah, Rasulullah shallallahu 'alaihi wasallam berkata kepadanya: \"Berikan sesuatu kepadanya!\" Ia berkata; aku tidak memiliki sesuatu. Beliau berkata: \"Dimanakah baju besimu luas dan berat itu?\""
            },
            {
                "number": 1816,
                "arab": "حَدَّثَنَا كَثِيرُ بْنُ عُبَيْدٍ الْحِمْصِيُّ حَدَّثَنَا أَبُو حَيْوَةَ عَنْ شُعَيْبٍ يَعْنِي ابْنَ أَبِي حَمْزَةَ حَدَّثَنِي غَيْلَانُ بْنُ أَنَسٍ حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ ثَوْبَانَ عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ عَلِيًّا لَمَّا تَزَوَّجَ فَاطِمَةَ بِنْتَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَرَادَ أَنْ يَدْخُلَ بِهَا فَمَنَعَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى يُعْطِيَهَا شَيْئًا فَقَالَ يَا رَسُولَ اللَّهِ لَيْسَ لِي شَيْءٌ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْطِهَا دِرْعَكَ فَأَعْطَاهَا دِرْعَهُ ثُمَّ دَخَلَ بِهَاحَدَّثَنَا كَثِيرٌ يَعْنِي ابْنَ عُبَيْدٍ حَدَّثَنَا أَبُو حَيْوَةَ عَنْ شُعَيْبٍ عَنْ غَيْلَانَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Katsir bin 'Ubaid Al Himshi], telah menceritakan kepada kami [Abu Haiwah] dari [Syu'aib bin Abu Hamzah], telah menceritakan kepadaku [Ghailan bin Anas], telah menceritakan kepadaku [Muhammad bin Abdurrahman bin Tsauban], dari [seorang laki-laki] sahabat Nabi shallallahu 'alaihi wasallam, bahwa Ali tatkala menikahi Fathimah binti Rasulullah shallallahu 'alaihi wasallam dan hendak bercampur dengannya (menggaulinya), Rasulullah shallallahu 'alaihi wasallam melarangnya hingga ia memberikan sesuatu kepadanya. Kemudian ia berkata; wahai Rasulullah, aku tidak memiliki sesuatu. Kemudian Nabi shallallahu 'alaihi wasallam berkata kepadanya: \"Berikan baju besimu kepadanya!\" kemudian Ali memberikannya kepada Fathimah, kemudian ia bercampur dengannya (menggaulinya). Telah menceritakan kepada kami [Katsir bin 'Ubaid], telah menceritakan kepada kami [Abu Haiwah], dari [Syu'aib] dari [Ghailan] dari [Ikrimah] dari [Ibnu Abbas] seperti itu. "
            },
            {
                "number": 1817,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ الْبَزَّازُ حَدَّثَنَا شَرِيكٌ عَنْ مَنْصُورٍ عَنْ طَلْحَةَ عَنْ خَيْثَمَةَ عَنْ عَائِشَةَ قَالَتْأَمَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ أُدْخِلَ امْرَأَةً عَلَى زَوْجِهَا قَبْلَ أَنْ يُعْطِيَهَا شَيْئًاقَالَ أَبُو دَاوُد وَخَيْثَمَةُ لَمْ يَسْمَعْ مِنْ عَائِشَةَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah Al Bazzar], telah menceritakan kepada kami [Syarik], dari [Manshur] dari [Thalhah] dari [Khaitsamah] dari [Aisyah], ia berkata; Rasulullah shallallahu 'alaihi wasallam memerintahkanku agar memasukkan (menyerahkan) wanita kepada suaminya sebelum suami tersebut memberikan sesuatu kepadanya. Abu Daud berkata; dan Khaitsamah tidak mendengar dari Aisyah. "
            },
            {
                "number": 1818,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مَعْمَرٍ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ الْبُرْسَانِيُّ أَخْبَرَنَا ابْنُ جُرَيْجٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّمَا امْرَأَةٍ نُكِحَتْ عَلَى صَدَاقٍ أَوْ حِبَاءٍ أَوْ عِدَّةٍ قَبْلَ عِصْمَةِ النِّكَاحِ فَهُوَ لَهَا وَمَا كَانَ بَعْدَ عِصْمَةِ النِّكَاحِ فَهُوَ لِمَنْ أُعْطِيَهُ وَأَحَقُّ مَا أُكْرِمَ عَلَيْهِ الرَّجُلُ ابْنَتُهُ أَوْ أُخْتُهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ma'mar], telah menceritakan kepada kami [Muhammad bin Bakr Al Bursani], telah mengabarkan kepada kami [Ibnu Juraij] dari ['Amr bin Syu'aib] dari [ayahnya] dari [kakeknya], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Setiap wanita yang dinikahkan dengan suatu mahar, pemberian, atau janji sebelum akad nikah, maka hal itu adalah miliknya. Adapun yang diberikan setelah akad nikah, maka hal itu adalah milik orang yang diberinya. Dan orang yang paling berhak terhadap penghormatan yang diberikan kepada seseorang adalah anak atau saudara wanita wanita.\""
            },
            {
                "number": 1819,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُحَمَّدٍ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا رَفَّأَ الْإِنْسَانَ إِذَا تَزَوَّجَ قَالَ بَارَكَ اللَّهُ لَكَ وَبَارَكَ عَلَيْكَ وَجَمَعَ بَيْنَكُمَا فِي خَيْرٍ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id], telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Suhail] dari [ayahnya], dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam apabila mengucapkan selamat kepada seseorang apabila ia menikah beliau mengucapkan: \"BAARAKALLAAHU LAKA WA BAARAKA 'ALAIKA WA JAMA'A BAINAKUMAA FII KHAIRIN\" (Semoga Allah memberkahimu dan senantiasa memberkahimu dan mengumpulkan kalian berdua dalam kebaikan.\""
            },
            {
                "number": 1820,
                "arab": "حَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ وَالْحَسَنُ بْنُ عَلِيٍّ وَمُحَمَّدُ بْنُ أَبِي السَّرِيِّ الْمَعْنَى قَالُوا حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ عَنْ صَفْوَانَ بْنِ سُلَيْمٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ رَجُلٌ مِنْ الْأَنْصَارِ قَالَ ابْنُ أَبِي السَّرِيِّ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يَقُلْ مِنْ الْأَنْصَارِ ثُمَّ اتَّفَقُوا يُقَالُ لَهُ بَصْرَةُ قَالَتَزَوَّجْتُ امْرَأَةً بِكْرًا فِي سِتْرِهَا فَدَخَلْتُ عَلَيْهَا فَإِذَا هِيَ حُبْلَى فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَهَا الصَّدَاقُ بِمَا اسْتَحْلَلْتَ مِنْ فَرْجِهَا وَالْوَلَدُ عَبْدٌ لَكَ فَإِذَا وَلَدَتْ قَالَ الْحَسَنُ فَاجْلِدْهَا و قَالَ ابْنُ أَبِي السَّرِيِّ فَاجْلِدُوهَا أَوْ قَالَ فَحُدُّوهَاقَالَ أَبُو دَاوُد رَوَى هَذَا الْحَدِيثَ قَتَادَةُ عَنْ سَعِيدِ بْنِ يَزِيدَ عَنْ ابْنِ الْمُسَيَّبِ وَرَوَاهُ يَحْيَى بْنُ أَبِي كَثِيرٍ عَنْ يَزِيدَ بْنِ نُعَيْمٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ وَعَطَاءٍ الْخُرَاسَانِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَرْسَلُوهُ كُلُّهُمْ وَفِي حَدِيثِ يَحْيَى بْنِ أَبِي كَثِيرٍ أَنَّ بَصْرَةَ بْنَ أَكْثَمَ نَكَحَ امْرَأَةً وَكُلُّهُمْ قَالَ فِي حَدِيثِهِ جَعَلَ الْوَلَدَ عَبْدًا لَهُ حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ حَدَّثَنَا عَلِيٌّ يَعْنِي ابْنَ الْمُبَارَكِ عَنْ يَحْيَى عَنْ يَزِيدَ بْنِ نُعَيْمٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّ رَجُلًا يُقَالُ لَهُ بَصْرَةُ بْنُ أَكْثَمَ نَكَحَ امْرَأَةً فَذَكَرَ مَعْنَاهُ زَادَ وَفَرَّقَ بَيْنَهُمَا وَحَدِيثُ ابْنِ جُرَيْجٍ أَتَمُّ",
                "id": "Telah menceritakan kepada kami [Makhlad bin Khalid] serta [Al Hasan bin Ali] dan [Muhammad bin Abu As Sari] secara makna, mereka berkata; telah menceritakan kepada kami [Abdurrazzaq], telah mengabarkan kepada kami [Ibnu Juraij], dari [Shafwan bin Sulaim], dari [Sa'id bin Al Musayyab], dari seorang laki-laki anshar, [Ibnu Abu As Sari] berkata; yang merupakan sahabat Nabi shallallahu 'alaihi wasallam, tidak mengatakan; anshar. Kemudian mereka sepakat mengatakan; yang dipanggil Bashrah, ia berkata; aku menikahi seorang budak perawan dalam tabirnya, kemudian aku menemuinya dan ternyata ia sedang hamil. Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Baginya mahar karena farji yang telah engkau halalkan, dan anaknya adalah budakmu apabila ia telah melahirkan.\" Al Hasan berkata; cambuklah dia. Ibnu Abu As Sari berkata; cambuklah dia. Atau mengatakan; hukumlah dia. Abu Daud berkata; hadits ini telah diriwayatkan oleh [Qatadah] dari [Sa'id bin Yazid] dari [Ibnu Al Musayyab], dan telah diriwayatkan oleh [Yahya bin Abu Katsir] dari [Yazid bin Nu'aim] dari [Sa'id bin Al Musayyab] serta ['Atha` Al Khurasani], dari [Sa'id bin Al Musayyab]. Mereka semua telah memursalkannya. Dan di dalam hadits Yahya bin Abu Katsir disebutkan bahwa [Bashrah bin Aktsam] menikahi seorang wanita, dan seluruh mereka mengatakan dalam haditsnya; ia menjadikan anak tersebut sebagai budaknya. Telah menceritakan kepada kami [Muhammad bin Al Mutsanna], telah menceritakan kepada kami [Utsman bin Umar], telah menceritakan kepada kami [Ali bin Al Mubarak], dari [Yahya] dari [Yazid bin Nu'aim] dari [Sa'id bin Al Musayyab] bahwa seorang laki-laki yang dipanggil [Bashrah bin Aktsam] telah menikahi seorang wanita…. Kemudian ia menyebutkan makna hadits dan menambahkan; dan beliau memisahkan diantara mereka berdua. Hadits Ibnu Juraij lebih sempurna."
            },
            {
                "number": 1821,
                "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ عَنْ النَّضْرِ بْنِ أَنَسٍ عَنْ بَشِيرِ بْنِ نَهِيكٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ كَانَتْ لَهُ امْرَأَتَانِ فَمَالَ إِلَى إِحْدَاهُمَا جَاءَ يَوْمَ الْقِيَامَةِ وَشِقُّهُ مَائِلٌ",
                "id": "Telah menceritakan kepada kami [Abu Al Walid Ath Thayalisi], telah menceritakan kepada kami [Hammam], telah menceritakan kepada kami [Qatadah] dari [An Nadhrah bin Anas] dari [Basyir bin Nahik] dari [Abu Hurairah], dari Nabi shallallahu 'alaihi wasallam, beliau berkata: \"Barangsiapa yang memiliki dua orang isteri kemudian ia cenderung kepada salah seorang diantara keduanya, maka ia akan datang pada hari Kiamat dalam keadaan sebelah badannya miring.\""
            },
            {
                "number": 1822,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ الْخَطْمِيِّ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْسِمُ فَيَعْدِلُ وَيَقُولُ اللَّهُمَّ هَذَا قَسْمِي فِيمَا أَمْلِكُ فَلَا تَلُمْنِي فِيمَا تَمْلِكُ وَلَا أَمْلِكُقَالَ أَبُو دَاوُد يَعْنِي الْقَلْبَ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Hammad] dari [Ayyub] dari [Abu Qilabah] dari [Abdullah bin Yazid Al Khathmi] dari [Aisyah], ia berkata; Rasulullah shallallahu 'alaihi wasallam memberikan pembagian dan berbuat adil dalam membagi, dan beliau berkata: \"Ya Allah, inilah pembagianku yang aku mampu, maka janganlah Engkau cela aku pada sesuatu yang Engkau mampu dan tidak aku mampu.\" Abu Daud berkata; yaitu hati. "
            },
            {
                "number": 1823,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ يَعْنِي ابْنَ أَبِي الزِّنَادِ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ قَالَ قَالَتْ عَائِشَةُيَا ابْنَ أُخْتِي كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُفَضِّلُ بَعْضَنَا عَلَى بَعْضٍ فِي الْقَسْمِ مِنْ مُكْثِهِ عِنْدَنَا وَكَانَ قَلَّ يَوْمٌ إِلَّا وَهُوَ يَطُوفُ عَلَيْنَا جَمِيعًا فَيَدْنُو مِنْ كُلِّ امْرَأَةٍ مِنْ غَيْرِ مَسِيسٍ حَتَّى يَبْلُغَ إِلَى الَّتِي هُوَ يَوْمُهَا فَيَبِيتَ عِنْدَهَا وَلَقَدْ قَالَتْ سَوْدَةُ بِنْتُ زَمْعَةَ حِينَ أَسَنَّتْ وَفَرِقَتْ أَنْ يُفَارِقَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا رَسُولَ اللَّهِ يَوْمِي لِعَائِشَةَ فَقَبِلَ ذَلِكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْهَا قَالَتْ نَقُولُ فِي ذَلِكَ أَنْزَلَ اللَّهُ تَعَالَى وَفِي أَشْبَاهِهَا أُرَاهُ قَالَ{ وَإِنْ امْرَأَةٌ خَافَتْ مِنْ بَعْلِهَا نُشُوزًا }",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus], telah menceritakan kepada kami [Abdurrahman bin Abu Az Zinad] dari [Hisyam bin 'Urwah] dari [ayahnya], ia berkata; [Aisyah] berkata; wahai anak saudariku, Rasulullah shallallahu 'alaihi wasallam tidak melebihkan sebagian kami atas sebagian yang lain dalam membagi waktu tinggalnya bersama kami. Setiap hari beliau mengelilingi kami semua dan mendekat kepada seluruh isteri tanpa menyentuh hingga sampai kepada rumah isteri yang hari itu merupakan bagiannya, kemudian beliau bermalam padanya. Sungguh Saudah binti Zam'ah ketika telah berusia lanjut dan takut ditinggalkan Rasulullah shallallahu 'alaihi wasallam, ia berkata; wahai Rasulullah, hariku untuk Aisyah. Dan Rasulullah shallallahu 'alaihi wasallam menerima hal tersebut. Ia berkata; kami katakan; mengenai hal tersebut dan orang yang semisalnya, Allah Ta'ala menurunkan ayat: \"Dan jika seorang wanita khawatir akan nusyuz.\""
            },
            {
                "number": 1824,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ مَعِينٍ وَمُحَمَّدُ بْنُ عِيسَى الْمَعْنَى قَالَا حَدَّثَنَا عَبَّادُ بْنُ عَبَّادٍ عَنْ عَاصِمٍ عَنْ مُعَاذَةَ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَأْذِنُنَا إِذَا كَانَ فِي يَوْمِ الْمَرْأَةِ مِنَّا بَعْدَمَا نَزَلَتْ{ تُرْجِي مَنْ تَشَاءُ مِنْهُنَّ وَتُؤْوِي إِلَيْكَ مَنْ تَشَاءُ }قَالَتْ مَعَاذَةُ فَقُلْتُ لَهَا مَا كُنْتِ تَقُولِينَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ كُنْتُ أَقُولُ إِنْ كَانَ ذَلِكَ إِلَيَّ لَمْ أُوثِرْ أَحَدًا عَلَى نَفْسِي",
                "id": "Telah menceritakan kepada kami [Yahya bin Ma'in], serta [Muhammad bin Isa] secara makna, mereka berkata; telah menceritakan kepada kami ['Abbad bin 'Abbad] dari ['Ashim] dari [Mu'adzah] dari [Aisyah], ia berkata; Rasulullah shallallahu 'alaihi wasallam meminta izin kepada kami apabila berada pada hari (giliran) seorang isteri dari kami setelah turunnya ayat: \"Kamu boleh menangguhkan menggauli siapa yang kamu kehendaki di antara mereka (isteri-isterimu) dan (boleh pula) menggauli siapa yang kamu kehendaki.\" Mu'adzah berkata; kemudian aku katakan kepada Aisyah; apa yang engkau katakan kepada Rasulullah shallallahu 'alaihi wasallam? Ia berkata; aku katakan; apabila hal itu diserahkan kepadaku, maka aku tidak akan mendahulukan seorangpun atas diriku. "
            },
            {
                "number": 1825,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا مَرْحُومُ بْنُ عَبْدِ الْعَزِيزِ الْعَطَّارُ حَدَّثَنِي أَبُو عِمْرَانَ الْجَوْنِيُّ عَنْ يَزِيدَ بْنِ بَابَنُوسَ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ إِلَى النِّسَاءِ تَعْنِي فِي مَرَضِهِ فَاجْتَمَعْنَ فَقَالَ إِنِّي لَا أَسْتَطِيعُ أَنْ أَدُورَ بَيْنَكُنَّ فَإِنْ رَأَيْتُنَّ أَنْ تَأْذَنَّ لِي فَأَكُونَ عِنْدَ عَائِشَةَ فَعَلْتُنَّ فَأَذِنَّ لَهُ",
                "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Marhum bin Abdul Aziz Al 'Aththar], telah menceritakan kepadaku [Abu Imran Al Jauni] dari [Yazid bin Babanus] dari [Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam mengirimkan utusan kepada para isterinya ketika beliau sedang sakit, kemudian mereka berkumpul, lalu beliau berkata: \"Sesungguhnya aku tidak mampu untuk berkeliling diantara kalian, maka apabila kalian mengizinkan aku untuk berada di sisi Aisyah, maka lakukanlah.\" Kemudian mereka mengizinkan beliau. "
            },
            {
                "number": 1826,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ أَخْبَرَنَا ابْنُ وَهْبٍ عَنْ يُونُسَ عَنْ ابْنِ شِهَابٍ أَنَّ عُرْوَةَ بْنَ الزُّبَيْرِ حَدَّثَهُ أَنَّ عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَرَادَ سَفَرًا أَقْرَعَ بَيْنَ نِسَائِهِ فَأَيَّتُهُنَّ خَرَجَ سَهْمُهَا خَرَجَ بِهَا مَعَهُ وَكَانَ يَقْسِمُ لِكُلِّ امْرَأَةٍ مِنْهُنَّ يَوْمَهَا وَلَيْلَتَهَا غَيْرَ أَنَّ سَوْدَةَ بِنْتَ زَمْعَةَ وَهَبَتْ يَوْمَهَا لِعَائِشَةَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin 'Amr bin As Sarh], telah mengabarkan kepada kami [Ibnu Wahb] dari [Yunus] dari [Ibnu Syihab] bahwa ['Urwah bin Az Zubair] telah menceritakan kepadanya bahwa [Aisyah] isteri Nabi shallallahu 'alaihi wasallam berkata; Rasulullah shallallahu 'alaihi wasallam apabila hendak bepergian beliau mengundi diantara para isterinya, siapa diantara mereka yang keluar undiannya maka beliau keluar bersamanya. Dan beliau membagi bagian untuk setiap isteri satu hari satu malam, hanya saja Saudah binti Zam'ah telah memberikan harinya untuk Aisyah. "
            },
            {
                "number": 1827,
                "arab": "حَدَّثَنَا عِيسَى بْنُ حَمَّادٍ أَخْبَرَنِي اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ أَبِي الْخَيْرِ عَنْ عُقْبَةَ بْنِ عَامِرٍعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ إِنَّ أَحَقَّ الشُّرُوطِ أَنْ تُوفُوا بِهِ مَا اسْتَحْلَلْتُمْ بِهِ الْفُرُوجَ",
                "id": "Telah menceritakan kepada kami [Isa bin Hammad], telah mengabarkan kepadaku [Al Laits] dari [Yazid bin Abu Habib] dari [Abu Al Khair] dari ['Uqbah bin 'Amir] dari Rasulullah shallallahu 'alaihi wasallam bahwa beliau bersabda: \"Sesungguhnya syarat yang paling berhak untuk dipenuhi adalah (syarat) yang kalian gunakan untuk menghalalkan farji.\""
            },
            {
                "number": 1828,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا إِسْحَقُ بْنُ يُوسُفَ عَنْ شَرِيكٍ عَنْ حُصَيْنٍ عَنْ الشَّعْبِيِّ عَنْ قَيْسِ بْنِ سَعْدٍ قَالَأَتَيْتُ الْحِيرَةَ فَرَأَيْتُهُمْ يَسْجُدُونَ لِمَرْزُبَانٍ لَهُمْ فَقُلْتُ رَسُولُ اللَّهِ أَحَقُّ أَنْ يُسْجَدَ لَهُ قَالَ فَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ إِنِّي أَتَيْتُ الْحِيرَةَ فَرَأَيْتُهُمْ يَسْجُدُونَ لِمَرْزُبَانٍ لَهُمْ فَأَنْتَ يَا رَسُولَ اللَّهِ أَحَقُّ أَنْ نَسْجُدَ لَكَ قَالَ أَرَأَيْتَ لَوْ مَرَرْتَ بِقَبْرِي أَكُنْتَ تَسْجُدُ لَهُ قَالَ قُلْتُ لَا قَالَ فَلَا تَفْعَلُوا لَوْ كُنْتُ آمِرًا أَحَدًا أَنْ يَسْجُدَ لِأَحَدٍ لَأَمَرْتُ النِّسَاءَ أَنْ يَسْجُدْنَ لِأَزْوَاجِهِنَّ لِمَا جَعَلَ اللَّهُ لَهُمْ عَلَيْهِنَّ مِنْ الْحَقِّ",
                "id": "Telah menceritakan kepada kami ['Amr bin 'Aun], telah mengabarkan kepada kami [Ishaq bin Yusuf] dari [Syarik], dari [Hushain], dari [Asy Sya'bi] dari [Qais bin Sa'd], ia berkata; aku datang ke Al Hirah (negeri lama yang berada di Kufah), maka aku melihat mereka bersujud kepada penunggang kuda mereka yang pemberani. Lalu aku katakan; Rasulullah shallallahu 'alaihi wasallam lebih berhak untuk dilakukan sujud kepadanya. Qais bin Sa'd berkata; kemudian aku datang kepada Nabi shallallahu 'alaihi wasallam dan aku katakan; sesungguhnya aku datang ke Al Hirah dan aku melihat mereka bersujud kepada penunggang kuda mereka yang pemberani. Engkau wahai Rasulullah, lebih berhak untuk kami bersujud kepadamu. Beliau berkata: \"Bagaimana pendapatmu, seandainya engkau melewati kuburanku, apakah engkau akan bersujud kepadanya?\" Qais bin Sa'd berkata; aku katakan; tidak. Beliau bersabda: \"Jangan kalian lakukan, seandainya aku boleh memerintahkan seseorang untuk bersujud kepada seseorang, niscaya aku perintahkan para wanita agar bersujud kepada suami-suami mereka, karena hak yang telah Allah berikan atas mereka.\""
            },
            {
                "number": 1829,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو الرَّازِيُّ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا دَعَا الرَّجُلُ امْرَأَتَهُ إِلَى فِرَاشِهِ فَأَبَتْ فَلَمْ تَأْتِهِ فَبَاتَ غَضْبَانَ عَلَيْهَا لَعَنَتْهَا الْمَلَائِكَةُ حَتَّى تُصْبِحَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin 'Amr Ar Razi], telah menceritakan kepada kami [Jarir], dari [Al A'masy], dari [Abu Hazim], dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Apabila seorang laki-laki memanggil isterinya ke ranjangnya (mengajak melakukan hubungan badan), kemudian sang istri menolak dan tidak datang kepadanya sehingga suaminya melewati malam (tidur) dalam keadaan marah, maka Malaikat akan melaknatnya hingga pagi.\""
            },
            {
                "number": 1830,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا أَبُو قَزَعَةَ الْبَاهِلِيُّ عَنْ حَكِيمِ بْنِ مُعَاوِيَةَ الْقُشَيْرِيِّ عَنْ أَبِيهِ قَالَقُلْتُ يَا رَسُولَ اللَّهِ مَا حَقُّ زَوْجَةِ أَحَدِنَا عَلَيْهِ قَالَ أَنْ تُطْعِمَهَا إِذَا طَعِمْتَ وَتَكْسُوَهَا إِذَا اكْتَسَيْتَ أَوْ اكْتَسَبْتَ وَلَا تَضْرِبْ الْوَجْهَ وَلَا تُقَبِّحْ وَلَا تَهْجُرْ إِلَّا فِي الْبَيْتِقَالَ أَبُو دَاوُد وَلَا تُقَبِّحْ أَنْ تَقُولَ قَبَّحَكِ اللَّهُ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'Il], telah menceritakan kepada kami [Hammad], telah mengabarkan kepada kami [Abu Qaza'ah Al Bahali], dari [Hakim bin Mu'awiyah Al Qusyairi] dari [ayahnya], ia berkata; aku katakan; wahai Rasulullah, apakah hak isteri salah seorang diantara kami atasnya? Beliau berkata: \"Engkau memberinya makan apabila engkau makan, memberinya pakaian apabila engkau berpakaian, janganlah engkau memukul wajah, jangan engkau menjelek-jelekkannya (dengan perkataan atau cacian), dan jangan engkau tinggalkan kecuali di dalam rumah.\" Abu Daud berkata; dan janganlah engkau menjelek-jelekkannya (dengan perkataan atau cacian) dengan mengatakan; semoga Allah memburukkan wajahmu. "
            },
            {
                "number": 1831,
                "arab": "حَدَّثَنَا ابْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا بَهْزُ بْنُ حَكِيمٍ حَدَّثَنِي أَبِي عَنْ جَدِّي قَالَقُلْتُ يَا رَسُولَ اللَّهِ نِسَاؤُنَا مَا نَأْتِي مِنْهُنَّ وَمَا نَذَرُ قَالَ ائْتِ حَرْثَكَ أَنَّى شِئْتَ وَأَطْعِمْهَا إِذَا طَعِمْتَ وَاكْسُهَا إِذَا اكْتَسَيْتَ وَلَا تُقَبِّحْ الْوَجْهَ وَلَا تَضْرِبْقَالَ أَبُو دَاوُد رَوَى شُعْبَةُ تُطْعِمُهَا إِذَا طَعِمْتَ وَتَكْسُوهَا إِذَا اكْتَسَيْتَ",
                "id": "Telah menceritakan kepada kami [Ibnu Basysyar], telah menceritakan kepada kami [Yahya bin Sa'id], telah menceritakan kepada kami [Bahz bin Hakim], telah menceritakan kepadaku [ayahku] dari [kakekku], ia berkata; aku katakan; wahai Rasulullah, apa yang boleh kami lakukan dalam menggauli istri kami dan apa yang harus kami tinggalkan? Beliau menjawab: \"Datangilah tanah tempat bercocok-tanammu itu bagaimana saja kamu kehendaki. Dan berilah mereka makan apabila engkau makan, berilah ia pakaian apabila engkau berpakaian, dan janganlah engkau menjelekkan (mencaci) wajah(nya), serta janganlah engkau memukul (wajahnya).\" Abu Daud berkata; [Syu'bah] telah meriwayatkan dengan kata; engkau memberinya makan apabila engkau makan, dan memberinya pakaian apabila engkau memakai pakaian. "
            },
            {
                "number": 1832,
                "arab": "أَخْبَرَنِي أَحْمَدُ بْنُ يُوسُفَ الْمُهَلَّبِيُّ النَّيْسَابُورِيُّ حَدَّثَنَا عُمَرُ بْنُ عَبْدِ اللَّهِ بْنِ رَزِينٍ حَدَّثَنَا سُفْيَانُ بْنُ حُسَيْنٍ عَنْ دَاوُدَ الْوَرَّاقِ عَنْ سَعِيدِ بْنِ حَكِيمِ بْنِ مُعَاوِيَةَ عَنْ أَبِيهِ عَنْ جَدِّهِ مُعَاوِيَةَ الْقُشَيْرِيِّ قَالَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَقُلْتُ مَا تَقُولُ فِي نِسَائِنَا قَالَ أَطْعِمُوهُنَّ مِمَّا تَأْكُلُونَ وَاكْسُوهُنَّ مِمَّا تَكْتَسُونَ وَلَا تَضْرِبُوهُنَّ وَلَا تُقَبِّحُوهُنَّ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Yusuf Al Muhalli An Naisaburi], telah menceritakan kepada kami [Umar bin Abdullah bin Razin], telah menceritakan kepada kami [Sufyan bin Husain] dari [Daud Al Warraq], dari [Sa'id bin Hakim bin Mu'awiyah], dari [ayahnya] dari [kakeknya yaitu Mu'awiyah Al Qusyairi], ia berkata; aku datang kepada Rasulullah shallallahu 'alaihi wasallam. Mu'awiyah berkata; kemudian aku katakan; bagaimana pendapat engkau mengenai isteri-isteri kami? Beliau bersabda: \"Berilah mereka makan dari apa yang kalian makan, dan berilah mereka pakaian dari apa yang kalian pakai, dan janganlah kalian memukul mereka serta menjelek-jelekkan mereka (dengan perkataan dan cacian).\""
            },
            {
                "number": 1833,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ عَلِيِّ بْنِ زَيْدٍ عَنْ أَبِي حُرَّةَ الرَّقَاشِيِّ عَنْ عَمِّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَإِنْ خِفْتُمْ نُشُوزَهُنَّ فَاهْجُرُوهُنَّ فِي الْمَضَاجِعِقَالَ حَمَّادٌ يَعْنِي النِّكَاحَ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Hammad] dari [Ali bin Zaid], dari [Abu Hurrah Ar Raqasyi], dari [pamannya] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Apabila kalian mengkhawatirkan nusyuz (kedurhakaan) mereka, maka tinggalkan mereka dalam tempat-tempat tidur.\" Hammad berkata; yaitu (tidak) bercampur dengan mereka. "
            },
            {
                "number": 1834,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي خَلَفٍ وَأَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ قَالَ ابْنُ السَّرْحِ عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ عَنْ إِيَاسِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي ذُبَابٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَضْرِبُوا إِمَاءَ اللَّهِ فَجَاءَ عُمَرُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ ذَئِرْنَ النِّسَاءُ عَلَى أَزْوَاجِهِنَّ فَرَخَّصَ فِي ضَرْبِهِنَّ فَأَطَافَ بِآلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نِسَاءٌ كَثِيرٌ يَشْكُونَ أَزْوَاجَهُنَّ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقَدْ طَافَ بِآلِ مُحَمَّدٍ نِسَاءٌ كَثِيرٌ يَشْكُونَ أَزْوَاجَهُنَّ لَيْسَ أُولَئِكَ بِخِيَارِكُمْ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abu Khalaf], serta [Ahmad bin 'Amr bin As Sarh], mereka berkata; telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Abdullah bin Abdullah], Ibnu As Sarh 'Ubaidullah bin Abdullah berkata; dari [Iyas bin Abdullah bin Abu Dzubab], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian memukul hamba-hamba wanita Allah (yakni, istri-istri kalian)!\" Kemudian Umar datang kepada Rasulullah shallallahu 'alaihi wasallam dan berkata; para wanita berani kepada suami-suami mereka. Kemudian beliau memberikan keringanan untuk memukul meraka. Kemudian terdapat banyak wanita yang mengelilingi keluarga Rasulullah shallallahu 'alaihi wasallam, mereka mengeluhkan para suami mereka. Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Sungguh telah terdapat wanita banyak yang mengelilingi keluarga Muhammad dan mengeluhkan para suami mereka. Mereka bukanlah orang pilihan (terbaik) diantara kalian.\" "
            },
            {
                "number": 1835,
                "arab": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ دَاوُدَ بْنِ عَبْدِ اللَّهِ الْأَوْدِيِّ عَنْ عَبْدِ الرَّحْمَنِ الْمُسْلِيِّ عَنْ الْأَشْعَثِ بْنِ قَيْسٍ عَنْ عُمَرَ بْنِ الْخَطَّابِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يُسْأَلُ الرَّجُلُ فِيمَا ضَرَبَ امْرَأَتَهُ",
                "id": "Telah menceritakan kepada kami [Zuhair bin Harb], telah menceritakan kepada kami [Abdurrahman bin Mahdi] telah menceritakan kepada kami [Abu 'Awanah] dari [Daud bin Abdullah Al Audi] dari [Abdurrahman Al Musli] dari [Al Asy'ats bin Qais] dari [Umar bin Al Khathab] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Seorang laki-laki tidaklah ditanya kenapa ia memukul isterinya.\""
            },
            {
                "number": 1836,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ حَدَّثَنِي يُونُسُ بْنُ عُبَيْدٍ عَنْ عَمْرِو بْنِ سَعِيدٍ عَنْ أَبِي زُرْعَةَ عَنْ جَرِيرٍ قَالَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ نَظْرَةِ الْفَجْأَةِ فَقَالَ اصْرِفْ بَصَرَكَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir], telah mengabarkan kepada kami [Sufyan] telah menceritakan kepadaku [Yunus bin 'Ubaid] dari ['Amr bin Sa'id] dari [Abu Zur'ah] dari [Jarir], ia berkata; aku bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai pandangan tiba-tiba. Kemudian beliau berkata: \"Palingkan pandanganmu!\" "
            },
            {
                "number": 1837,
                "arab": "حَدَّثَنَا إِسْمَعِيلُ بْنُ مُوسَى الْفَزَارِيُّ أَخْبَرَنَا شَرِيكٌ عَنْ أَبِي رَبِيعَةَ الْإِيَادِيِّ عَنْ ابْنِ بُرَيْدَةَ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِعَلِيٍّ يَا عَلِيُّ لَا تُتْبِعْ النَّظْرَةَ النَّظْرَةَ فَإِنَّ لَكَ الْأُولَى وَلَيْسَتْ لَكَ الْآخِرَةُ",
                "id": "Telah menceritakan kepada kami [Isma'il bin Musa Al Fazari], telah mengabarkan kepada kami [Syarik] dari [Abu Rabi'ah Al Iyadi] dari [Ibnu Buraidah] dari [ayahnya], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda kepada Ali: \"Wahai Ali, janganlah engkau ikutkan pandangan pertama dengan pandangan yang lain (berikutnya), sesungguhnya bagimu pandangan yang pertama tidak pandangan yang lainnya (berikutnya).\""
            },
            {
                "number": 1838,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي وَائِلٍ عَنْ ابْنِ مَسْعُودٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُبَاشِرُ الْمَرْأَةُ الْمَرْأَةَ لِتَنْعَتَهَا لِزَوْجِهَا كَأَنَّمَا يَنْظُرُ إِلَيْهَا",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abu 'Awanah], dari [Al A'masy] dari [Abu Wail] dari [Ibnu Mas'ud], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah seorang wanita melihat kepada wanita yang lain agar dapat menyebutkan sifat-sifatnya kepada suaminya, sehingga seolah-olah sang suami melihat kepada wanita tersebut.\""
            },
            {
                "number": 1839,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هِشَامٌ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى امْرَأَةً فَدَخَلَ عَلَى زَيْنَبَ بِنْتِ جَحْشٍ فَقَضَى حَاجَتَهُ مِنْهَا ثُمَّ خَرَجَ إِلَى أَصْحَابِهِ فَقَالَ لَهُمْ إِنَّ الْمَرْأَةَ تُقْبِلُ فِي صُورَةِ شَيْطَانٍ فَمَنْ وَجَدَ مِنْ ذَلِكَ شَيْئًا فَلْيَأْتِ أَهْلَهُ فَإِنَّهُ يُضْمِرُ مَا فِي نَفْسِهِ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim], telah menceritakan kepada kami [Hisyam], dari [Abu Az Zubair], dari [Jabir], bahwa Nabi shallallahu 'alaihi wasallam melihat seorang wanita kemudian beliau menemui Zainab binti Jahsy dan menunaikan hajat beliau kepadanya, kemudian keluar menuju para sahabatnya dan berkata kepada mereka: \"Sesungguhnya seorang wanita itu (ketika) datang dalam bentuk syetan. Maka barangsiapa yang (setelah melihatnya) timbul pada dirinya sesuatu (syahwat) hendaknya ia mendatangi isterinya, karena hal tersebut akan melampiaskan syahwatnya (dan ketenangan pikirannya).\" "
            },
            {
                "number": 1840,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ حَدَّثَنَا ابْنُ ثَوْرٍ عَنْ مَعْمَرٍ أَخْبَرَنَا ابْنُ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ قَالَمَا رَأَيْتُ شَيْئًا أَشْبَهَ بِاللَّمَمِ مِمَّا قَالَ أَبُو هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ كَتَبَ عَلَى ابْنِ آدَمَ حَظَّهُ مِنْ الزِّنَا أَدْرَكَ ذَلِكَ لَا مَحَالَةَ فَزِنَا الْعَيْنَيْنِ النَّظَرُ وَزِنَا اللِّسَانِ الْمَنْطِقُ وَالنَّفْسُ تَمَنَّى وَتَشْتَهِي وَالْفَرْجُ يُصَدِّقُ ذَلِكَ وَيُكَذِّبُهُحَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِكُلِّ ابْنِ آدَمَ حَظُّهُ مِنْ الزِّنَا بِهَذِهِ الْقِصَّةِ قَالَ وَالْيَدَانِ تَزْنِيَانِ فَزِنَاهُمَا الْبَطْشُ وَالرِّجْلَانِ تَزْنِيَانِ فَزِنَاهُمَا الْمَشْيُ وَالْفَمُ يَزْنِي فَزِنَاهُ الْقُبَلُ حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ عَجْلَانَ عَنْ الْقَعْقَاعِ بْنِ حَكِيمٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذِهِ الْقِصَّةِ قَالَ وَالْأُذُنُ زِنَاهَا الِاسْتِمَاعُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin 'Ubaid], telah menceritakan kepada kami [Ibnu Tsaur] dari [Ma'mar], telah mengabarkan kepada kami [Ibnu Thawus] dari [ayahnya] dari [Ibnu Abbas], ia berkata; aku tidak melihat sesuatu yang lebih mirip dengan dosa-dosa kecil daripada apa yang dikatakan [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam: \"Sesungguhnya Allah telah menetapkan bagian zina anak keturunan Adam yang pasti ia jumpai, zina kedua mata adalah melihat, zina lidah adalah mengucap, zina hati adalah berangan dan bernafsu, dan kemaluan akan membenarkan hal tersebut atau mendustakannya.\" Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Hammad] dari [Suhail bin Abu Shalih], dari [ayahnya], dari [Abu Hurairah], bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Setiap anak keturunan Adam memiliki bagiannya dari zina….\" Dengan kisah ini, beliau bersabda: \"Kedua tangan berzina dan zinanya adalah menyentuh, kedua kaki berzina dan zinanya adalah berjalan, mulut berzina dan zinanya adalah mencium.\" Telah menceritakan kepada kami [Qutaibah bin Sa'id], Telah menceritakan kepada kami [Al Laits], dari [Ibnu 'Ajlan], dari [Al Qa'qa' bin Hakim] dari [Abu Shalih] dari [Abu Hurairah], dari Nabi shallallahu 'alaihi wasallam dengan kisah ini. Beliau mengatakan: \"Dan zina telinganya adalah mendengar.\""
            },
            {
                "number": 1841,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ بْنِ مَيْسَرَةَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ صَالِحٍ أَبِي الْخَلِيلِ عَنْ أَبِي عَلْقَمَةَ الْهَاشِمِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ يَوْمَ حُنَيْنٍ بَعْثًا إِلَى أَوْطَاسَ فَلَقُوا عَدُوَّهُمْ فَقَاتَلُوهُمْ فَظَهَرُوا عَلَيْهِمْ وَأَصَابُوا لَهُمْ سَبَايَا فَكَأَنَّ أُنَاسًا مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَحَرَّجُوا مِنْ غِشْيَانِهِنَّ مِنْ أَجْلِ أَزْوَاجِهِنَّ مِنْ الْمُشْرِكِينَ فَأَنْزَلَ اللَّهُ تَعَالَى فِي ذَلِكَ{ وَالْمُحْصَنَاتُ مِنْ النِّسَاءِ إِلَّا مَا مَلَكَتْ أَيْمَانُكُمْ }أَيْ فَهُنَّ لَهُمْ حَلَالٌ إِذَا انْقَضَتْ عِدَّتُهُنَّ",
                "id": "Telah menceritakan kepada kami ['Ubaidullah bin Umar bin Maisarah], telah menceritakan kepada kami [Yazid bin Zurai'], telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Shalih Abu Al Khalil] dari [Abu 'Alqamah Al Hasyimi], dari [Abu Sa'id Al Khudri], bahwa Rasulullah shallallahu 'alaihi wasallam telah mengutus sebuah utusan pada saat perang Hunain menuju kepada Suku Authas. Kemudian mereka bertemu dengan musuh mereka, dan berperang dengan mereka. Lalu mereka mengalahkan musuh-musuh tersebut dan mendapatkan wanita-wanita tawanan. Seolah-olah beberapa orang sahabat Rasulullah shallallahu 'alaihi wasallam merasa berat untuk bercampur dengan mereka karena keberadaan suami-suami mereka dari kalangan orang-orang musyrik. Kemudian Allah Ta'ala menurunkan ayat mengenai hal tersebut: \"Dan (diharamkan juga kamu mengawini) wanita yang bersuami, kecuali budak-budak yang kamu miliki.\" Yaitu; mereka halal bagi kalian apabila telah selesai 'iddah mereka. "
            },
            {
                "number": 1842,
                "arab": "حَدَّثَنَا النُّفَيْلِيُّ حَدَّثَنَا مِسْكِينٌ حَدَّثَنَا شُعْبَةُ عَنْ يَزِيدَ بْنِ خُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ أَبِيهِ عَنْ أَبِي الدَّرْدَاءِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ فِي غَزْوَةٍ فَرَأَى امْرَأَةً مُجِحًّا فَقَالَ لَعَلَّ صَاحِبَهَا أَلَمَّ بِهَا قَالُوا نَعَمْ فَقَالَ لَقَدْ هَمَمْتُ أَنْ أَلْعَنَهُ لَعْنَةً تَدْخُلُ مَعَهُ فِي قَبْرِهِ كَيْفَ يُوَرِّثُهُ وَهُوَ لَا يَحِلُّ لَهُ وَكَيْفَ يَسْتَخْدِمُهُ وَهُوَ لَا يَحِلُّ لَهُ",
                "id": "Telah menceritakan kepada kami [An Nufaili], telah menceritakan kepada kami [Miskin], telah menceritakan kepada kami [Syu'bah] dari [Yazid bin Khumair], dari [Abdurrahman bin Jubair bin Nufair] dari [ayahnya], dari [Abu Ad Darda`] bahwa Rasulullah shallallahu 'alaihi wasallam pernah berada dalam suatu peperangan kemudian beliau melihat seorang wanita hamil yang mendekati waktu melahirkan, kemudian beliau berkata; kemungkinan pemiliknya menggaulinya. Mereka berkata; ya. Kemudian beliau berkata: \"Sungguh aku berkeinginan untuk melaknat laki-laki tersebut dengan laknat yang ia bawa masuk dalam kuburnya. Bagaimana ia mewariskan kepada janin tersebut sementara ia tidak halal baginya (karena bukan anaknya), dan bagaimana ia memperbudaknya sementara hal tersebut tidak halal baginya (memperbudaknya sementara ia memang anaknya).\""
            },
            {
                "number": 1843,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا شَرِيكٌ عَنْ قَيْسِ بْنِ وَهْبٍ عَنْ أَبِي الْوَدَّاكِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّوَرَفَعَهُ أَنَّهُ قَالَ فِي سَبَايَا أَوْطَاسَ لَا تُوطَأُ حَامِلٌ حَتَّى تَضَعَ وَلَا غَيْرُ ذَاتِ حَمْلٍ حَتَّى تَحِيضَ حَيْضَةً",
                "id": "Telah menceritakan kepada kami ['Amr bin 'Aun], telah mengabarkan kepada kami [Syarik], dari [Qais bin Wahb] dari [Abu Al Waddak], dari [Abu Sa'id Al Khudri], dan ia memarfu'kan hadits tersebut, bahwa ia berkata mengenai wanita-wanita tawanan dari Suku Authas; wanita hamil tidak boleh digauli hingga melahirkan, dan tidak pula wanita yang tidak hamil hingga mengalami satu kali haid. "
            },
            {
                "number": 1844,
                "arab": "حَدَّثَنَا النُّفَيْلِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ عَنْ أَبِي مَرْزُوقٍ عَنْ حَنَشٍ الصَّنْعَانِيِّ عَنْ رُوَيْفِعِ بْنِ ثَابِتٍ الْأَنْصَارِيِّ قَالَقَامَ فِينَا خَطِيبًا قَالَ أَمَا إِنِّي لَا أَقُولُ لَكُمْ إِلَّا مَا سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يَوْمَ حُنَيْنٍ قَالَ لَا يَحِلُّ لِامْرِئٍ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ أَنْ يَسْقِيَ مَاءَهُ زَرْعَ غَيْرِهِ يَعْنِي إِتْيَانَ الْحَبَالَى وَلَا يَحِلُّ لِامْرِئٍ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ أَنْ يَقَعَ عَلَى امْرَأَةٍ مِنْ السَّبْيِ حَتَّى يَسْتَبْرِئَهَا وَلَا يَحِلُّ لِامْرِئٍ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ أَنْ يَبِيعَ مَغْنَمًا حَتَّى يُقْسَمَحَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ ابْنِ إِسْحَقَ بِهَذَا الْحَدِيثِ قَالَ حَتَّى يَسْتَبْرِئَهَا بِحَيْضَةٍ زَادَ فِيهِ بِحَيْضَةٍ وَهُوَ وَهْمٌ مِنْ أَبِي مُعَاوِيَةَ وَهُوَ صَحِيحٌ فِي حَدِيثِ أَبِي سَعِيدٍ زَادَ وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلَا يَرْكَبْ دَابَّةً مِنْ فَيْءِ الْمُسْلِمِينَ حَتَّى إِذَا أَعْجَفَهَا رَدَّهَا فِيهِ وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلَا يَلْبَسْ ثَوْبًا مِنْ فَيْءِ الْمُسْلِمِينَ حَتَّى إِذَا أَخْلَقَهُ رَدَّهُ فِيهِ قَالَ أَبُو دَاوُد الْحَيْضَةُ لَيْسَتْ بِمَحْفُوظَةٍ وَهُوَ وَهْمٌ مِنْ أَبِي مُعَاوِيَةَ",
                "id": "Telah menceritakan kepada kami [An Nufaili], telah menceritakan kepada kami [Muhammad bin Salamah], dari [Muhammad bin Ishaq], telah menceritakan kepadaku [Yazid bin Abu Habib] dari [Abu Marzuq] dari [Hanasy Ash Shan'ani], dari [Rufaifi' bin Tsabit Al Anshari], ia berkata ketika berkhutbah kepada kami; ketahuilah bahwa aku tidak berbicara kepada kalian kecuali apa yang aku dengar dari Rasulullah shallallahu 'alaihi wasallam. Pada saat perang Hunain beliau berkata: \"Tidak halal bagi orang yang beriman kepada Allah dan Hari Akhir untuk menyiramkan airnya kepada tanaman orang lain -yaitu menggauli wanita-wanita yang sedang hamil\", dan tidak halal bagi seseorang yang beriman kepada Allah dan Hari Akhir untuk menggauli wanita tawanan hingga ia membiarkannya mengalami haid, dan tidaklah halal bagi seseorang yang beriman kepada Allah dan Hari Akhir untuk menjual harta rampasan perang hingga harta tersebut telah dibagikan.\" Telah menceritakan kepada kami [Sa'id bin Manshur], telah menceritakan kepada kami [Abu Mu'awiyah] dari [Ibnu Ishaq], dengan hadits ini. Ia berkata; hingga membiarkannya mengalami satu kali haid. Ia menambahkan kata; satu kali haid. Hal tersebut merupakan suatu kesalahan dari Abu Mu'awiyah, dan hal itu adalah benar dalam hadits Abu Sa'id, ia tambahkan kata: \"Barangsiapa yang beriman kepada Allah dan Hari Akhir, maka janganlah ia mengendarai hewan yang berasal dari harta rampasan perang orang-orang muslim, dan ketika telah menjadi kurus dan lemah maka ia mengembalikannya kepada harta rampasan tersebut. Dan barangsiapa yang beriman kepada Allah dan Hari Akhir maka janganlah ia memakai pakaian yang berasal dari rampasan perang orang-orang muslim, dan ketika telah usang ia mengembalikannya ke dalam rampasan perang tersebut.\" Abu Daud berkata; kata satu kali haid bukanlah sesuatu yang dihafal, hal itu adalah kesalahan dari Abu Mu'awiyah. "
            },
            {
                "number": 1845,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَعَبْدُ اللَّهِ بْنُ سَعِيدٍ قَالَا حَدَّثَنَا أَبُو خَالِدٍ يَعْنِي سُلَيْمَانَ بْنَ حَيَّانَ عَنْ ابْنِ عَجْلَانَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا تَزَوَّجَ أَحَدُكُمْ امْرَأَةً أَوْ اشْتَرَى خَادِمًا فَلْيَقُلْ اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا وَخَيْرَ مَا جَبَلْتَهَا عَلَيْهِ وَأَعُوذُ بِكَ مِنْ شَرِّهَا وَمِنْ شَرِّ مَا جَبَلْتَهَا عَلَيْهِ وَإِذَا اشْتَرَى بَعِيرًا فَلْيَأْخُذْ بِذِرْوَةِ سَنَامِهِ وَلْيَقُلْ مِثْلَ ذَلِكَ قَالَ أَبُو دَاوُد زَادَ أَبُو سَعِيدٍ ثُمَّ لِيَأْخُذْ بِنَاصِيَتِهَا وَلْيَدْعُ بِالْبَرَكَةِ فِي الْمَرْأَةِ وَالْخَادِمِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah], dan [Abdullah bin Sa'id], mereka berkata; telah menceritakan kepada kami [Abu Khalid Sulaiman bin Hayyan] dari [Ibnu 'Ajlan], dari ['Amr bin Syu'aib] dari [ayahnya], dari [kakeknya], dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Apabila salah seorang diantara kalian menikah atau membeli budak maka hendaknya ia mengucapkan; ALLAAHUMMA INNII AS`ALUKA KHAIRAHAA WA KHAIRA MAA JABALTAHAA 'ALAIHI WA A'UUDZU BIKA MIN SYARRIHAA WA SYARRI MAA JABALTAHAA 'ALAIH (Ya Allah, aku memohon kepadaMu kebaikannya dan kebaikan sesuatu yang Engkau ciptakan dia padanya, dan aku berlindung kepadaMu dari keburukannya dan keburukan sesuatu yang Engkau ciptakan dia padanya). Dan apabila ia membeli unta maka hendaknya ia memegang punuknya dan mengucapkan seperti itu!\" Abu Daud berkata; Abu Sa'id menambahkan; kemudian hendaknya ia memegang ubun-ubunnya dan berdoa untuk mendapatkan berkah pada wanita dan budak. "
            },
            {
                "number": 1846,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ كُرَيْبٍ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ أَنَّ أَحَدَكُمْ إِذَا أَرَادَ أَنْ يَأْتِيَ أَهْلَهُ قَالَ بِسْمِ اللَّهِ اللَّهُمَّ جَنِّبْنَا الشَّيْطَانَ وَجَنِّبْ الشَّيْطَانَ مَا رَزَقْتَنَا ثُمَّ قُدِّرَ أَنْ يَكُونَ بَيْنَهُمَا وَلَدٌ فِي ذَلِكَ لَمْ يَضُرَّهُ شَيْطَانٌ أَبَدًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa], telah menceritakan kepada kami [Jarir], dari [Manshur], dari [Salim bin Abu Al Ja'd] dari [Kuraib] dari [Ibnu Abbas], ia berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang diantara kalian hendak mendatangi isterinya (mengaulinya) hendaknya mengucapkan (doa): BISMILLAAH, ALLAAHUMMA JANNIBNASY SYAITHAANA WA JANNIBISY SYAITHAANA MAA RAZAQTANAA (Dengan nama Allah, ya Allah, jauhkan kami dari syetan dan jauhkan syetan dari anak yang Engkau rizqikan kepada kami). Kemudian ditakdirkan mereka berdua memiliki anak dari hubungan tersebut, maka anak tersebut tidak akan diganggu syetan selamanya. "
            },
            {
                "number": 1847,
                "arab": "حَدَّثَنَا هَنَّادٌ عَنْ وَكِيعٍ عَنْ سُفْيَانَ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ الْحَارِثِ بْنِ مَخْلَدٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَلْعُونٌ مَنْ أَتَى امْرَأَتَهُ فِي دُبُرِهَا",
                "id": "Telah menceritakan kepada kami [Hannad] dari [Waki'] dari [Sufyan], dari [Suhail bin Abu Shalih] dari [Al Harits bin Makhlad] dari [Abu Hurairah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ternaknat, orang yang menggauli isterinya pada duburnya.\""
            },
            {
                "number": 1848,
                "arab": "حَدَّثَنَا ابْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ حَدَّثَنَا سُفْيَانُ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ قَالَ سَمِعْتُ جَابِرًا يَقُولُإِنَّ الْيَهُودَ يَقُولُونَ إِذَا جَامَعَ الرَّجُلُ أَهْلَهُ فِي فَرْجِهَا مِنْ وَرَائِهَا كَانَ وَلَدُهُ أَحْوَلَ فَأَنْزَلَ اللَّهُ سُبْحَانَهُ وَتَعَالَى{ نِسَاؤُكُمْ حَرْثٌ لَكُمْ فَأْتُوا حَرْثَكُمْ أَنَّى شِئْتُمْ }",
                "id": "Telah menceritakan kepada kami [Ibnu Basysyar], telah menceritakan kepada kami [Abdurrahman], telah menceritakan kepada kami [Sufyan], dari [Muhammad Al Munkadir], ia berkata; saya mendengar [Jabir] berkata; sesungguhnya orang-orang Yahudi berkata; apabila seorang laki-laki menggauli isterinya pada kemaluannya dari arah belakang maka anaknya juling. Kemudian Allah subhanahu wa ta'ala menurunkan ayat: \"Isteri-isterimu adalah (seperti) tanah tempat kamu bercocok tanam, maka datangilah tanah tempat bercocok-tanammu itu bagaimana saja kamu kehendaki.\""
            },
            {
                "number": 1849,
                "arab": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ يَحْيَى أَبُو الْأَصْبَغِ حَدَّثَنِي مُحَمَّدٌ يَعْنِي ابْنَ سَلَمَةَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ أَبَانَ بْنِ صَالِحٍ عَنْ مُجَاهِدٍ عَنْ ابْنِ عَبَّاسٍ قَالَإِنَّ ابْنَ عُمَرَ وَاللَّهُ يَغْفِرُ لَهُ أَوْهَمَ إِنَّمَا كَانَ هَذَا الْحَيُّ مِنْ الْأَنْصَارِ وَهُمْ أَهْلُ وَثَنٍ مَعَ هَذَا الْحَيِّ مِنْ يَهُودَ وَهُمْ أَهْلُ كِتَابٍ وَكَانُوا يَرَوْنَ لَهُمْ فَضْلًا عَلَيْهِمْ فِي الْعِلْمِ فَكَانُوا يَقْتَدُونَ بِكَثِيرٍ مِنْ فِعْلِهِمْ وَكَانَ مِنْ أَمْرِ أَهْلِ الْكِتَابِ أَنْ لَا يَأْتُوا النِّسَاءَ إِلَّا عَلَى حَرْفٍ وَذَلِكَ أَسْتَرُ مَا تَكُونُ الْمَرْأَةُ فَكَانَ هَذَا الْحَيُّ مِنْ الْأَنْصَارِ قَدْ أَخَذُوا بِذَلِكَ مِنْ فِعْلِهِمْ وَكَانَ هَذَا الْحَيُّ مِنْ قُرَيْشٍ يَشْرَحُونَ النِّسَاءَ شَرْحًا مُنْكَرًا وَيَتَلَذَّذُونَ مِنْهُنَّ مُقْبِلَاتٍ وَمُدْبِرَاتٍ وَمُسْتَلْقِيَاتٍ فَلَمَّا قَدِمَ الْمُهَاجِرُونَ الْمَدِينَةَ تَزَوَّجَ رَجُلٌ مِنْهُمْ امْرَأَةً مِنْ الْأَنْصَارِ فَذَهَبَ يَصْنَعُ بِهَا ذَلِكَ فَأَنْكَرَتْهُ عَلَيْهِ وَقَالَتْ إِنَّمَا كُنَّا نُؤْتَى عَلَى حَرْفٍ فَاصْنَعْ ذَلِكَ وَإِلَّا فَاجْتَنِبْنِي حَتَّى شَرِيَ أَمْرُهُمَا فَبَلَغَ ذَلِكَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ{ نِسَاؤُكُمْ حَرْثٌ لَكُمْ فَأْتُوا حَرْثَكُمْ أَنَّى شِئْتُمْ }أَيْ مُقْبِلَاتٍ وَمُدْبِرَاتٍ وَمُسْتَلْقِيَاتٍ يَعْنِي بِذَلِكَ مَوْضِعَ الْوَلَدِ",
                "id": "Telah menceritakan kepada kami [Abdul Aziz bin Yahya Abu Al Ashbagh], telah menceritakan kepadaku [Muhammad bin Salamah], dari [Muhammad bin Ishaq] dari [Aban bin Shalih] dari [Mujahid] dari [Ibnu Abbas], ia berkata; sesungguhnya Ibnu Umar semoga Allah mengampuninya, ia telah melakukan suatu kesalahan. Sesungguhnya terdapat sebuah kampong anshar yang merupakan para penyembah berhala, hidup bersama kampong yahudi yang merupakan ahli kitab. Dan mereka memandang bahwa orang-orang yahudi memeliki keutamaan atas mereka dalam hal ilmu. Dan mereka mengikuti kebanyakan perbuatan orang-orang yahudi. Diantara keadaan ahli kitab adalah bahwa mereka tidak menggauli isteri mereka kecuali dengan satu cara, dan hal tersebut lebih menjaga rasa malu seorang wanita. Dan orang-orang anshar ini mengikuti perbuatan mereka dalam hal tersebut. Sementara orang-orang Quraisy menggauli isteri-isteri mereka dengan cara yang mereka ingkari, orang-orang Quraisy menggauli mereka dalam keadaan menghadap dan membelakangi serta dalam keadaan terlentang. Kemudian tatkala orang-orang muhajirin datang ke Madinah, salah seorang diantara mereka menikahi seorang wanita anshar. Kemudian ia melakukan hal tersebut. Kemudian wanita anshar tersebut mengingkarinya dan berkata; sesungguhnya kami didatangi dengan satu cara, maka lakukan hal tersebut, jika tidak maka jauhilah aku! Hingga tersebar permasalahan mereka, dan hal tersebut sampai kepada Rasulullah shallallahu 'alaihi wasallam. kemudian Allah 'azza wajalla menurunkan ayat: \"Isteri-isterimu adalah (seperti) tanah tempat kamu bercocok tanam, maka datangilah tanah tempat bercocok-tanammu itu bagaimana saja kamu kehendaki.\" Yakni dalam keadaan menghadap (saling berhadapan), membelakangi dan terlentang, yaitu pada tempat diperolehnya anak (farj). "
            },
            {
                "number": 1850,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا ثَابِتٌ الْبُنَانِيُّ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ الْيَهُودَ كَانَتْ إِذَا حَاضَتْ مِنْهُمْ امْرَأَةٌ أَخْرَجُوهَا مِنْ الْبَيْتِ وَلَمْ يُؤَاكِلُوهَا وَلَمْ يُشَارِبُوهَا وَلَمْ يُجَامِعُوهَا فِي الْبَيْتِ فَسُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ فَأَنْزَلَ اللَّهُ سُبْحَانَهُ وَتَعَالَى{ وَيَسْأَلُونَكَ عَنْ الْمَحِيضِ قُلْ هُوَ أَذًى فَاعْتَزِلُوا النِّسَاءَ فِي الْمَحِيضِ }إِلَى آخِرِ الْآيَةِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَامِعُوهُنَّ فِي الْبُيُوتِ وَاصْنَعُوا كُلَّ شَيْءٍ غَيْرَ النِّكَاحِ فَقَالَتْ الْيَهُودُ مَا يُرِيدُ هَذَا الرَّجُلُ أَنْ يَدَعَ شَيْئًا مِنْ أَمْرِنَا إِلَّا خَالَفَنَا فِيهِ فَجَاءَ أُسَيْدُ بْنُ حُضَيْرٍ وَعَبَّادُ بْنُ بِشْرٍ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَا يَا رَسُولَ اللَّهِ إِنَّ الْيَهُودَ تَقُولُ كَذَا وَكَذَا أَفَلَا نَنْكِحُهُنَّ فِي الْمَحِيضِ فَتَمَعَّرَ وَجْهُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى ظَنَنَّا أَنْ قَدْ وَجَدَ عَلَيْهِمَا فَخَرَجَا فَاسْتَقْبَلَتْهُمَا هَدِيَّةٌ مِنْ لَبَنٍ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَبَعَثَ فِي آثَارِهِمَا فَظَنَنَّا أَنَّهُ لَمْ يَجِدْ عَلَيْهِمَا",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Hammad], telah mengabarkan kepada kami [Tsabit Al Bunani], dari [Anas bin Malik] bahwa orang-orang Yahudi apabila seorang isteri mengalami haid maka mereka mengeluarkannya dari rumah, dan tidak makan bersamanya, tidak mengajaknya bermusyawarah, dan tidak menggaulinya di rumah. Kemudian Rasulullah shallallahu 'alaihi wasallam ditanya mengenai hal tersebut; kemudian Allah subhanahu wa ta'ala menurunkan ayat: \"Mereka bertanya kepadamu tentang haidh. Katakanlah: \"Haidh itu adalah suatu kotoran.\" Oleh sebab itu hendaklah kamu menjauhkan diri dari wanita di waktu haidh.\" Hingga akhir ayat. Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bergaullah dengan mereka di rumah dan lakukan segala sesuatu selain bersenggama.\" Tidaklah orang ini ingin meninggalkan sesuatu yang berasal dari urusan kita melainkan untuk menyelisihi kita. Kemudian Usaid bin Hudhair serta 'Abbad bin Bisyr datang kepada Rasulullah shallallahu 'alaihi wasallam dan berkata; Wahai Rasulullah, sesungguhnya orang-orang Yahudi mengatakan demikian dan demikian, tidakkah kita bercampur dengan mereka (para isteri) di saat sedang haid? Maka merah padam wajah Rasulullah shallallahu 'alaihi wasallam hingga kami menyangka beliau telah murka kepada mereka. Kemudian mereka berdua keluar, kemudian mereka berpapasan dengan hadiah susu yang diberikan kepada Rasulullah shallallahu 'alaihi wasallam. Kemudian beliau mengirim seseorang agar mengejar mereka berdua, hingga kami menyangka bahwa beliau tidak murka kepada mereka. "
            },
            {
                "number": 1851,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ جَابِرِ بْنِ صُبْحٍ قَالَ سَمِعْتُ خِلَاسًا الْهَجَرِيَّ قَالَ سَمِعْتُ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا تَقُولُكُنْتُ أَنَا وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَبِيتُ فِي الشِّعَارِ الْوَاحِدِ وَأَنَا حَائِضٌ طَامِثٌ فَإِنْ أَصَابَهُ مِنِّي شَيْءٌ غَسَلَ مَكَانَهُ وَلَمْ يَعْدُهُ وَإِنْ أَصَابَ تَعْنِي ثَوْبَهُ مِنْهُ شَيْءٌ غَسَلَ مَكَانَهُ وَلَمْ يَعْدُهُ وَصَلَّى فِيهِ",
                "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Yahya] dari [Jabir bin Shubh], ia berkata; saya mendengar [Khilas Al Hajari] berkata; saya mendengar [Aisyah] radliallahu 'anha berkata; aku dan Rasulullah shallallahu 'alaihi wasallam pernah bermalam dalam satu kain, sementara aku dalam keadaan sedang haid. Apabila ada sebagian darah haidku yang mengenai beliau, maka beliau mencuci tempat yang terkena dan tidak melebihinya, dan apabila ada sebagian darah haidku yang mengenai pakaiannya maka beliau mencuci tempat yang terkena dan tidak melebihinya, dan beliau melakukan shalat dengan memakai pakaian tersebut. "
            },
            {
                "number": 1852,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ وَمُسَدَّدٌ قَالَا حَدَّثَنَا حَفْصٌ عَنْ الشَّيْبَانِيِّ عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ عَنْ خَالَتِهِ مَيْمُونَةَ بِنْتِ الْحَارِثِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَرَادَ أَنْ يُبَاشِرَ امْرَأَةً مِنْ نِسَائِهِ وَهِيَ حَائِضٌ أَمَرَهَا أَنْ تَتَّزِرَ ثُمَّ يُبَاشِرُهَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala`] dan [Musaddad], mereka berkata; telah menceritakan kepada kami [Hafsh] dari [Asy Syaibani] dari [Abdullah bin Syaddad] dari [bibinya yaitu Maimunah binti Al Harits] bahwa Rasulullah shallallahu 'alaihi wasallam apabila hendak menggauli isterinya yang sedang haid beliau memerintahkannya agar memakai kain, kemudian beliau menggaulinya. "
            },
            {
                "number": 1853,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ شُعْبَةَ وَغَيْرُهُ عَنْ سَعِيدٍ حَدَّثَنِي الْحَكَمُ عَنْ عَبْدِ الْحَمِيدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ مِقْسَمٍ عَنْ ابْنِ عَبَّاسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الَّذِي يَأْتِي امْرَأَتَهُ وَهِيَ حَائِضٌ قَالَ يَتَصَدَّقُ بِدِينَارٍ أَوْ بِنِصْفِ دِينَارٍ",
                "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Yahya] dari [Syu'bah] dan [yang lainnya], dari [Sa'id], telah menceritakan kepadaku [Al Hakam], dari [Abdul Hamid bin Abdurrahman] dari [Miqsam] dari [Ibnu Abbas], dari Nabi shallallahu 'alaihi wasallam mengenai orang yang mendatangi isterinya dalam keadaan sedang haid: \"Ia harus bersedekah satu dinar atau setengah dinar.\""
            },
            {
                "number": 1854,
                "arab": "حَدَّثَنَا عَبْدُ السَّلَامِ بْنُ مُطَهَّرٍ حَدَّثَنَا جَعْفَرٌ يَعْنِي ابْنَ سُلَيْمَانَ عَنْ عَلِيِّ بْنِ الْحَكَمِ الْبُنَانِيِّ عَنْ أَبِي الْحَسَنِ الْجَزَرِيِّ عَنْ مِقْسَمٍ عَنْ ابْنِ عَبَّاسٍ قَالَإِذَا أَصَابَهَا فِي الدَّمِ فَدِينَارٌ وَإِذَا أَصَابَهَا فِي انْقِطَاعِ الدَّمِ فَنِصْفُ دِينَارٍ",
                "id": "Telah menceritakan kepada kami [Abdus Salam bin Muthahhar], telah menceritakan kepada kami [Ja'far bin Sulaiman] dari [Ali bin Al Hakam Al Bunani] dari [Abu Al Hasan Al Hazari] dari [Miqsam] dari [Ibnu Abbas], ia berkata; apabila menggaulinya ketika sedang haid makan ia bersedekah satu dinar, dan apabila menggaulinya ketika telah terhentinya darah haid (sebelum bersuci) maka ia bersedekah setengah dinar. "
            },
            {
                "number": 1855,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ إِسْمَعِيلَ الطَّالَقَانِيُّ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ أَبِي نَجِيحٍ عَنْ مُجَاهِدٍ عَنْ قَزَعَةَ عَنْ أَبِي سَعِيدٍذُكِرَ ذَلِكَ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْنِي الْعَزْلَ قَالَ فَلِمَ يَفْعَلُ أَحَدُكُمْ وَلَمْ يَقُلْ فَلَا يَفْعَلْ أَحَدُكُمْ فَإِنَّهُ لَيْسَتْ مِنْ نَفْسٍ مَخْلُوقَةٍ إِلَّا اللَّهُ خَالِقُهَاقَالَ أَبُو دَاوُد قَزَعَةُ مَوْلَى زِيَادٍ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Isma'il Ath Thalaqani], telah menceritakan kepada kami [Sufyan] dari [Ibnu Abu Najih] dari [Mujahid] dari [Qaza'ah] dari [Abu Sa'id], telah disebutkan 'azl (mengeluarkan mani di luar rahim) di hadapan Rasulullah shallallahu wa'alaihi wa sallam, kemudian beliau berkata: \"Kenapa salah seorang diantara kalian melakukannya -bukan mengatakan: \"Janganlah salah seorang diantara kalian melakukannya\"-.\"Sesungguhnya tidak ada jiwa yang tercipta kecuali Allah yang menciptakannya.\" Abu Daud berkata; Qaza'ah adalah mantan budak Ziyad. "
            },
            {
                "number": 1856,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا أَبَانُ حَدَّثَنَا يَحْيَى أَنَّ مُحَمَّدَ بْنَ عَبْدِ الرَّحْمَنِ بْنِ ثَوْبَانَ حَدَّثَهُ أَنَّ رِفَاعَةَ حَدَّثَهُ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ رَجُلًا قَالَ يَا رَسُولَ اللَّهِ إِنَّ لِي جَارِيَةً وَأَنَا أَعْزِلُ عَنْهَا وَأَنَا أَكْرَهُ أَنْ تَحْمِلَ وَأَنَا أُرِيدُ مَا يُرِيدُ الرِّجَالُ وَإِنَّ الْيَهُودَ تُحَدِّثُ أَنَّ الْعَزْلَ مَوْءُودَةُ الصُّغْرَى قَالَ كَذَبَتْ يَهُودُ لَوْ أَرَادَ اللَّهُ أَنْ يَخْلُقَهُ مَا اسْتَطَعْتَ أَنْ تَصْرِفَهُ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Aban], telah menceritakan kepada kami [Yahya] bahwa [Muhammad bin Abdurrahman bin Tsauban], menceritakan kepadanya bahwa [Rifa'ah] telah menceritakan kepadanya dari [Abu Sa'id Al Khudri] bahwa seseorang berkata; wahai Rasulullah, sesungguhnya aku memiliki seorang budak perempuan, dan aku melakukan 'azl terhadapnya, serta tidak ingin ia hamil, aku menginginkan apa yang diinginkan laki-laki, sementara orang-orang yahudi mengatakan; bahwa 'azl adalah pembunuhan kecil. Beliau berkata: \"Orang-orang yahudi telah berdusta, seandainya Allah menghendaki untuk menciptakannya, maka mereka tidak akan dapat berpaling darinya.\""
            },
            {
                "number": 1857,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ ابْنِ مُحَيْرِيزٍ قَالَدَخَلْتُ الْمَسْجِدَ فَرَأَيْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ فَجَلَسْتُ إِلَيْهِ فَسَأَلْتُهُ عَنْ الْعَزْلِ فَقَالَ أَبُو سَعِيدٍ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةِ بَنِي الْمُصْطَلِقِ فَأَصَبْنَا سَبْيًا مِنْ سَبْيِ الْعَرَبِ فَاشْتَهَيْنَا النِّسَاءَ وَاشْتَدَّتْ عَلَيْنَا الْعُزْبَةُ وَأَحْبَبْنَا الْفِدَاءَ فَأَرَدْنَا أَنْ نَعْزِلَ ثُمَّ قُلْنَا نَعْزِلُ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ أَظْهُرِنَا قَبْلَ أَنْ نَسْأَلَهُ عَنْ ذَلِكَ فَسَأَلْنَاهُ عَنْ ذَلِكَ فَقَالَ مَا عَلَيْكُمْ أَنْ لَا تَفْعَلُوا مَا مِنْ نَسَمَةٍ كَائِنَةٍ إِلَى يَوْمِ الْقِيَامَةِ إِلَّا وَهِيَ كَائِنَةٌ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi], dari [Malik] dari [Rabi'ah bin Abu Abdurrahman] dari [Muhammad bin Yahya bin Habban] dari [Ibnu Muhairiz], ia berkata; aku pernah memasuki masjid dan melihat [Abu Sa'id Al Khudri], kemudian aku duduk di sampingnya dan bertanya mengenai 'azl. Abu Sa'id berkata; aku pernah keluar bersama Rasulullah shallallahu 'alaihi wasallam ketika perang bersama Bani Mushthaliq, kemudian kami mendapatkan wanita tawanan Arab dan kami menginginkan wanita dan terasa berat kondisi kami yang kurang melakukan jima', sementara kami menginginkan tebusan, maka kami hendak melakukan 'azl. Kemudian kami mengatakan; apakah kita akan melakukan 'azl sementara Rasulullah shallallahu 'alaihi wasallam berada diantara kita sebelum kita bertanya kepada beliau mengenai hal tersebut? Lalu kami bertanya kepada beliau mengenai hal tersebut, lalu beliau berkata: \"Kalian tidak akan tertimpa sesuatu yang membahayakan kalian meski tidak melakukan 'azl, tidaklah suatu jiwa yang tercipta hingga hari Kiamat melainkan jiwa tersebut memang harus tercipta.\""
            },
            {
                "number": 1858,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ حَدَّثَنَا زُهَيْرٌ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَجَاءَ رَجُلٌ مِنْ الْأَنْصَارِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ لِي جَارِيَةً أَطُوفُ عَلَيْهَا وَأَنَا أَكْرَهُ أَنْ تَحْمِلَ فَقَالَ اعْزِلْ عَنْهَا إِنْ شِئْتَ فَإِنَّهُ سَيَأْتِيهَا مَا قُدِّرَ لَهَا قَالَ فَلَبِثَ الرَّجُلُ ثُمَّ أَتَاهُ فَقَالَ إِنَّ الْجَارِيَةَ قَدْ حَمَلَتْ قَالَ قَدْ أَخْبَرْتُكَ أَنَّهُ سَيَأْتِيهَا مَا قُدِّرَ لَهَا",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah], telah menceritakan kepada kami [Al Fadhl bin Dukain], telah menceritakan kepada kami [Zuhair] dari [Abu Az Zubair] dari [Jabir], ia berkata; terdapat seorang laki-laki anshar yang datang kepada Rasulullah shallallahu 'alaihi wasallam dan berkata; sesungguhnya aku memiliki seorang budak wanita, aku bercampur dengannya sementara aku tidak ingin ia hamil. Kemudian beliau berkata: \"Lakukanlah 'azl jika engkau menghendaki, sesungguhnya akan datang apa yang telah ditakdirkan baginya.\" Jabir berkata; orang tersebut tinggal beberapa saat kemudian datang kepada beliau dan berkata; sesungguhnya budak tersebut telah hamil. Beliau berkata: \"Aku telah memberitahukan kepadamu bahwa akan datang kepadanya apa yang telah ditakdirkan untuknya.\""
            },
            {
                "number": 1859,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا بِشْرٌ حَدَّثَنَا الْجُرَيْرِيُّ ح و حَدَّثَنَا مُؤَمَّلٌ حَدَّثَنَا إِسْمَعِيلُ ح و حَدَّثَنَا مُوسَى حَدَّثَنَا حَمَّادٌ كُلُّهُمْ عَنْ الْجُرَيْرِيِّ عَنْ أَبِي نَضْرَةَ حَدَّثَنِي شَيْخٌ مِنْ طُفَاوَةَ قَالَتَثَوَّيْتُ أَبَا هُرَيْرَةَ بِالْمَدِينَةِ فَلَمْ أَرَ رَجُلًا مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَشَدَّ تَشْمِيرًا وَلَا أَقْوَمَ عَلَى ضَيْفٍ مِنْهُ فَبَيْنَمَا أَنَا عِنْدَهُ يَوْمًا وَهُوَ عَلَى سَرِيرٍ لَهُ وَمَعَهُ كِيسٌ فِيهِ حَصًى أَوْ نَوًى وَأَسْفَلَ مِنْهُ جَارِيَةٌ لَهُ سَوْدَاءُ وَهُوَ يُسَبِّحُ بِهَا حَتَّى إِذَا أَنْفَدَ مَا فِي الْكِيسِ أَلْقَاهُ إِلَيْهَا فَجَمَعَتْهُ فَأَعَادَتْهُ فِي الْكِيسِ فَدَفَعَتْهُ إِلَيْهِ فَقَالَ أَلَا أُحَدِّثُكَ عَنِّي وَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قُلْتُ بَلَى قَالَ بَيْنَا أَنَا أُوعَكُ فِي الْمَسْجِدِ إِذْ جَاءَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى دَخَلَ الْمَسْجِدَ فَقَالَ مَنْ أَحَسَّ الْفَتَى الدَّوْسِيَّ ثَلَاثَ مَرَّاتٍ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ هُوَ ذَا يُوعَكُ فِي جَانِبِ الْمَسْجِدِ فَأَقْبَلَ يَمْشِي حَتَّى انْتَهَى إِلَيَّ فَوَضَعَ يَدَهُ عَلَيَّ فَقَالَ لِي مَعْرُوفًا فَنَهَضْتُ فَانْطَلَقَ يَمْشِي حَتَّى أَتَى مَقَامَهُ الَّذِي يُصَلِّي فِيهِ فَأَقْبَلَ عَلَيْهِمْ وَمَعَهُ صَفَّانِ مِنْ رِجَالٍ وَصَفٌّ مِنْ نِسَاءٍ أَوْ صَفَّانِ مِنْ نِسَاءٍ وَصَفٌّ مِنْ رِجَالٍ فَقَالَ إِنْ أَنْسَانِي الشَّيْطَانُ شَيْئًا مِنْ صَلَاتِي فَلْيُسَبِّحْ الْقَوْمُ وَلْيُصَفِّقْ النِّسَاءُ قَالَ فَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يَنْسَ مِنْ صَلَاتِهِ شَيْئًا فَقَالَ مَجَالِسَكُمْ مَجَالِسَكُمْ زَادَ مُوسَى هَا هُنَا ثُمَّ حَمِدَ اللَّهَ تَعَالَى وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ أَمَّا بَعْدُ ثُمَّ اتَّفَقُوا ثُمَّ أَقْبَلَ عَلَى الرِّجَالِ فَقَالَ هَلْ مِنْكُمْ الرَّجُلُ إِذَا أَتَى أَهْلَهُ فَأَغْلَقَ عَلَيْهِ بَابَهُ وَأَلْقَى عَلَيْهِ سِتْرَهُ وَاسْتَتَرَ بِسِتْرِ اللَّهِ قَالُوا نَعَمْ قَالَ ثُمَّ يَجْلِسُ بَعْدَ ذَلِكَ فَيَقُولُ فَعَلْتُ كَذَا فَعَلْتُ كَذَا قَالَ فَسَكَتُوا قَالَ فَأَقْبَلَ عَلَى النِّسَاءِ فَقَالَ هَلْ مِنْكُنَّ مَنْ تُحَدِّثُ فَسَكَتْنَ فَجَثَتْ فَتَاةٌ قَالَ مُؤَمَّلٌ فِي حَدِيثِهِ فَتَاةٌ كَعَابٌ عَلَى إِحْدَى رُكْبَتَيْهَا وَتَطَاوَلَتْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِيَرَاهَا وَيَسْمَعَ كَلَامَهَا فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّهُمْ لَيَتَحَدَّثُونَ وَإِنَّهُنَّ لَيَتَحَدَّثْنَهُ فَقَالَ هَلْ تَدْرُونَ مَا مَثَلُ ذَلِكَ فَقَالَ إِنَّمَا مَثَلُ ذَلِكَ مَثَلُ شَيْطَانَةٍ لَقِيَتْ شَيْطَانًا فِي السِّكَّةِ فَقَضَى مِنْهَا حَاجَتَهُ وَالنَّاسُ يَنْظُرُونَ إِلَيْهِ أَلَا وَإِنَّ طِيبَ الرِّجَالِ مَا ظَهَرَ رِيحُهُ وَلَمْ يَظْهَرْ لَوْنُهُ أَلَا إِنَّ طِيبَ النِّسَاءِ مَا ظَهَرَ لَوْنُهُ وَلَمْ يَظْهَرْ رِيحُهُقَالَ أَبُو دَاوُد وَمِنْ هَا هُنَا حَفِظْتُهُ عَنْ مُؤَمَّلٍ وَمُوسَى أَلَا لَا يُفْضِيَنَّ رَجُلٌ إِلَى رَجُلٍ وَلَا امْرَأَةٌ إِلَى امْرَأَةٍ إِلَّا إِلَى وَلَدٍ أَوْ وَالِدٍ وَذَكَرَ ثَالِثَةً فَأُنْسِيتُهَا وَهُوَ فِي حَدِيثِ مُسَدَّدٍ وَلَكِنِّي لَمْ أُتْقِنْهُ كَمَا أُحِبُّ و قَالَ مُوسَى حَدَّثَنَا حَمَّادٌ عَنْ الْجُرَيْرِيِّ عَنْ أَبِي نَضْرَةَ عَنْ الطُّفَاوِيِّ",
                "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Bisyr], telah menceritakan kepada kami [Al Jurairi]. Dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Muammal], telah menceritakan kepada kami [Isma'il], dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Musa], telah menceritakan kepada kami [Hammad], seluruhnya dari [Al Jurairi], dari [Abu Nadhrah], telah menceritakan kepadaku [seorang Syekh dari Thufawah], ia berkata; aku datang kepada [Abu Hurairah] di Madinah dan tidak melihat seorang pun sahabat Nabi shallallahu 'alaihi wasallam yang paling rajin beribadah dan yang lebih baik dalam mengurus tamu daripada dia. Ketika aku berada di rumahnya pada suatu hari, ia sedang dalam berada di atas ranjangnya membawa kantong yang berisi kerikil atau biji kurma dan di bawahnya terdapat seorang budak wanita yang hitam, ia bertasbih menggunakan kerikil tersebut hingga setelah ia menghabiskan apa yang ada dalam kantong, ia melemparnya kepada budak tersebut yang kemudian mengumpulkannya dan mengembalikannya ke dalam kantong serta menyerahkannya kepada Abu Hurairah. Kemudian Abu Hurairah berkata; maukah aku ceritakan kepadamu dariku dan dari Rasulullah shallallahu 'alaihi wasallam? Syekh tersebut berkata; aku katakan; ya. Abu Hurairah berkata; ketika aku sedang tidak enak badan di masjid, tiba-tiba Rasulullah shallallahu 'alaihi wasallam datang hingga masuk masjid, kemudian berkata: \"Siapakah yang mengetahui seorang pemuda dari Daus?\" Beliau mengatakannya sebanyak tiga kali. Kemudian seorang laki-laki berkata; wahai Rasulullah, itu dia sedang kurang sehat badan di sebelah masjid. Kemudian beliau datang berjalan kaki hingga sampai kepadaku, lalu beliau meletakkan tangannya padaku dan mengucapkan perkataan yang baik kepadaku. Kemudian aku berdiri dan beliau pergi berjalan hingga sampai tempat beliau melakukan shalat. Beliau menghadap kepada mereka dan bersama beliau terdapat dua baris orang laki-laki dan satu baris orang wanita atau dua baris orang wanita dan satu baris orang laki-laki. Beliau berkata: \"Apabila syetan melupakanku dari sebagian shalatku, maka (untuk mengingatkannya) hendaknya (bagi) laki-laki bertasbih dan (bagi) wanita menepuk tangan.\" Abu Hurairah berkata; kemudian Rasulullah shallallahu 'alaihi wasallam melakukan shalat dan tidak lupa sedikitpun dari shalatnya, kemudian beliau berkata: \"Tetaplah kalian di tempat duduk kalian.\" Musa menambahkan kata; di sini. Kemudian beliau memuji Allah Ta'ala kemudian berkata: \"Adapun selanjutnya…..\" kemudian mereka (para perawi) sepakat dengan mengatakan; kemudian beliau menghadap kepada orang laki-laki dan berkata: \"Apakah diantara kalian ada seseorang diantara kalian seseorang yang apabila mendatangi isterinya dan menutup pintunya dan melemparkan tabirnya dan memakai tabir dari Allah?\" Mereka berkata; ya. Abu Hurairah berkata; kemudian setelah itu beliau duduk dan berkata: \"Aku melakukan demikian dan demikian.\" Abu Hurairah berkata; kemudian mereka terdiam. Abu Hurairah berkata; kemudian beliau menghadap kepada para wanita dan berkata: \"Apakah diantara kalian ada yang menceritakannya?\" kemudian mereka terdiam, lalu terdapat seorang wanita muda yang berdiri. Muammal berkata dalam haditsnya; wanita muda yang montok pada salah satu kedua pundaknya dan menaikkan lehernya agar Rasulullah shallallahu 'alaihi wasallam melihatnya dan mendengar perkataannya. Kemudian ia berkata; wahai Rasulullah, sesungguhnya para laki-laki membicarakannya dan para wanita membicarakannya. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tahukah apa permisalan seperti itu?\" kemudian beliau berkata: \"Sesungguhnya permisalan hal tersebut adalah seperti syetan wanita yang bertemu dengan syetan laki-laki di sebuah gang, kemudian syetan laki-laki tersebut menunaikan hajatnya terhadap syetan perempuan sementara orang-orang melihat kepadanya. Ketahuilah bahwa minyak laki-laki adalah yang nampak baunya dan tidak nampak warnanya, dan ketahuilah sesungguhnya minyak wanita adalah yang nampak warnanya dan tidak nampak baunya.\" Abu Daud berkata; dan dari sini aku hafal hadits tersebut dari Muammal dan Musa; \"Ketahuilah, janganlah seorang laki-laki berbaring bersama seorang laki-laki dalam satu kain, dan janganlah seorang wanita berbaring dengan seorang wanita dalam satu kain, kecuali dengan seorang anak kecil atau orang tua.\" Dan beliau menyebutkan yang ketiga, namun aku lupa yang ketiga. Dan hal tersebut terdapat dalam hadits Musaddad akan tetapi aku tidak hafal secara sempurna sebagamana yang aku inginkan. Musa berkata; telah menceritakan kepada kami [Hammad] dari [Al Jurairi] dari [Nadhrah] dari [Ath Thufawi]. "
            }
  ]
}