{
    "kategori": "Kitab Pakaian",
  "hadits": [
    {
                "number": 3504,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا ابْنُ الْمُبَارَكِ عَنْ الْجُرَيْرِيِّ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اسْتَجَدَّ ثَوْبًا سَمَّاهُ بِاسْمِهِ إِمَّا قَمِيصًا أَوْ عِمَامَةً ثُمَّ يَقُولُ اللَّهُمَّ لَكَ الْحَمْدُ أَنْتَ كَسَوْتَنِيهِ أَسْأَلُكَ مِنْ خَيْرِهِ وَخَيْرِ مَا صُنِعَ لَهُ وَأَعُوذُ بِكَ مِنْ شَرِّهِ وَشَرِّ مَا صُنِعَ لَهُقَالَ أَبُو نَضْرَةَ فَكَانَ أَصْحَابُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا لَبِسَ أَحَدُهُمْ ثَوْبًا جَدِيدًا قِيلَ لَهُ تُبْلَى وَيُخْلِفُ اللَّهُ تَعَالَى حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عِيسَى بْنُ يُونُسَ عَنْ الْجُرَيْرِيِّ بِإِسْنَادِهِ نَحْوَهُ حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا مُحَمَّدُ بْنُ دِينَارٍ عَنْ الْجُرَيْرِيِّ بِإِسْنَادِهِ وَمَعْنَاهُ قَالَ أَبُو دَاوُد عَبْدُ الْوَهَّابِ الثَّقَفِيُّ لَمْ يَذْكُرْ فِيهِ أَبَا سَعِيدٍ وَحَمَّادُ ابْنُ سَلَمَةَ قَالَ عَنْ الْجُرَيْرِيِّ عَنْ أَبِي الْعَلَاءِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَبُو دَاوُد حَمَّادُ بْنُ سَلَمَةَ وَالثَّقَفِيُّ سَمَاعُهُمَا وَاحِدٌ",
                "id": "Telah menceritakan kepada kami [Amru bin Aun] berkata, telah mengabarkan kepada kami [Ibnul Mubarak] dari [Al Jurairi] dari [Abu Nadhrah] dari [Abu Sa'id Al Khudri] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam jika mencoba baju baru beliau memulai dengan menyebutkan namanya (baju tersebut), baik itu kemeja atau imamah (semacam surban yang diikatkan pada kepala). Kemudian beliau membaca doa: 'ALLAHUMMA LAKAL HAMDU ANTA KASAUTANI AS`ALUKA MIN KHAIRIHI WA KHAIRI MAA SHUNI'A LAHU WA A'UUDZU BIKA MIN SYARRIHI WA SYARRI MAA SHUNI'A LAHU (Ya Allah, hanya milik-Mu segala puji, Engkaulah yang memberikan pakaian ini kepadaku. Aku memohon kepada-Mu untuk memperoleh kebaikannya dan kebaikan yang terbuat karenanya (untuk beribadah dan ketaatan kepada Allah). Aku berlindung kepada-Mu dari kejahatannya dan kejahatan yang terbuat karenanya (untuk bermaksiat kepada Allah). ' Abu Nadhrah berkata; \"Dan biasanya para sahabat Nabi shallallahu 'alaihi wasallam, jika salah seorang dari mereka memakai baju baru, dikatakatan kepadanya, \"Semoga tahan lama hingga Allah menggantinya dengan yang baru (yakni do`a panjang umur).\" Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Isa bin Yunus] dari [Al Jurairi] dengan sanad yang sama. Telah menceritakan kepada kami [Muslim bin Ibrahim] berkata, telah menceritakan kepada kami [Muhammad bin Dinar] dari [Al Jurairi] dengan sanad dan makna hadits yang sama. Abu Dawud berkata, \" [Abdul Wahhab Ats Tsaqafi] tidak menyebutkan dalam sanadnya nama Abu Sa'id dan [Hammad bin Salamah]. Ia menyebutkan dari [Al Jurairi], dari [Abul 'Ala], dari Nabi shallallahu 'alaihi wasallam.\" Abu Dawud berkata, \"Hammad bin Salamah dan Ats Tsaqafi sumber periwayatan keduanya adalah satu.\""
            },
            {
                "number": 3505,
                "arab": "حَدَّثَنَا نُصَيْرُ بْنُ الْفَرَجِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ حَدَّثَنَا سَعِيدٌ يَعْنِي ابْنَ أَبِي أَيُّوبَ عَنْ أَبِي مَرْحُومٍ عَنْ سَهْلِ بْنِ مُعَاذِ بْنِ أَنَسٍ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَكَلَ طَعَامًا ثُمَّ قَالَ الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنِي هَذَا الطَّعَامَ وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي وَلَا قُوَّةٍ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ وَمَا تَأَخَّرَ قَالَ وَمَنْ لَبِسَ ثَوْبًا فَقَالَ الْحَمْدُ لِلَّهِ الَّذِي كَسَانِي هَذَا الثَّوْبَ وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي وَلَا قُوَّةٍ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ وَمَا تَأَخَّرَ",
                "id": "Telah menceritakan kepada kami [Nushair Ibnul Faraj] berkata, telah menceritakan kepada kami [Abdullah bin Yazid] berkata, telah menceritakan kepada kami [Sa'id] -yaitu Ibnu Abu Ayyub- dari [Abu Marhum] dari [Sahl bin Mu'adz bin Anas] dari [Bapaknya] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa memakan makanan kemudian membaca doa; 'ALHAMDULILLAHIL LADZII ATH'AMANII HADZA ATH THA'AAMA WA RAZAQANIIHI MIN GHAIRI HAULIN MINNI WA LAA QUWWATIN (Segala puji bagi Allah yang telah memberikan makanan ini kepadaku sebagai rizki, tanpa daya dan kekuatan dariku). ' Maka akan diampuni dosanya yang lalu dan yang akan datang. Dan barangsiapa memakai baju lalu membaca doa; 'ALHAMDULILLAHIL LADZII KASAANII HADZA ATS TSAUBA WA RAZAQANIIHI MIN GHAIRI HAULIN MINNI WA LAA QUWWATIN (Segala puji bagi Allah yang telah memberikan pakaian ini kepadaku sebagai rizki, tanpa daya dan kekuatan dariku). ' Maka akan diampuni dosanya yang lalu dan yang akan datang.\""
            },
            {
                "number": 3506,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ الْجَرَّاحِ الْأَذَنِيُّ حَدَّثَنَا أَبُو النَّضْرِ حَدَّثَنَا إِسْحَقُ بْنُ سَعِيدٍ عَنْ أَبِيهِ عَنْ أُمِّ خَالِدٍ بِنْتِ خَالِدِ بْنِ سَعِيدِ بْنِ الْعَاصِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُتِيَ بِكِسْوَةٍ فِيهَا خَمِيصَةٌ صَغِيرَةٌ فَقَالَ مَنْ تَرَوْنَ أَحَقُّ بِهَذِهِ فَسَكَتَ الْقَوْمُ فَقَالَ ائْتُونِي بِأُمِّ خَالِدٍ فَأُتِيَ بِهَا فَأَلْبَسَهَا إِيَّاهَا ثُمَّ قَالَ أَبْلِي وَأَخْلِقِي مَرَّتَيْنِ وَجَعَلَ يَنْظُرُ إِلَى عَلَمٍ فِي الْخَمِيصَةِ أَحْمَرَ أَوْ أَصْفَرَ وَيَقُولُ سَنَاهْ سَنَاهْ يَا أُمَّ خَالِدٍ وَسَنَاهْ فِي كَلَامِ الْحَبَشَةِ الْحَسَنُ",
                "id": "Telah menceritakan kepada kami [Ishaq Ibnul Jarrah Al Adzani] berkata, telah menceritakan kepada kami [Abu An Nadhr] berkata, telah menceritakan kepada kami [Ishaq bin Sa'id] dari [Bapaknya] dari [Ummu Khalid binti Khalid bin Sa'id bin Al Ash] berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah diberi kain yang ada renda suteranya. Lalu beliau bersabda: \"Menurut kalian siapa yang paling berhak untuk mendapat kain ini?\", orang-orang pun diam. Beliau lalu bersabda: \"Datangkanlah Ummu Khalid kepadaku.\" Beliau lantas memberikan kain tersebut dan memakaikannya kepadanya. Setelah itu beliau bersabda: 'Semoga tahan lama hingga Allah menggantinya dengan yang baru (panjang umur). ' -dua kali-. Beliau kemudian melihat tanda berwarna merah atau kuning yang ada pada kain bersulam sutera tersebut, beliau bersabda: \"Wahai Ummu Khalid, sanah, sanah.\" Sanah menurut bahasa orang orang habasyah artinya adalah; bagus, bagus.\""
            },
            {
                "number": 3507,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى عَنْ عَبْدِ الْمُؤْمِنِ بْنِ خَالِدٍ الْحَنَفِيِّ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ أُمِّ سَلَمَةَ قَالَتْكَانَ أَحَبُّ الثِّيَابِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْقَمِيصَ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Musa] berkata, telah menceritakan kepada kami [Al Fadhl bin Musa] dari [Abdul Mukmin bin Khalid Al Hanafi] dari [Abdullah bin Buraidah] dari [Ummu Salamah] ia berkata, \"Pakaian yang paling disukai oleh Rasulullah shallallahu 'alaihi wasallam adalah gamis.\""
            },
            {
                "number": 3508,
                "arab": "حَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ حَدَّثَنَا أَبُو تُمَيْلَةَ قَالَ حَدَّثَنِي عَبْدُ الْمُؤْمِنِ بْنُ خَالِدٍ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ أَبِيهِ عَنْ أُمِّ سَلَمَةَ قَالَتْلَمْ يَكُنْ ثَوْبٌ أَحَبَّ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ قَمِيصٍ",
                "id": "Telah menceritakan kepada kami [Ziyad bin Ayyub] berkata, telah menceritakan kepada kami [Abu Tumailah] ia berkata; telah menceritakan kepadaku [Abdul Mukmin bin Khalid] dari [Abdullah bin Buraidah] dari [Bapaknya] dari [Ummu Salamah] ia berkata, \"Tidak ada pakaian yang paling disukai oleh Rasulullah shallallahu 'alaihi wasallam selain gamis.\""
            },
            {
                "number": 3509,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ عَنْ أَبِيهِ عَنْ بُدَيْلِ بْنِ مَيْسَرَةَ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ أَسْمَاءَ بِنْتِ يَزِيدَ قَالَتْكَانَتْ يَدُ كُمِّ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الرُّسْغِ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Ibrahim Al Hanzhali] berkata, telah menceritakan kepada kami [Mu'adz bin Hisyam] dari [Bapaknya] dari [Budail bin Maisarah] dari [Syahr bin Hausyab] dari [Asma binti Yazid] ia berkata, \"Lengan baju Rasulullah shallallahu 'alaihi wasallam hingga sebatas pergelangan tangan.\""
            },
            {
                "number": 3510,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَيَزِيدُ بْنُ خَالِدِ بْنِ مَوْهَبٍ الْمَعْنَى أَنَّ اللَّيْثَ يَعْنِي ابْنَ سَعْدٍ حَدَّثَهُمْ عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ عَنْ الْمِسْوَرِ بْنِ مَخْرَمَةَ أَنَّهُ قَالَقَسَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقْبِيَةً وَلَمْ يُعْطِ مَخْرَمَةَ شَيْئًا فَقَالَ مَخْرَمَةُ يَا بُنَيَّ انْطَلِقْ بِنَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَانْطَلَقْتُ مَعَهُ قَالَ ادْخُلْ فَادْعُهُ لِي قَالَ فَدَعَوْتُهُ فَخَرَجَ إِلَيْهِ وَعَلَيْهِ قِبَاءٌ مِنْهَا فَقَالَ خَبَأْتُ هَذَا لَكَ قَالَ فَنَظَرَ إِلَيْهِ زَادَ ابْنُ مَوْهَبٍ مَخْرَمَةُ ثُمَّ اتَّفَقَا قَالَ رَضِيَ مَخْرَمَةُ قَالَ قُتَيْبَةُ عَنْ ابْنِ أَبِي مُلَيْكَةَ لَمْ يُسَمِّهِ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Yazid bin Khalid bin Mauhab] secara makna, bahwa [Al Laits] -yaitu Ibnu Sa'd- menceritakan kepada mereka, dari [Abdullah bin Ubaidullah bin Abu Mulaikah] dari [Al Miswar bin Makhramah] Bahwasanya ia berkata, \"Rasulullah shallallahu 'alaihi wasallam membagi-bagikan Aqbiyah (semacam surban), namun beliau tidak memberikan sesuatu pun kepada Makhramah. Maka Makhramah pun berkata, \"Wahai anakku, ikutlah aku menemui Rasulullah shallallahu 'alaihi wasallam.\" Lalu aku ikut pergi bersamanya. Beliau bersabda, \"Masuk, dan panggilkan ia kepadaku.\" Aku lalu memanggil Makhramah, dan Rasulullah keluar menemui Makhramah dengan membawa Aqbiyah. Beliau bersabda: \"Sengaja aku sembunyikan ini untuk kamu.\" Al Miswar berkata, \"Lalu Makhramah melihat Aqbiyah tersebut dan setuju.\" Al Miswar berkata, \"Makhramah telah ridha.\" Qutaibah berkata dari Ibnu Abu Mulaikah, \"Ia tidak menamainya.\""
            },
            {
                "number": 3511,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا أَبُو عَوَانَةَ ح و حَدَّثَنَا مُحَمَّدٌ يَعْنِي ابْنَ عِيسَى عَنْ شَرِيكٍ عَنْ عُثْمَانَ بْنِ أَبِي زُرْعَةَ عَنْ الْمُهَاجِرِ الشَّامِيِّ عَنْ ابْنِ عُمَرَ قَالَ فِي حَدِيثِ شَرِيكٍ يَرْفَعُهُ قَالَمَنْ لَبِسَ ثَوْبَ شُهْرَةٍ أَلْبَسَهُ اللَّهُ يَوْمَ الْقِيَامَةِ ثَوْبًا مِثْلَهُ زَادَ عَنْ أَبِي عَوَانَةَ ثُمَّ تُلَهَّبُ فِيهِ النَّارُحَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو عَوَانَةَ قَالَ ثَوْبَ مَذَلَّةٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa] berkata, telah menceritakan kepada kami [Abu Awanah]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad] -yaitu Ibnu Isa- dari [Syarik] dari [Utsman bin Abu Zur'ah] dari [Al Muhajir Asy Syami] dari [Ibnu Umar] perawi berkata: dalam hadits Syarik yang ia marfu'kan ia berkata, \"Barangsiapa memakai baju kemewahan (karena ingin dipuji), maka pada hari kiamat Allah akan mengenakan untuknya baju semisal. Ia menambahkan dari Abu Awanah, \"lalu akan dilahab oleh api neraka.\" Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Abu Awanah] ia berkata, \"Yaitu baju kehinaan.\""
            },
            {
                "number": 3512,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو النَّضْرِ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ ثَابِتٍ حَدَّثَنَا حَسَّانُ بْنُ عَطِيَّةَ عَنْ أَبِي مُنِيبٍ الْجُرَشِيِّ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَشَبَّهَ بِقَوْمٍ فَهُوَ مِنْهُمْ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abu An Nadhr] berkata, telah menceritakan kepada kami ['Abdurrahman bin Tsabit] berkata, telah menceritakan kepada kami [Hassan bin Athiyah] dari [Abu Munib Al Jurasyi] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa bertasyabuh dengan suatu kaum, maka ia bagian dari mereka.\" "
            },
            {
                "number": 3513,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ خَالِدِ بْنِ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ الرَّمْلِيُّ وَحُسَيْنُ بْنُ عَلِيٍّ قَالَا حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ عَنْ أَبِيهِ عَنْ مُصْعَبِ بْنِ شَيْبَةَ عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْهِ مِرْطٌ مُرَحَّلٌ مِنْ شَعَرٍ أَسْوَدَو قَالَ حُسَيْنٌ حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا",
                "id": "Telah menceritakan kepada kami [Yazid bin Khalid bin Yazid bin Abdullah bin Mauhab Ar Ramli] dan [Husain bin Ali] keduanya berkata; telah menceritakan kepada kami [Ibnu Abu Zaidah] dari [Bapaknya] dari [Mush'ab bin Syaibah] dari [Shafiyah binti Syaibah] dari ['Aisyah radliallahu 'anha] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam keluar dengan mengenakan kain wool bergambar dari bulu berwarna hitam.\" Husain berkata, \"Yahya bin Zakariya telah menceritakan kepada kami.\""
            },
            {
                "number": 3514,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْعَلَاءِ الزُّبَيْدِيُّ حَدَّثَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ عَنْ عَقِيلِ بْنِ مُدْرِكٍ عَنْ لُقْمَانَ بْنِ عَامِرٍ عَنْ عُتْبَةَ بْنِ عَبْدٍ السُّلَمِيِّ قَالَاسْتَكْسَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَسَانِي خَيْشَتَيْنِ فَلَقَدْ رَأَيْتُنِي وَأَنَا أَكْسَى أَصْحَابِي",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Al 'Ala` Az Zubaidi] berkata, telah menceritakan kepada kami [Isma'il bin Ayyasy] dari [Aqil bin Mudrik] dari [Luqman bin Amir] dari [Utbah bin Abd As Sulami] ia berkata, \"Aku minta pakaian kepada Rasulullah shallallahu 'alaihi wasallam, lalu beliau memberiku kain tipis yang bersulam wool, dan aku lihat seakan aku adalah orang yang paling bagus bajunya di antara sahabatku.\""
            },
            {
                "number": 3515,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ أَبِي بُرْدَةَ قَالَقَالَ لِي أَبِي يَا بُنَيَّ لَوْ رَأَيْتَنَا وَنَحْنُ مَعَ نَبِيِّنَا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَدْ أَصَابَتْنَا السَّمَاءُ حَسِبْتَ أَنَّ رِيحَنَا رِيحُ الضَّأْنِ",
                "id": "Telah menceritakan kepada kami [Amru bin Aun] berkata, telah menceritakan kepada kami [Abu Awanah] dari [Qatadah] dari [Abu Burdah] ia berkata, \" [Bapakku] berkata kepadaku, \"Wahai anakku, jika engkau lihat keadaan kami saat bersama Nabi kami shallallahu 'alaihi wasallam yang saat itu terguyur air hujan, maka engkau akan mengira bahwa bau badan kami adalah bau badan kambing.\""
            },
            {
                "number": 3516,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا عُمَارَةُ بْنُ زَاذَانَ عَنْ ثَابِتٍ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ مَلِكَ ذِي يَزَنَ أَهْدَى إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حُلَّةً أَخَذَهَا بِثَلَاثَةٍ وَثَلَاثِينَ بَعِيرًا أَوْ ثَلَاثٍ وَثَلَاثِينَ نَاقَةً فَقَبِلَهَا",
                "id": "Telah menceritakan kepada kami [Amru bin Aun] berkata, telah mengabarkan kepada kami [Umarah bin Zadzan] dari [Tsabit] dari [Anas bin Malik] berkata, \"bahwasanya raja dzi yazan memberi hadiah Rasulullah shallallahu 'alaihi wasallam perhiasan yang ia beli seharga tiga puluh tiga unta jantan, atau tiga puluh tiga unta betina, lalu beliau menerimanya.\""
            },
            {
                "number": 3517,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ عَلِيِّ بْنِ زَيْدٍ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ الْحَارِثِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اشْتَرَى حُلَّةً بِبِضْعَةٍ وَعِشْرِينَ قَلُوصًا فَأَهْدَاهَا إِلَى ذِي يَزَنَ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Hammad] dari [Ali bin Zaid] dari [Ishaq bin Abdullah bin Al Harits] berkata, \"Rasulullah shallallahu 'alaihi wasallam membeli perhiasan seharga lebih dari tiga belas qalush (unta betina yang telah remaja), lalu beliau menghadiahkannya kepada Dzi Yadzan.\""
            },
            {
                "number": 3518,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ ح و حَدَّثَنَا مُوسَى حَدَّثَنَا سُلَيْمَانُ يَعْنِي ابْنَ الْمُغِيرَةِ الْمَعْنَى عَنْ حُمَيْدِ بْنِ هِلَالٍ عَنْ أَبِي بُرْدَةَ قَالَدَخَلْتُ عَلَى عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا فَأَخْرَجَتْ إِلَيْنَا إِزَارًا غَلِيظًا مِمَّا يُصْنَعُ بِالْيَمَنِ وَكِسَاءً مِنْ الَّتِي يُسَمُّونَهَا الْمُلَبَّدَةَ فَأَقْسَمَتْ بِاللَّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُبِضَ فِي هَذَيْنِ الثَّوْبَيْنِ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Hammad]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Musa] berkata, telah menceritakan kepada kami [Sulaiman] -yakni Ibnul Mughirah- secara makna, dari [Humaid bin Hilal] dari [Abu Burdah] ia berkata, \"Aku masuk menemui ['Aisyah] radliallahu 'anha, lalu ia keluar dengan membawa kain sarung tebal buatan Yaman dan kain yang mereka namakan Al Mulabbadah. Kemudian ia bersumpah atas nama Allah, bahwa Rasulullah shallallahu 'alaihi wasallam meninggal saat mengenakan dua kain tersebut.\""
            },
            {
                "number": 3519,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ خَالِدٍ أَبُو ثَوْرٍ الْكَلْبِيُّ حَدَّثَنَا عُمَرُ بْنُ يُونُسَ بْنِ الْقَاسِمِ الْيَمَامِيُّ حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ حَدَّثَنَا أَبُو زُمَيْلٍ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبَّاسٍ قَالَ لَمَّا خَرَجَتْ الْحَرُورِيَّةُ أَتَيْتُ عَلِيًّا رَضِيَ اللَّهُ عَنْهُ فَقَالَ ائْتِ هَؤُلَاءِ الْقَوْمَ فَلَبِسْتُ أَحْسَنَ مَا يَكُونُ مِنْ حُلَلِ الْيَمَنِ قَالَ أَبُو زُمَيْلٍ وَكَانَ ابْنُ عَبَّاسٍ رَجُلًا جَمِيلًا جَهِيرًا قَالَ ابْنُ عَبَّاسٍ فَأَتَيْتُهُمْ فَقَالُوا مَرْحَبًا بِكَ يَا ابْنَ عَبَّاسٍ مَا هَذِهِ الْحُلَّةُقَالَ مَا تَعِيبُونَ عَلَيَّ لَقَدْ رَأَيْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحْسَنَ مَا يَكُونُ مِنْ الْحُلَلِقَالَ أَبُو دَاوُد اسْمُ أَبِي زُمَيْلٍ سِمَاكُ بْنُ الْوَلِيدِ الْحَنَفِيُّ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Khalid Abu Tsaur Al Kalbi] berkata, telah menceritakan kepada kami [Umar bin Yunus bin Al Qasim Al Yamami] berkata, telah menceritakan kepada kami [Ikrimah bin Ammar] berkata, telah menceritakan kepada kami [Abu Zumail] berkata, telah menceritakan kepadaku [Abdullah bin Abbas] ia berkata, \"Ketika orang-orang Haruri keluar, aku menemui Ali radliallahu 'anhu. Lalu ia berkata, 'Datangilah orang-orang (Haruri) itu. ' Maka aku mengenakan pakaian terbaik yang dimiliki bangsa Yaman.\" Abu Zumail berkata, \"Ibnu Abbas adalah seorang laki-laki yang sangat tampan dan enak dipandang. Ibnu Abbas berkata, \"Lantas aku mendatangi orang-orang itu, mereka berkata, \"Selamat datang wahai Ibnu Abbas, ini pakaian apa!\" Ibnu Abbas menjawab, \"Kenapa kalian mencelaku! Sungguh, aku pernah melihat Rasulullah shallallahu 'alaihi wasallam mengenakan pakaian yang sangat bagus.\" Abu Dawud berkata, \"Abu Zumail nama aslinya adalah Simak Ibnul Walid Al Hanafi.\""
            },
            {
                "number": 3520,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ مُحَمَّدٍ الْأَنْمَاطِيُّ الْبَصْرِيُّ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ الرَّازِيُّ ح و حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ الرَّحْمَنِ الرَّازِيُّ حَدَّثَنَا أَبِي أَخْبَرَنِي أَبِي عَبْدُ اللَّهِ بْنُ سَعْدٍ عَنْ أَبِيهِ سَعْدٍ قَالَرَأَيْتُ رَجُلًا بِبُخَارَى عَلَى بَغْلَةٍ بَيْضَاءَ عَلَيْهِ عِمَامَةُ خَزٍّ سَوْدَاءُ فَقَالَ كَسَانِيهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَهَذَا لَفْظُ عُثْمَانَ وَالْإِخْبَارُ فِي حَدِيثِهِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Muhammad Al Anmathi Al Bashari] berkata, telah menceritakan kepada kami ['Abdurrahman bin Abdullah Ar Razi]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ahmad bin 'Abdurrahman Ar Razi] berkata, telah menceritakan kepada kami [Bapakku] berkata, telah mengabarkan kepadaku bapakku [Abdullah bin Sa'd] dari bapaknya [Sa'd] ia berkata, \"Di Bukhara aku melihat [seorang laki-laki] di atas bighal putih mengenakan imamah (semacam surban yang lilitkan pada kepala) hitam bersulam sutera, laki-laki itu lantas berkata, \"Rasulullah shallallahu 'alaihi wasallam mengenakanku imamah ini.\" Ini adalah lafadz Utsman dalam haditsnya. "
            },
            {
                "number": 3521,
                "arab": "حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ نَجْدَةَ حَدَّثَنَا بِشْرُ بْنُ بَكْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ بْنِ جَابِرٍ قَالَ حَدَّثَنَا عَطِيَّةُ بْنُ قَيْسٍ قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ غَنْمٍ الْأَشْعَرِيَّ قَالَ حَدَّثَنِي أَبُو عَامِرٍ أَوْ أَبُو مَالِكٍ وَاللَّهِ يَمِينٌ أُخْرَى مَا كَذَّبَنِيأَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَيَكُونَنَّ مِنْ أُمَّتِي أَقْوَامٌ يَسْتَحِلُّونَ الْخَزَّ وَالْحَرِيرَ وَذَكَرَ كَلَامًا قَالَ يُمْسَخُ مِنْهُمْ آخَرُونَ قِرَدَةً وَخَنَازِيرَ إِلَى يَوْمِ الْقِيَامَةِقَالَ أَبُو دَاوُد وَعِشْرُونَ نَفْسًا مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْ أَكْثَرُ لَبِسُوا الْخَزَّ مِنْهُمْ أَنَسٌ وَالْبَرَاءُ بْنُ عَازِبٍ",
                "id": "Telah menceritakan kepada kami [Abdul Wahhab bin Najdah] berkata, telah menceritakan kepada kami [Bisyr bin Bakr] dari ['Abdurrahman bin Yazid bin Jabir] ia berkata; telah menceritakan kepada kami [Athiyah bin Qais] ia berkata; Aku mendengar ['Abdurrahman bin Ghanm Al Asy'ari] ia berkata; telah menceritakan kepadaku Abu Amir atau [Abu Malik] -demi Allah- ia tidak mendustaiku bahwasanya ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Benar-benar akan ada dari umatku orang-orang yang menghalalkan sutera.\" Lalu ia menyebutkan redaksi lain, beliau bersabda: \"Salah seorang dari mereka diubah menjadi kera dan babi hingga hari kiamat.\" Abu Dawud menyebutkan, \"Ada dua puluh orang atau lebih dari sahabat Rasulullah shallallahu 'alaihi wasallam mengenakan sutera, salah seorang di antara mereka adalah Anas dan Al bara bin Azib.\""
            },
            {
                "number": 3522,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ عُمَرَ بْنَ الْخَطَّابِ رَأَى حُلَّةَ سِيَرَاءَ عِنْدَ بَابِ الْمَسْجِدِ تُبَاعُ فَقَالَ يَا رَسُولَ اللَّهِ لَوْ اشْتَرَيْتَ هَذِهِ فَلَبِسْتَهَا يَوْمَ الْجُمُعَةِ وَلِلْوَفْدِ إِذَا قَدِمُوا عَلَيْكَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا يَلْبَسُ هَذِهِ مَنْ لَا خَلَاقَ لَهُ فِي الْآخِرَةِ ثُمَّ جَاءَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْهَا حُلَلٌ فَأَعْطَى عُمَرَ بْنَ الْخَطَّابِ مِنْهَا حُلَّةً فَقَالَ عُمَرُ يَا رَسُولَ اللَّهِ كَسَوْتَنِيهَا وَقَدْ قُلْتَ فِي حُلَّةِ عُطَارِدَ مَا قُلْتَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي لَمْ أَكْسُكَهَا لِتَلْبَسَهَا فَكَسَاهَا عُمَرُ بْنُ الْخَطَّابِ أَخًا لَهُ مُشْرِكًا بِمَكَّةَحَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ وَعَمْرُو بْنُ الْحَارِثِ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ بِهَذِهِ الْقِصَّةِ قَالَ حُلَّةُ إِسْتَبْرَقٍ وَقَالَ فِيهِ ثُمَّ أَرْسَلَ إِلَيْهِ بِجُبَّةِ دِيبَاجٍ وَقَالَ تَبِيعُهَا وَتُصِيبُ بِهَا حَاجَتَكَ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik] dari [Nafi'] dari [Abdullah bin Umar] berkata, \"Umar Ibnul Khaththab melihat kain bersulam sutera di jual depan pintu masjid. Umar lalu berkata, \"Wahai Rasulullah, sekiranya saja engkau membeli kain ini, sehingga engkau bisa memakainya di hari jum'at dan saat menerima utusan jika datang kepadamu.\" Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Hanyasanya yang mengenakan ini adalah orang-orang yang tidak akan mendapatkan bagian di akhirat.\" Setelah itu didatangkan kepada Rasulullah shallallahu 'alaihi wasallam beberapa potong kain sutera, beliau lantas memberikan sepotong darinya kepada Umar Ibnul Khaththab. Umar lalu bertanya, \"Wahai Rasulullah, kenapa engkau berikan ini kepadaku, padahal engkau telah berkata tentang sutera sebagaimana yang engkau katakan!\" Rasulullah shallallahu 'alaihi wasallam kemudian menjawab: \"Aku berikan itu kepadamu bukan untuk engkau pakai.\" Umar Ibnul Khaththab pun mengenakan kain tersebut untuk saudara laki-lakinya yang masih musyrik di Makkah.\" Telah menceritakan kepada kami [Ahmad bin Shalih] berkata, telah menceritakan kepada kami [Ibnu Wahb] berkata, telah mengabarkan kepadaku [Yunus] dan [Amru Ibnul Harits] dari [Ibnu Syihab] dari [Salim bin Abdullah] dari [Bapaknya] dengan kisah beriku, ia berkata, \"Dengan kain sutera, \" dan ia menyebutkan dalam hadits tersebut, \"Lalu beliau mengirimkan jubbah (selendang) sutera kepada Umar.\" Beliau kemudian bersabda: \"Juallah ini, dan gunakanlah hasil penjualannya untuk memenuhi kebutuhanmu.\""
            },
            {
                "number": 3523,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ حَدَّثَنَا عَاصِمٌ الْأَحْوَلُ عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ قَالَكَتَبَ عُمَرُ إِلَى عُتْبَةَ بْنِ فَرْقَدٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْحَرِيرِ إِلَّا مَا كَانَ هَكَذَا وَهَكَذَا أُصْبُعَيْنِ وَثَلَاثَةً وَأَرْبَعَةً",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Hammad] berkata, telah menceritakan kepada kami [Ashim Al Ahwal] dari [Abu Utsman An Nahdi] ia berkata, \" [Umar] menulis surat kepada Utbah bin Farqad, bahwa Nabi shallallahu 'alaihi wasallam melarang kain sutera kecuali sekian dan sekian. Yakni sekadar dua jari, atau tiga jari, atau empat jari.\""
            },
            {
                "number": 3524,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي عَوْنٍ قَالَ سَمِعْتُ أَبَا صَالِحٍ يُحَدِّثُ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَأُهْدِيَتْ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حُلَّةُ سِيَرَاءَ فَأَرْسَلَ بِهَا إِلَيَّ فَلَبِسْتُهَا فَأَتَيْتُهُ فَرَأَيْتُ الْغَضَبَ فِي وَجْهِهِ وَقَالَ إِنِّي لَمْ أُرْسِلْ بِهَا إِلَيْكَ لِتَلْبَسَهَا وَأَمَرَنِي فَأَطَرْتُهَا بَيْنَ نِسَائِي",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] berkata, telah menceritakan kepada kami [Syu'bah] dari [Abu Aun] ia berkata; Aku mendengar [Abu Shalih] menceritakan dari [Ali radliallahu 'anhu] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam diberi hadiah kain sutera, beliau lalu mengirimkannya kepadaku, maka aku pun memakainya. Setelah itu aku mendatangi beliau, tetapi aku melihat pada wajah beliau tanda kemarahan. Beliau bersabda: \"Aku mengirimkan itu kepadamu bukan untuk engkau pakai.\" Beliau pun memerintahkan kepadaku (untuk memberikan kepada orang lain), sehingga kain itu aku bagikan untuk para perempuanku.\""
            },
            {
                "number": 3525,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ حُنَيْنٍ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ لُبْسِ الْقَسِّيِّ وَعَنْ لُبْسِ الْمُعَصْفَرِ وَعَنْ تَخَتُّمِ الذَّهَبِ وَعَنْ الْقِرَاءَةِ فِي الرُّكُوعِحَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ يَعْنِي الْمَرْوَزِيَّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ حُنَيْنٍ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا قَالَ عَنْ الْقِرَاءَةِ فِي الرُّكُوعِ وَالسُّجُودِ حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بِهَذَا زَادَ وَلَا أَقُولُ نَهَاكُمْ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Nafi'] dari [Ibrahim bin Abdullah bin Hunain] dari [Bapaknya] dari [Ali bin Abu Thalib] radliallahu 'anhu, ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang memakai kain yang bersulam sutera, kain yang dicelup dengan warna kuning, memakai cincin emas dan membaca Al-Qur'an saat rukuk.\" Telah menceritakan kepada kami [Ahmad bin Muhammad] -yaitu Al Marwazi- berkata, telah menceritakan kepada kami [Abdurrazaq] berkata, telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Ibrahim bin Abdullah bin Hunain] dari [Bapaknya] dari [Ali bin Abu Thalib] radliallahu 'anhu, dari Nabi shallallahu 'alaihi wasallam dengan redaksi hadits seperti ini. Ali berkata: \".. (beliau melarang) membaca Al-Qur'an saat rukuk dan sujud\", Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Hammad] dari [Muhammad bin Amru] dari [Ibrahim bin Abdullah] dengan lafadz seperti ini dengan menambahkan, \"Dan aku tidak mengatakan 'beliau melarang kalian' (maksudnya; Muhammad bin Amru menambahkan dalam riwayatnya bahwa Ali berkata; Rasulullah Shallahu 'Alaihi Wasallam melarangku dan aku tidak berkata beliau melarang kalian).\""
            },
            {
                "number": 3526,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ عَلِيِّ بْنِ زَيْدٍ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ مَلِكَ الرُّومِ أَهْدَى إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُسْتُقَةً مِنْ سُنْدُسٍ فَلَبِسَهَا فَكَأَنِّي أَنْظُرُ إِلَى يَدَيْهِ تَذَبْذَبَانِ ثُمَّ بَعَثَ بِهَا إِلَى جَعْفَرٍ فَلَبِسَهَا ثُمَّ جَاءَهُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي لَمْ أُعْطِكَهَا لِتَلْبَسَهَا قَالَ فَمَا أَصْنَعُ بِهَا قَالَ أَرْسِلْ بِهَا إِلَى أَخِيكَ النَّجَاشِيِّ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Hammad] dari [Ali bin Zaid] dari [Anas bin Malik] berkata, \"Raja Rum memberi haidah kepada Nabi shallallahu 'alaihi wasallam berupa farwah (sejenis jubah) sutera, lalu beliau mengenakannya. Seakan aku melihat tangan nabi bergerak-gerak (mengkibas), beliau lalu mengirimkan jubah itu kepada Ja'far, hingga ia pun memakainya. Ketika Ja'far datang kepada Nabi shallallahu 'alaihi wasallam, maka beliau bersabda: \"Aku berikan itu kepadamu bukan untuk engkau pakai!\" Ja'far bertanya, \"Lalu apa yang harus aku lakukan terhadap jubah itu?\" beliau menjawab: \"Kirimkanlah kepada saudaramu, raja Najasyi.\""
            },
            {
                "number": 3527,
                "arab": "حَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ حَدَّثَنَا رَوْحٌ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍأَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا أَرْكَبُ الْأُرْجُوَانَ وَلَا أَلْبَسُ الْمُعَصْفَرَ وَلَا أَلْبَسُ الْقَمِيصَ الْمُكَفَّفَ بِالْحَرِيرِ قَالَ وَأَوْمَأَ الْحَسَنُ إِلَى جَيْبِ قَمِيصِهِ قَالَ وَقَالَ أَلَا وَطِيبُ الرِّجَالِ رِيحٌ لَا لَوْنَ لَهُ أَلَا وَطِيبُ النِّسَاءِ لَوْنٌ لَا رِيحَ لَهُقَالَ سَعِيدٌ أُرَهُ قَالَ إِنَّمَا حَمَلُوا قَوْلَهُ فِي طِيبِ النِّسَاءِ عَلَى أَنَّهَا إِذَا خَرَجَتْ فَأَمَّا إِذَا كَانَتْ عِنْدَ زَوْجِهَا فَلْتَطَّيَّبْ بِمَا شَاءَتْ",
                "id": "Telah menceritakan kepada kami [Makhlad bin Khalid] berkata, telah menceritakan kepada kami [Rauh] berkata, telah menceritakan kepada kami [Sa'id bin Abu Arubah] dari [Qatadah] dari [Al Hasan] dari [Imran bin Hushain] bahwa Nabi Allah shallallahu 'alaihi wasallam bersabda: \"Aku tidak akan memakai alas pelana yang berwarna merah, dan tidak pula kain yang dicelup dengan warna kuning serta tidak akan memakai kain yang bersulam sutera (pada lengannya).\" Imran berkata, \"Lalu Hasan berisyarat pada saku bajunya.\" Imran berkata, \"beliau lalu bersabda: \"Ketahuilah, minyak wangi bagi laki-laki itu beraroma tetapi tidak berwarna, sedangkan minyak wangi bagi wanita itu berwarna tetapi tidak beraroma.\" Sa'id berkata, \"Menurutku bahwa ucapan beliau tentang minyak wangi wanita itu dipahami dalam kondisi saat ia keluar rumah, adapaun jika wanita itu sedang bersama suaminya, maka ia boleh mengenakan wewangian sesuka hatinya.\""
            },
            {
                "number": 3528,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ خَالِدِ بْنِ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ الْهَمْدَانِيُّ أَخْبَرَنَا الْمُفَضَّلُ يَعْنِي ابْنَ فَضَالَةَ عَنْ عَيَّاشِ بْنِ عَبَّاسٍ الْقِتْبَانِيِّ عَنْ أَبِي الْحُصَيْنِ يَعْنِي الْهَيْثَمَ بْنَ شَفِيٍّ قَالَخَرَجْتُ أَنَا وَصَاحِبٌ لِي يُكْنَى أَبَا عَامِرٍ رَجُلٌ مِنْ الْمَعَافِرِ لِنُصَلِّيَ بِإِيلْيَاءَ وَكَانَ قَاصُّهُمْ رَجُلٌ مِنْ الْأَزْدِ يُقَالُ لَهُ أَبُو رَيْحَانَةَ مِنْ الصَّحَابَةِ قَالَ أَبُو الْحُصَيْنِ فَسَبَقَنِي صَاحِبِي إِلَى الْمَسْجِدِ ثُمَّ رَدِفْتُهُ فَجَلَسْتُ إِلَى جَنْبِهِ فَسَأَلَنِي هَلْ أَدْرَكْتَ قَصَصَ أَبِي رَيْحَانَةَ قُلْتُ لَا قَالَ سَمِعْتُهُيَقُولُ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ عَشْرٍ عَنْ الْوَشْرِ وَالْوَشْمِ وَالنَّتْفِ وَعَنْ مُكَامَعَةِ الرَّجُلِ الرَّجُلَ بِغَيْرِ شِعَارٍ وَعَنْ مُكَامَعَةِ الْمَرْأَةِ الْمَرْأَةَ بِغَيْرِ شِعَارٍ وَأَنْ يَجْعَلَ الرَّجُلُ فِي أَسْفَلِ ثِيَابِهِ حَرِيرًا مِثْلَ الْأَعَاجِمِ أَوْ يَجْعَلَ عَلَى مَنْكِبَيْهِ حَرِيرًا مِثْلَ الْأَعَاجِمِ وَعَنْ النُّهْبَى وَرُكُوبِ النُّمُورِ وَلُبُوسِ الْخَاتَمِ إِلَّا لِذِي سُلْطَانٍقَالَ أَبُو دَاوُد الَّذِي تَفَرَّدَ بِهِ مِنْ هَذَا الْحَدِيثِ ذِكْرُ الْخَاتَمِ",
                "id": "Telah menceritakan kepada kami [Yazid bin Khalid bin Abdullah bin Mauhab Al Hamdani] berkata, telah mengabarkan kepadaku [Al Mufadhdhal] -yaitu Ibnu Fadhalah- dari [Ayyasy bin Abbas Al Qitbani] dari [Abu Al Hushain] -yaitu Al Haitsam bin Syafi ia berkata, \"Aku dan seorang sahabatku yang dipanggil dengan nama [Abu Amir], seorang laki-laki dari Al Ma'afir, keluar untuk melaksanakan shalat di Illiya. Mereka (penduduk setempat) mempunyai penasihat seorang laki-laki dari Al Azdi, ia biasa dipanggil dengan nama Abu raihanah, seorang sahabat Nabi.\" Abu Al Hushain berkata, \"Sahabatku tersebut mendahuluiku datang ke masjid, lalu aku menyusul dari belakang dan duduk di sisinya. Ia lantas bertanya kepadaku, \"Apakah kamu mendengar cerita [Abu Raihanah]?\" Aku menjawab, \"Tidak.\" Ia berkata, \"Aku mendengar dia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang dari sepuluh hal; mengikir gigi, membuat tato, mencabut alis, seorang laki-laki tidur dengan laki-laki lain dalam satu selimut tanpa ada kain pembatas, seorang wanita tidur dengan wanita lain dalam satu selimut tanpa ada kain pembatas, seorang laki-laki yang menambahi sutera pada bagian bawah kainnya seperti orang 'ajam (bukan arab), atau menjadikan pada kain di bagian pundaknya berupa sutera seperi orang 'ajam. Beliau juga melarang dari merampas harta orang lain, memakai kulit macan, dan mamakai cincin kecuali penguasa.\" Abu Dawud berkata \" yang membuat hadits ini menyendiri dan berbeda dengan hadits lainnya adalah penyebutan lafadh; 'dan memakai cincin\". "
            },
            {
                "number": 3529,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ حَدَّثَنَا رَوْحٌ حَدَّثَنَا هِشَامٌ عَنْ مُحَمَّدٍ عَنْ عَبِيدَةَ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَنُهِيَ عَنْ مَيَاثِرِ الْأُرْجُوَانِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Habib] berkata, telah menceritakan kepada kami [Rauh] berkata, telah menceritakan kepada kami [Hisyam] dari [Muhammad] dari [Abidah] dari [Ali radliallahu 'anhu] ia berkata, \"Telah dilarang pemakaian alas penala yang terbuat dari sulaman sutera.\""
            },
            {
                "number": 3530,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ وَمُسْلِمُ بْنُ إِبْرَاهِيمَ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ عَنْ هُبَيْرَةَ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَنَهَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ خَاتَمِ الذَّهَبِ وَعَنْ لُبْسِ الْقَسِّيِّ وَالْمِيثَرَةِ الْحَمْرَاءِ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar] dan [Muslim bin Ibrahim] keduanya berkata; telah menceritakan kepada kami [Syu'bah] dari [Abu Ishaq] dari [Hubairah] dari [Ali radliallahu 'anhu] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarangku memakai cincin emas, memakai kain yang bersulam sutera dan alas pelana yang berwarna merah.\""
            },
            {
                "number": 3531,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ حَدَّثَنَا ابْنُ شِهَابٍ الزُّهْرِيُّ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَاأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى فِي خَمِيصَةٍ لَهَا أَعْلَامٌ فَنَظَرَ إِلَى أَعْلَامِهَا فَلَمَّا سَلَّمَ قَالَ اذْهَبُوا بِخَمِيصَتِي هَذِهِ إِلَى أَبِي جَهْمٍ فَإِنَّهَا أَلْهَتْنِي آنِفًا فِي صَلَاتِي وَأْتُونِي بِأَنْبِجَانِيَّتِهِقَالَ أَبُو دَاوُد أَبُو جَهْمٍ بْنُ حُذَيْفَةَ مِنْ بَنِي عَدِيِّ بْنِ كَعْبِ بْنِ غَانِمٍ حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ فِي آخَرِينَ قَالُوا حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ نَحْوَهُ وَالْأَوَّلُ أَشْبَعُ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Ibrahim bin Sa'd] berkata, telah menceritakan kepada kami [Ibnu Syihab Az Zuhri] dari [Urwah bin Az Zubair] dari ['Aisyah radliallahu 'anha] bahwa Rasulullah shallallahu 'alaihi wasallam pernah shalat menggunakan kain yang ada gambarnya. Beliau lalu melihat gambar pada kainnya, selesai salam beliau bersabda: \"Bawalah kainku ini kepada Abu Jahm, sesungguhnya ia telah mengganggu shalatku, lalu bawalah kepadaku kainnya yang tidak bergambar.\" Abu Dawud berkata, \"Abu Jahm bin Khudzaifah berasal dari bani Adi bin Ka'b bin Ghanim.\" Dan telah menceritakan kepada kami [Utsman bin Abu Syaibah] dalam hadis-hadis lain, (mereka katakan), telah menceritakan kepada kami [Sufyan] dari [Azzuhri] dari ['Urwah] dari [Aisyah] dengan redaksi semisal namun hadis pertama lebih komplit. "
            },
            {
                "number": 3532,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عِيسَى بْنُ يُونُسَ حَدَّثَنَا الْمُغِيرَةُ بْنُ زِيَادٍ حَدَّثَنَا عَبْدُ اللَّهِ أَبُو عُمَرَ مَوْلَى أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ قَالَرَأَيْتُ ابْنَ عُمَرَ فِي السُّوقِ اشْتَرَى ثَوْبًا شَأْمِيًّا فَرَأَى فِيهِ خَيْطًا أَحْمَرَ فَرَدَّهُ فَأَتَيْتُ أَسْمَاءَ فَذَكَرْتُ ذَلِكَ لَهَا فَقَالَتْ يَا جَارِيَةُ نَاوِلِينِي جُبَّةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْرَجَتْ جُبَّةَ طَيَالِسَةٍ مَكْفُوفَةَ الْجَيْبِ وَالْكُمَّيْنِ وَالْفَرْجَيْنِ بِالدِّيبَاجِ",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Isa bin Yunus] berkata, telah menceritakan kepada kami [Al Mughirah bin Ziyad] berkata, telah menceritakan kepada kami [Abdullah Abu Umar] mantan budak (yang telah dimerdekakan oleh) [Asma binti Abu Bakr], ia berkata, \"Ibnu Umar membeli kain Syam yang padanya terdapat warna merah, lalu ia mengembalikannya. Maka aku mendatangi Asma dan aku ceritakan hal itu kepadanya. Asma lalu berkata, \"Wahai jariah, bawalah kemari jubah (semacam selendang) Rasulullah shallallahu 'alaihi wasallam.\" Pembantu perempuan itu lalu mengeluarkan jubah tebal yang masing masing dari tepi kantong, dan kedua lengan baju, serta kedua tepi belahan bajunya dari jenis sutera. "
            },
            {
                "number": 3533,
                "arab": "حَدَّثَنَا ابْنُ نُفَيْلٍ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا خُصَيْفٌ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَإِنَّمَا نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الثَّوْبِ الْمُصْمَتِ مِنْ الْحَرِيرِ فَأَمَّا الْعَلَمُ مِنْ الْحَرِيرِ وَسَدَى الثَّوْبِ فَلَا بَأْسَ بِهِ",
                "id": "Telah menceritakan kepada kami [Ibnu Nufail] berkata, telah menceritakan kepada kami [Zuhair] berkata, telah menceritakan kepada kami [Khushaif] dari [Ikrimah] dari [Ibnu Abbas] ia berkata, \"Hanyasanya yang Rasulullah shallallahu 'alaihi wasallam larang adalah kain yang murni dari sutera, adapun jika itu berupa gambar atau benangnya saja, maka tidaklah mengapa.\""
            },
            {
                "number": 3534,
                "arab": "حَدَّثَنَا النُّفَيْلِيُّ حَدَّثَنَا عِيسَى يَعْنِي ابْنَ يُونُسَ عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَرَخَّصَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِعَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ وَلِلزُّبَيْرِ بْنِ الْعَوَّامِ فِي قُمُصِ الْحَرِيرِ فِي السَّفَرِ مِنْ حِكَّةٍ كَانَتْ بِهِمَا",
                "id": "Telah menceritakan kepada kami [An Nufail] berkata, telah menceritakan kepada kami [Isa] -yaitu Ibnu Yunus- dari [Sa'id bin Abu Arubah] dari [Qatadah] dari [Anas] ia berkata, \"Dalam suatu perjalanan Rasulullah shallallahu 'alaihi wasallam memberi keringanan kepada 'Abdurrahman bin Auf dan Zubair Ibnul Awwam untuk mengenakan baju sutera karena sakit gatal yang mereka derita.\""
            },
            {
                "number": 3535,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ أَبِي أَفْلَحَ الْهَمْدَانِيِّ عَنْ عَبْدِ اللَّهِ بْنِ زُرَيْرٍ يَعْنِي الْغَافِقِيَّ أَنَّهُ سَمِعَ عَلِيَّ بْنَ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ يَقُولُإِنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخَذَ حَرِيرًا فَجَعَلَهُ فِي يَمِينِهِ وَأَخَذَ ذَهَبًا فَجَعَلَهُ فِي شِمَالِهِ ثُمَّ قَالَ إِنَّ هَذَيْنِ حَرَامٌ عَلَى ذُكُورِ أُمَّتِي",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] berkata, telah menceritakan kepada kami [Al Laits] dari [Yazid bin Abu Habib] dari [Abu Aflah Al Hamdani] dari [Abdullah bin Zurair] -yaitu Al Aghafiqi- Bahwasanya ia mendengar [Ali bin Abu Thalib radliallahu 'anhu] berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah mangambil sutera lalu meletakkannya pada sisi kanannya, dan mengambil emas lalu meletakkannya pada sisi kirinya. Kemudian beliau bersabda: \"Sesugguhnya dua barang ini haram bagi umatku yang laki-laki.\""
            },
            {
                "number": 3536,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ وَكَثِيرُ بْنُ عُبَيْدٍ الْحِمْصِيَّانِ قَالَا حَدَّثَنَا بَقِيَّةُ عَنْ الزُّبَيْدِيِّ عَنْ الزُّهْرِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّهُ حَدَّثَهُأَنَّهُ رَأَى عَلَى أُمِّ كُلْثُومٍ بِنْتِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بُرْدًا سِيَرَاءَ قَالَ وَالسِّيَرَاءُ الْمُضَلَّعُ بِالْقَزِّ",
                "id": "Telah menceritakan kepada kami [Amru bin Utsman] dan [Katsir bin Ubaid] -keduanya dari Himsha, mereka berkata; telah menceritakan kepada kami [Baqiyyah] dari [Az Zubaidiy] dari [Az Zuhri] dari [Anas bin Malik] Bahwasanya ia menceritakan kepadanya, bahwa ia pernah melihat Ummu Kultsum binti Rasulullah shallallahu 'alaihi wasallam mengenakan belerudu dari sutera. Anas berkata, \"Siyara adalah sulaman sutera yang melintang.\""
            },
            {
                "number": 3537,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ حَدَّثَنَا أَبُو أَحْمَدَ يَعْنِي الزُّبَيْرِيَّ حَدَّثَنَا مِسْعَرٌ عَنْ عَبْدِ الْمَلِكِ بْنِ مَيْسَرَةَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ جَابِرٍ قَالَكُنَّا نَنْزِعُهُ عَنْ الْغِلْمَانِ وَنَتْرُكُهُ عَلَى الْجَوَارِيقَالَ مِسْعَرٌ فَسَأَلْتُ عَمْرَو بْنَ دِينَارٍ عَنْهُ فَلَمْ يَعْرِفْهُ",
                "id": "Telah menceritakan kepada kami [Nashr bin Ali] berkata, telah menceritakan kepada kami [Abu Ahmad] -yaitu Az Zubairi- berkata, telah menceritakan kepada kami [Mis'ar] dari [Abdul Malik bin Maisarah] dari [Amru bin Dinar] dari [Jabir] ia berkata, \"Kami mengambilnya (sutra) dari anak laki-laki, tetapi kami biarkan untuk para gadis.\" Mis'ar berkata, \"Aku lalu menanyakannya kepada Amru bin Dinar tentang hal itu, namun ia tidak mengetahuinya.\""
            },
            {
                "number": 3538,
                "arab": "حَدَّثَنَا هُدْبَةُ بْنُ خَالِدٍ الْأَزْدِيُّ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ قَالَ قُلْنَا لِأَنَسٍ يَعْنِي ابْنَ مَالِكٍ أَيُّ اللِّبَاسِ كَانَ أَحَبَّ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْ أَعْجَبَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْحِبَرَةُ",
                "id": "Telah menceritakan kepada kami [Hudbah bin Khalid Al Azdi] berkata, telah menceritakan kepada kami [Hammam] dari [Qatadah] ia berkata, \"Kami berkata kepada [Anas] -maksudnya Anas Ibnu Malik-, \"Baju apa yang paling disukai atau dikagumi oleh Rasulullah shallallahu 'alaihi wasallam?\" ia menjawab, \"Kain hibarah (yaitu kain halus yang berasal dari yaman menurut orang-orang yaman ini adalah kain terbaik).\""
            },
            {
                "number": 3539,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُثْمَانَ بْنِ خُثَيْمٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْبَسُوا مِنْ ثِيَابِكُمْ الْبَيَاضَ فَإِنَّهَا مِنْ خَيْرِ ثِيَابِكُمْ وَكَفِّنُوا فِيهَا مَوْتَاكُمْ وَإِنَّ خَيْرَ أَكْحَالِكُمُ الْإِثْمِدُ يَجْلُو الْبَصَرَ وَيُنْبِتُ الشَّعْرَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus] berkata, telah menceritakan kepada kami [Zuhair] berkata, telah menceritakan kepada kami [Abdullah bin Utsman bin Khustaim] dari [Sa'id bin Jubair] dari [Ibnu Abbas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pakailah warna putih untuk pakaian kalian, sebab ia sebaik-baik pakaian untuk kalian. Dan kafanilah orang-orang yang meninggal dari kalian dengannya. Dan sebaik-baik celak kalian adalah Al Itsmid, ia dapat mempertajam pandangan dan menumbuhkan rambut.\""
            },
            {
                "number": 3540,
                "arab": "حَدَّثَنَا النُّفَيْلِيُّ حَدَّثَنَا مِسْكِينٌ عَنْ الْأَوْزَاعِيِّ ح و حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ عَنْ وَكِيعٍ عَنْ الْأَوْزَاعِيِّ نَحْوَهُ عَنْ حَسَّانَ بْنِ عَطِيَّةَ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَأَتَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَأَى رَجُلًا شَعِثًا قَدْ تَفَرَّقَ شَعْرُهُ فَقَالَ أَمَا كَانَ يَجِدُ هَذَا مَا يُسَكِّنُ بِهِ شَعْرَهُ وَرَأَى رَجُلًا آخَرَ وَعَلْيِهِ ثِيَابٌ وَسِخَةٌ فَقَالَ أَمَا كَانَ هَذَا يَجِدُ مَاءً يَغْسِلُ بِهِ ثَوْبَهُ",
                "id": "Telah menceritakan kepada kami [An Nufaili] berkata, telah menceritakan kepada kami [Miskin] dari [Al Auza'i]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Utsman bin Abu Syaibah] dari [Waki'] dari [Al Auza'i] seperti itu, dari [Hassan bin Athiah] dari [Muhammad Ibnul Munkadir] dari [Jabir bin Abdullah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam mendatangi kami, lalu beliau melihat seorang laki-laki yang rambutnya acak-acakkan. Maka beliau bersabda: \"Tidakkah orang ini mendapatkan sesuatu yang dapat digunakan untuk merapikan rambutnya?\" kemudian beliau juga mendapati seorang laki-laki yang bajunya kotor, beliau bersabda: \"Tidakkah orang ini mendapatkan air hingga ia dapat mencuci bajunya?\""
            },
            {
                "number": 3541,
                "arab": "حَدَّثَنَا النُّفَيْلِيُّ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا أَبُو إِسْحَقَ عَنْ أَبِي الْأَحْوَصِ عَنْ أَبِيهِ قَالَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ثَوْبٍ دُونٍ فَقَالَ أَلَكَ مَالٌ قَالَ نَعَمْ قَالَ مِنْ أَيِّ الْمَالِ قَالَ قَدْ آتَانِي اللَّهُ مِنْ الْإِبِلِ وَالْغَنَمِ وَالْخَيْلِ وَالرَّقِيقِ قَالَ فَإِذَا آتَاكَ اللَّهُ مَالًا فَلْيُرَ أَثَرُ نِعْمَةِ اللَّهِ عَلَيْكَ وَكَرَامَتِهِ",
                "id": "Telah menceritakan kepada kami [An Nufaili] berkata, telah menceritakan kepada kami [Zuhair] berkata, telah menceritakan kepada kami [Abu Ishaq] dari [Abu Al Ahwash] dari [Bapaknya] ia berkata, \"Aku mendatangi Nabi shallallahu 'alaihi wasallam dengan baju yang lusuh. Maka beliau bertanya: \"Apakah engkau mempunyai harta?\" Ia menjawab, \"Ya.\" beliau bertanya lagi: \"Harta apa saja?\" ia menjawab, \"Allah telah memberiku unta, kambing, kuda dan budak.\" Beliau bersabda: \"Jika Allah memberimu harta maka tampakkanlah wujud dari nikimat-Nya dan pemberian-Nya itu pada dirimu.\""
            },
            {
                "number": 3542,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُحَمَّدٍ عَنْ زَيْدٍ يَعْنِي ابْنَ أَسْلَمَأَنَّ ابْنَ عُمَرَ كَانَ يَصْبُغُ لِحْيَتَهُ بِالصُّفْرَةِ حَتَّى تَمْتَلِئَ ثِيَابُهُ مِنْ الصُّفْرَةِ فَقِيلَ لَهُ لِمَ تَصْبُغُ بِالصُّفْرَةِ فَقَالَ إِنِّي رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْبُغُ بِهَا وَلَمْ يَكُنْ شَيْءٌ أَحَبُّ إِلَيْهِ مِنْهَا وَقَدْ كَانَ يَصْبُغُ ثِيَابَهُ كُلَّهَا حَتَّى عِمَامَتَهُ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah Al Qa'nabi] berkata, telah menceritakan kepada kami [Abdul Aziz] -maksudnya Abdul Aziz Ibnu Muhammad- dari [Zaid] -maksudnya Zaid bin Aslam- ia berkata, \" [Ibnu Umar] pernah mewarnai janggutnya dengan warna kuning (waras dan za'faran) hingga bajunya penuh dengan warna kuning. Lalu dikatakan kepadanya, \"Kenapa engkau celup dengan warna kuning?\" Ia menjawab, \"Karena aku melihat Rasulullah shallallahu 'alaihi wasallam mencelup dengan warna itu, dan tidak ada sesuatu yang beliau sukai kecuali warna itu. Bahkan beliau memberi warna pakian dan surbannya dengan warna itu.\""
            },
            {
                "number": 3543,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا عُبَيْدُ اللَّهِ يَعْنِي ابْنَ إِيَادٍ حَدَّثَنَا إِيَادٌ عَنْ أَبِي رِمْثَةَ قَالَانْطَلَقْتُ مَعَ أَبِي نَحْوَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَأَيْتُ عَلَيْهِ بُرْدَيْنِ أَخْضَرَيْنِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus] berkata, telah menceritakan kepada kami [Ubaidullah] -maksudnya Ubaidullah bin Iyad- berkata, telah menceritakan kepada kami [Iyad] dari [Abu Rimtsah] ia berkata, \"Aku bersama bapakku pergi menemui Nabi shallallahu 'alaihi wasallam, lalu aku melihat beliau mengenakan dua kain beludru berwarna hijau.\""
            },
            {
                "number": 3544,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عِيسَى بْنُ يُونُسَ حَدَّثَنَا هِشَامُ بْنُ الْغَازِ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَهَبَطْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ ثَنِيَّةٍ فَالْتَفَتَ إِلَيَّ وَعَلَيَّ رَيْطَةٌ مُضَرَّجَةٌ بِالْعُصْفُرِ فَقَالَ مَا هَذِهِ الرَّيْطَةُ عَلَيْكَ فَعَرَفْتُ مَا كَرِهَ فَأَتَيْتُ أَهْلِي وَهُمْ يَسْجُرُونَ تَنُّورًا لَهُمْ فَقَذَفْتُهَا فِيهِ ثُمَّ أَتَيْتُهُ مِنْ الْغَدِ فَقَالَ يَا عَبْدَ اللَّهِ مَا فَعَلَتْ الرَّيْطَةُ فَأَخْبَرْتُهُ فَقَالَ أَلَا كَسَوْتَهَا بَعْضَ أَهْلِكَ فَإِنَّهُ لَا بَأْسَ بِهِ لِلنِّسَاءِ",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Isa bin Yunus] berkata, telah menceritakan kepada kami [Hisyam Ibnul Ghaz] dari [Amru bin Syu'aib] dari [bapaknya] dari [Kakeknya] ia berkata, \"Kami bersama Rasulullah shallallahu 'alaihi wasallam turun dari lembah Tsaniah, lalu beliau melihatku mengenakan kain tipis yang dicelup dengan warna kuning. Maka beliau bersabda: \"Kenapa kain tipis ini ada padamu!\" aku paham bahwa beliau tidak menyukainya, maka aku kembali menemui keluargaku yang sedang menyalakan tungku, sehingga kain itu aku masukkan ke dalamnya. Kesokan harinya aku datang menemui Nabi, beliau bertanya: \"Wahai Abdullah, apa yang engkau lakukan dengan kain tipis milikmu itu?\" aku lalu mengabarkan hal yang telah aku lakukan kepada beliau. Beliau pun bersabda: \"Kenapa tidak engkau berikan ke salah satu isterimu, karena itu tidak apa-apa untuk mereka.\""
            },
            {
                "number": 3545,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ الْحِمْصِيُّ حَدَّثَنَا الْوَلِيدُ قَالَ قَالَ هِشَامٌ يَعْنِي ابْنَ الْغَازِالْمُضَرَّجَةُ الَّتِي لَيْسَتْ بِمُشَبَّعَةٍ وَلَا الْمُوَرَّدَةُ",
                "id": "Telah menceritakan kepada kami [Amru bin Utsman Al Himshi] berkata, telah menceritakan kepada kami [Al Walid] ia berkata, \" [Hisyam] -maksudnya hisyam bin Al Ghaz- berkata, \"yang dimaksud dengan al mudharrajah (kain yang dicelup dengan warna merah) adalah; yang tidak sempurna warna merahnya (penuh kemerahannya) serta tidak warna mawar.\""
            },
            {
                "number": 3546,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُثْمَانَ الدِّمَشْقِيُّ حَدَّثَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ عَنْ شُرَحْبِيلَ بْنِ مُسْلِمٍ عَنْ شُفْعَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ قَالَرَآنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَبُو عَلِيٍّ اللُّؤْلُؤِيُّ أُرَاهُ وَعَلَيَّ ثَوْبٌ مَصْبُوغٌ بِعُصْفُرٍ مُوَرَّدٌ فَقَالَ مَا هَذَا فَانْطَلَقْتُ فَأَحْرَقْتُهُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا صَنَعْتَ بِثَوْبِكَ فَقُلْتُ أَحْرَقْتُهُ قَالَ أَفَلَا كَسَوْتَهُ بَعْضَ أَهْلِكَقَالَ أَبُو دَاوُد رَوَاهُ ثَوْرٌ عَنْ خَالِدٍ فَقَالَ مُوَرَّدٌ وَطَاوُسٌ قَالَ مُعَصْفَرٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Utsman Ad Dimasyqi] berkata, telah menceritakan kepada kami [Isma'il bin Ayyas] dari [Syurahbil bin Muslim] dari [Syuf'ah] dari [Abdullah bin Amru bin Al Ash] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melihatku, -Abu Ali Al Lu`lu`I menyebutkan-, \"menurutku beliau melihat aku mengenakan kain yang dicelup dengan warna kuning. Maka beliau bersabda: \"Apa-apaan ini!\" Aku lalu pergi dan membakar kain tersebut. Nabi shallallahu 'alaihi wasallam lalu bertanya lagi: \"Apa yang engkau lakukan dengan kain milikmu?\" Aku menjawab, \"Kain itu aku bakar.\" Beliau bersabda: \"Kenapa tidak engkau berikan untuk sebagian isterimu?\" Abu Dawud berkata, \" [Tsaur] meriwayatkannya dari [Khalid], ia mengatakan, \"warna mawar\" sedangkan [Thawus] mengatakan; \"warna kuning.\""
            },
            {
                "number": 3547,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ حُزَابَةَ حَدَّثَنَا إِسْحَقُ يَعْنِي ابْنَ مَنْصُورٍ حَدَّثَنَا إِسْرَائِيلُ عَنْ أَبِي يَحْيَى عَنْ مُجَاهِدٍ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَمَرَّ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلٌ عَلَيْهِ ثَوْبَانِ أَحْمَرَانِ فَسَلَّمَ عَلَيْهِ فَلَمْ يَرُدَّ عَلَيْهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Huzabah] berkata, telah menceritakan kepada kami [Ishaq] -maksudnya Ishaq bin manshur- berkata, telah menceritakan kepada kami [Isra'il] dari [Abu Yahya] dari [Mujahid] dari [Abdullah bin Amru] ia berkata, \"Seorang laki-laki yang mengenakan dua kain berwarna merah lewat di depan Nabi shallallahu 'alaihi wasallam seraya mengucapkan salam, namun Nabi shallallahu 'alaihi wasallam tidak menjawab salamnya.\""
            },
            {
                "number": 3548,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ أَخْبَرَنَا أَبُو أُسَامَةَ عَنْ الْوَلِيدِ يَعْنِي ابْنَ كَثِيرٍ عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ عَنْ رَجُلٍ مِنْ بَنِي حَارِثَةَ عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَرَأَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى رَوَاحِلِنَا وَعَلَى إِبِلِنَا أَكْسِيَةً فِيهَا خُيُوطُ عِهْنٍ حُمْرٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا أَرَى هَذِهِ الْحُمْرَةَ قَدْ عَلَتْكُمْ فَقُمْنَا سِرَاعًا لِقَوْلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى نَفَرَ بَعْضُ إِبِلِنَا فَأَخَذْنَا الْأَكْسِيَةَ فَنَزَعْنَاهَا عَنْهَا",
                "id": "Telah menceritakan kepada kami [Muhammad Ibnul 'Ala`] berkata, telah mengabarkan kepada kami [Abu Usamah] dari [Al Walid] -maksudnya Al Walid bin Katsir- dari [Muhammad bin Amru bin Atha] dari [Seorang laki-laki dari bani Haritsah] dari [Rafi' bin Khadij] ia berkata, \"Kami keluar bersama Rasulullah shallallahu 'alaihi wasallam dalam suatu perjalanan, lalu Rasulullah shallallahu 'alaihi wasallam melihat unta-unta kami terdapat kain dari bulu yang berwarna merah. Maka Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"kenapa aku melihat warna merah rata pada kalian??.\" Lalu kami segera bangkit karena ucapan Rasulullah shallallahu 'alaihi wasallam tersebut hingga menyebabkan sebagian unta-unta kami lari. Kemudian kami mengambil dan melepas kain merah dari unta-unta tersebut.\""
            },
            {
                "number": 3549,
                "arab": "حَدَّثَنَا ابْنُ عَوْفٍ الطَّائِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ حَدَّثَنِي أَبِي قَالَ ابْنُ عَوْفٍ الطَّائِيُّ وَقَرَأْتُ فِي أَصْلِ إِسْمَعِيلَ قَالَ حَدَّثَنِي ضَمْضَمٌ يَعْنِي ابْنَ زُرْعَةَ عَنْ شُرَيْحِ بْنِ عُبَيْدٍ عَنْ حَبِيبِ بْنِ عُبَيْدٍ عَنْ حُرَيْثِ بْنِ الْأَبَحِّ السَّلِيحِيِّ أَنَّ امْرَأَةً مِنْ بَنِي أَسَدٍ قَالَتْكُنْتُ يَوْمًا عِنْدَ زَيْنَبَ امْرَأَةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ نَصْبُغُ ثِيَابًا لَهَا بِمَغْرَةٍ فَبَيْنَا نَحْنُ كَذَلِكَ إِذْ طَلَعَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا رَأَى الْمَغْرَةَ رَجَعَ فَلَمَّا رَأَتْ ذَلِكَ زَيْنَبُ عَلِمَتْ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ كَرِهَ مَا فَعَلَتْ فَأَخَذَتْ فَغَسَلَتْ ثِيَابَهَا وَوَارَتْ كُلَّ حُمْرَةٍ ثُمَّ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجَعَ فَاطَّلَعَ فَلَمَّا لَمْ يَرَ شَيْئًا دَخَلَ",
                "id": "Telah menceritakan kepada kami [Ibnu Auf Ath Tha`i] berkata, telah menceritakan kepada kami [Muhammad bin Isma'il] berkata, telah menceritakan kepadaku [Bapakku]. [Ibnu Auf Ath Tha`I] berkata, \"Aku membaca dalam buku [Isma'il] berkata; telah menceritakan kepadaku [Dhamdham] -maksudnya Dhamdham bin Zur'ah- dari [Syuraih bin Ubaid] dari [Habib bin Ubaid] dari [Huraits bin Al Abah As Salihi] berkata, \" [Seorang wanita] bani Asad berkata, \"Suatu hari aku berada di sisi Zainab isteri Rasulullah shallallahu 'alaihi wasallam sedang kami mewarnai baju miliknya dengan lumpur merah. Maka ketika kami sedang melakukan hal itu, Rasulullah shallallahu 'alaihi wasallam muncul di hadapan kami. Dan ketika Zainab melihat hal itu, ia mengetahui bahwa Rasulullah shallallahu 'alaihi wasallam tidak menyukai perbuatannya. Maka ia pun mengambil kain bajunya untuk dicuci dan menghilangkan semua warna merah yang ada. Setelah itu Rasulullah shallallahu 'alaihi wasallam datang kembali, ketika beliau tidak melihat (warna merah itu lagi), beliau masuk ke dalam rumah.\""
            },
            {
                "number": 3550,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ النَّمَرِيُّ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ عَنْ الْبَرَاءِ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَهُ شَعْرٌ يَبْلُغُ شَحْمَةَ أُذُنَيْهِ وَرَأَيْتُهُ فِي حُلَّةٍ حَمْرَاءَ لَمْ أَرَ شَيْئًا قَطُّ أَحْسَنَ مِنْهُ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar An Namri] berkata, telah menceritakan kepada kami [Syu'bah] dari [Abu Ishaq] dari [Al Bara] ia berkata, \"Rambut Rasulullah shallallahu 'alaihi wasallam panjangnya hingga daun telinga, aku pernah melihat beliau mengenakan pakian berwarna merah, dan aku tidak pernah melihat seseorang yang lebih bagus dari beliau.\""
            },
            {
                "number": 3551,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ هِلَالِ بْنِ عَامِرٍ عَنْ أَبِيهِ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِنًى يَخْطُبُ عَلَى بَغْلَةٍ وَعَلَيْهِ بُرْدٌ أَحْمَرُ وَعَلِيٌّ رَضِيَ اللَّهُ عَنْهُ أَمَامَهُ يُعَبِّرُ عَنْهُ",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Abu Mu'awiyah] dari [Hilal bin Amir] dari [Bapaknya] ia berkata, \"Aku pernah melihat Rasulullah shallallahu 'alaihi wasallam berkhutbah di Mina di atas bighal, beliau mengenakan selendang beludru berwarna merah, sementara Ali radliallahu 'anhu berada di depannya sebagai penerjemah.\""
            },
            {
                "number": 3552,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ مُطَرِّفٍ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْصَنَعْتُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بُرْدَةً سَوْدَاءَ فَلَبِسَهَا فَلَمَّا عَرَقَ فِيهَا وَجَدَ رِيحَ الصُّوفِ فَقَذَفَهَا قَالَ وَأَحْسِبُهُ قَالَ وَكَانَ تُعْجِبُهُ الرِّيحُ الطَّيِّبَةُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] berkata, telah mengabarkan kepada kami [Hammam] dari [Qatadah] dari [Mutahrrif] dari ['Aisyah radliallahu 'anha] ia berkata, \"Aku membuatkan Rasulullah shallallahu 'alaihi wasallam selendang berwarna hitam, lalu beliau memakainya. Saat berkeringat, beliau mendapati bau wool (bulu kambing) hingga beliau pun membuangnya.\" perawi berkata, \"Aku mengira bahwa ia (Mutharrif) mengatakan, \"Rasulullah menyukai bau wangi.\""
            },
            {
                "number": 3553,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُحَمَّدٍ الْقُرَشِيُّ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ أَخْبَرَنَا يُونُسُ بْنُ عُبَيْدٍ عَنْ عُبَيْدَةَ أَبِي خِدَاشٍ عَنْ أَبِي تَمِيمَةَ الْهُجَيْمِيِّ عَنْ جَابِرٍ يَعْنِي ابْنَ سُلَيْمٍ قَالَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مُحْتَبٍ بِشَمْلَةٍ وَقَدْ وَقَعَ هُدْبُهَا عَلَى قَدَمَيْهِ",
                "id": "Telah menceritakan kepada kami [Ubaidullah bin Muhammad Al Qurasyi] berkata, telah menceritakan kepada kami [Hammad bin Salamah] berkata, telah mengabarkan kepada kami [Yunus bin Ubaid] dari [Ubaidah Abu Khidasy] dari [Abu Tamimah Al Hujaimi] dari [Jabir bin Sulaim] ia berkata, \"Aku mendatangi Nabi shallallahu 'alaihi wasallam, beliau waktu itu sedang duduk ihtiba (duduk di atas bokong dan mendekap kedua lututnya menempel dada) dengan selimut, sementara ujung selimutnya mengenai kedua telapak kakinya.\""
            },
            {
                "number": 3554,
                "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ وَمُسْلِمُ بْنُ إِبْرَاهِيمَ وَمُوسَى بْنُ إِسْمَعِيلَ قَالُوا حَدَّثَنَا حَمَّادٌ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَامَ الْفَتْحِ مَكَّةَ وَعَلَيْهِ عِمَامَةٌ سَوْدَاءُ",
                "id": "Telah menceritakan kepada kami [Abu Al Walid Ath Thayalisi] dan [Muslim bin Ibarahim] dan [Musa bin Isma'il] mereka berkata; telah menceritakan kepada kami [Hammad] dari [Abu Az Zubair] dari [Jabir] berkata, \"Rasulullah shallallahu 'alaihi wasallam masuk saat pembukaan (penaklukan) kota Makkah dengan mengenakan imamah (surban yang lilitkan kepala) berwarna hitam.\""
            },
            {
                "number": 3555,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ مُسَاوِرٍ الْوَرَّاقِ عَنْ جَعْفَرِ بْنِ عَمْرِو بْنِ حُرَيْثٍ عَنْ أَبِيهِ قَالَرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ وَعَلَيْهِ عِمَامَةٌ سَوْدَاءُ قَدْ أَرْخَى طَرَفَهَا بَيْنَ كَتِفَيْهِ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali] berkata, telah menceritakan kepada kami [Abu Usamah] dari [Musawir Al Warraq] dari [Ja'far bin Amru bin Huraits] dari [Bapaknya] ia berkata, \"Aku melihat Nabi shallallahu 'alaihi wasallam di atas mimbar mengenakan surban berwarna hitam, sementara ujungnya menjuntai pada dua pundaknya.\""
            },
            {
                "number": 3556,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ الثَّقَفِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ رَبِيعَةَ حَدَّثَنَا أَبُو الْحَسَنِ الْعَسْقَلَانِيُّ عَنْ أَبِي جَعْفَرِ بْنِ مُحَمَّدِ بْنِ عَلِيِّ بْنِ رُكَانَةَ عَنْ أَبِيهِأَنَّ رُكَانَةَ صَارَعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَرَعَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رُكَانَةُ وَسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فَرْقُ مَا بَيْنَنَا وَبَيْنَ الْمُشْرِكِينَ الْعَمَائِمُ عَلَى الْقَلَانِسِ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id Ats Tsaqafi] berkata, telah menceritakan kepada kami [Muhammad bin Rabi'ah] berkata, telah menceritakan kepada kami [Abu Al Hasan Al Asqalani] dari [Abu Ja'far bin Muhammad bin Ali bin Rukanah] dari [Bapaknya] berkata, \"Rukanah pernah menggulat (membanting) Nabi shallallahu 'alaihi wasallam, lalu Nabi shallallahu 'alaihi wasallam ganti membanting rukanah. [Rukanah] berkata, \"Aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Perbedaan antara kita dengan orang-orang musyrik adalah diletakkannya imamah (semacam surban yang dililitkan di kepala) di atas peci.\""
            },
            {
                "number": 3557,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ مَوْلَى بَنِي هَاشِمٍ حَدَّثَنَا عُثْمَانُ بْنُ عُثْمَانَ الْغَطَفَانِيُّ حَدَّثَنَا سُلَيْمَانُ بْنُ خَرَّبُوذَ حَدَّثَنِي شَيْخٌ مِنْ أَهْلِ الْمَدِينَةِ قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ يَقُولُعَمَّمَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَدَلَهَا بَيْنَ يَدَيَّ وَمِنْ خَلْفِي",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isma'il] -mantan budak bani Hasyim- berkata, telah menceritakan kepada kami [Utsman Al Ghathafani] berkata, telah menceritakan kepada kami [Sulaiman bin Kharrabudz] berkata, telah menceritakan kepadaku [Syaikh] -dari Madinah- ia berkata, \"Aku mendengar ['Abdurrahman bin Auf] berkata, \"Rasulullah shallallahu 'alaihi wasallam memasangkan imamah untukku, lalu beliau menjuntaikan ujung-ujungnya ke bagian depan dan belakangku.\""
            },
            {
                "number": 3558,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ لِبْسَتَيْنِ أَنْ يَحْتَبِيَ الرَّجُلُ مُفْضِيًا بِفَرْجِهِ إِلَى السَّمَاءِ وَيَلْبَسُ ثَوْبَهُ وَأَحَدُ جَانِبَيْهِ خَارِجٌ وَيُلْقِي ثَوْبَهُ عَلَى عَاتِقِهِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang dua cara berpakaian; seorang laki-laki berihtiba (duduk di atas bokong dan mendekap kedua lutut menempel dada) dengan membiarkan auratnya (kemaluan) menghadap ke langit. Dan memakai pakaian dengan satu sisi dibiarkan terbuka, lalu menyelempangkan bajunya ke pundak.\""
            },
            {
                "number": 3559,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الصَّمَّاءِ وَعَنْ الِاحْتِبَاءِ فِي ثَوْبٍ وَاحِدٍ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Hammad] dari [Abu Az Zubair] dari [Jabir] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang Ash Shama (membungkus seluruh tubuh tanpa ada celah untuk tangan keluar) dan berihtiba (duduk di atas bokong dan mendekap kedua lutut menempel dada) dengan satu kain.\""
            },
            {
                "number": 3560,
                "arab": "حَدَّثَنَا النُّفَيْلِيُّ وَأَحْمَدُ بْنُ يُونُسَ قَالَا حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا عُرْوَةُ بْنُ عَبْدِ اللَّهِ قَالَ ابْنُ نُفَيْلٍ ابْنُ قُشَيْرٍ أَبُو مَهَلٍ الْجُعْفِيُّ حَدَّثَنَا مُعَاوِيَةُ بْنُ قُرَّةَ حَدَّثَنِي أَبِي قَالَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي رَهْطٍ مِنْ مُزَيْنَةَ فَبَايَعْنَاهُ وَإِنَّ قَمِيصَهُ لَمُطْلَقُ الْأَزْرَارِ قَالَ فَبَايَعْتُهُ ثُمَّ أَدْخَلْتُ يَدَيَّ فِي جَيْبِ قَمِيصِهِ فَمَسِسْتُ الْخَاتَمَقَالَ عُرْوَةُ فَمَا رَأَيْتُ مُعَاوِيَةَ وَلَا ابْنَهُ قَطُّ إِلَّا مُطْلِقَيْ أَزْرَارِهِمَا فِي شِتَاءٍ وَلَا حَرٍّ وَلَا يُزَرِّرَانِ أَزْرَارَهُمَا أَبَدًا",
                "id": "Telah menceritakan kepada kami [An Nufail] dan [Ahmad bin Yunus] keduanya berkata; telah menceritakan kepada kami [Zuhair] berkata, telah menceritakan kepada kami [Urwah bin Abdullah]. Ibnu An Nufail bin Qusyair Abu Mahl Al Ju'fi berkata, telah menceritakan kepada kami [Mu'awiyah bin Qurrah] berkata, telah menceritakan kepadaku [Bapakku] ia berkata, \"Aku mendatangi Rasulullah shallallahu 'alaihi wasallam di antara kumpulan orang-orang Muzainah, lalu kami berbaiat kepadanya. Dan baju beliau tidak berkancing. Perawi berkata, \"Aku berbaiat kepada beliau beliau, lalu aku masukkan tanganku ke dalam saku baju beliau hingga aku dapat menyentuh setempel (tanda kenabian).\" Urwah berkata, \"Aku tidak pernah melihat Mu'awiyah dan anaknya kecuali membiarkan kancing bajunya terbuka, mereka tidak pernah menutup kancing bajunya, baik saat musim dingin atau musim panas.\""
            },
            {
                "number": 3561,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ دَاوُدَ بْنِ سُفْيَانَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ قَالَ قَالَ الزُّهْرِيُّ قَالَ عُرْوَةُ قَالَتْ عَائِشَةُ رَضِيَ اللَّهُ عَنْهَابَيْنَا نَحْنُ جُلُوسٌ فِي بَيْتِنَا فِي نَحْرِ الظَّهِيرَةِ قَالَ قَائِلٌ لِأَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُ هَذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُقْبِلًا مُتَقَنِّعًا فِي سَاعَةٍ لَمْ يَكُنْ يَأْتِينَا فِيهَا فَجَاءَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاسْتَأْذَنَ فَأُذِنَ لَهُ فَدَخَلَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Dawud bin Sufyan] berkata, telah menceritakan kepada kami [Abdurrazaq] berkata, telah mengabarkan kepada kami [Ma'mar] ia berkata; [Az Zuhri] berkata; [Urwah] berkata, \" ['Aisyah radliallahu 'anha] berkata, \"Ketika kami sedang duduk di rumah kami di siang hari, seseorang berkata kepada Abu Bakar radliallahu 'anhu, \"Ini adalah Rasulullah shallallahu 'alaihi wasallam, beliau datang dengan menutup kepala dan sebagian wajahnya di waktu yang tidak biasanya beliau datang ke rumah kami. Rasulullah shallallahu 'alaihi wasallam lalu datang seraya meminta izin (kepada Abu Bakar), beliau lalu diizinkan dan masuk.\""
            },
            {
                "number": 3562,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ أَبِي غِفَارٍ حَدَّثَنَا أَبُو تَمِيمَةَ الْهُجَيْمِيُّ وَأَبُو تَمِيمَةَ اسْمُهُ طَرِيفُ بْنُ مُجَالِدٍ عَنْ أَبِي جُرَيٍّ جَابِرِ بْنِ سُلَيْمٍ قَالَرَأَيْتُ رَجُلًا يَصْدُرُ النَّاسُ عَنْ رَأْيِهِ لَا يَقُولُ شَيْئًا إِلَّا صَدَرُوا عَنْهُ قُلْتُ مَنْ هَذَا قَالُوا هَذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُلْتُ عَلَيْكَ السَّلَامُ يَا رَسُولَ اللَّهِ مَرَّتَيْنِ قَالَ لَا تَقُلْ عَلَيْكَ السَّلَامُ فَإِنَّ عَلَيْكَ السَّلَامُ تَحِيَّةُ الْمَيِّتِ قُلْ السَّلَامُ عَلَيْكَ قَالَ قُلْتُ أَنْتَ رَسُولُ اللَّهِ قَالَ أَنَا رَسُولُ اللَّهِ الَّذِي إِذَا أَصَابَكَ ضُرٌّ فَدَعَوْتَهُ كَشَفَهُ عَنْكَ وَإِنْ أَصَابَكَ عَامُ سَنَةٍ فَدَعَوْتَهُ أَنْبَتَهَا لَكَ وَإِذَا كُنْتَ بِأَرْضٍ قَفْرَاءَ أَوْ فَلَاةٍ فَضَلَّتْ رَاحِلَتُكَ فَدَعَوْتَهُ رَدَّهَا عَلَيْكَ قَالَ قُلْتُ اعْهَدْ إِلَيَّ قَالَ لَا تَسُبَّنَّ أَحَدًا قَالَ فَمَا سَبَبْتُ بَعْدَهُ حُرًّا وَلَا عَبْدًا وَلَا بَعِيرًا وَلَا شَاةً قَالَ وَلَا تَحْقِرَنَّ شَيْئًا مِنْ الْمَعْرُوفِ وَأَنْ تُكَلِّمَ أَخَاكَ وَأَنْتَ مُنْبَسِطٌ إِلَيْهِ وَجْهُكَ إِنَّ ذَلِكَ مِنْ الْمَعْرُوفِ وَارْفَعْ إِزَارَكَ إِلَى نِصْفِ السَّاقِ فَإِنْ أَبَيْتَ فَإِلَى الْكَعْبَيْنِ وَإِيَّاكَ وَإِسْبَالَ الْإِزَارِ فَإِنَّهَا مِنْ الْمَخِيلَةِ وَإِنَّ اللَّهَ لَا يُحِبُّ الْمَخِيلَةَ وَإِنْ امْرُؤٌ شَتَمَكَ وَعَيَّرَكَ بِمَا يَعْلَمُ فِيكَ فَلَا تُعَيِّرْهُ بِمَا تَعْلَمُ فِيهِ فَإِنَّمَا وَبَالُ ذَلِكَ عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Yahya] dari [Abu Ghifar] berkata, telah menceritakan kepada kami [Abu Tamimah Al Hujaimi] -dan Abu Tamimah namanya adalah Tharif bin Mujalid- dari [Abu Jurai Jabir bin Sulaim] ia berkata, \"Aku melihat seorang laki-laki yang fikirannya dijadikan sandaran oleh orang banyak, dan ia tidak mengatakan sesuatu kecuali orang-orang akan mengikutinya. Aku lalu bertanya, \"Siapakah dia?\" orang-orang menjawab, \"Ini adalah Rasulullah shallallahu 'alaihi wasallam.\" maka aku pun berkata, 'Wahai Rasulullah, 'Alaika As Salam (semoga keselamatan bersamamu) ' wahai Rasulullah, sebanyak dua kali. Beliau bersabda: \"Jangan engkau ucapkan 'Alaika As Salam', karena 'Alaika As Salam adalah penghormatan dan salam untuk mayit. Tetapi ucapkanlah 'As Salamu 'Alaika'.\" Jabir bin Sulaim berkata, \"Aku lalu bertanya, \"Apakah engkau utusan Allah?\" beliau menjawab: \"Ya, aku adalah utusan Allah, Dzat yang jika engkau tertimpa musibah, lalu engkau berdoa kepada-Nya, maka Dia akan menghilangkannya darimu. Jika kamu tertimpa paceklik, lalu engkau berdoa maka Dia akan menumbuhkan (tanaman) bagi kamu. Jika engkau berada di suatu tempat yang luas hingga kendaraanmu hilang, lalu engkau berdoa kepada-Nya, maka Dia akan mengembalikannya kepadamu.\" Jabir bin Sulaim berkata, \"Lalu aku berkata, \"Berilah kami perjanjian.\" Beliau bersabda: \"Jangan sekali-kali engaku cela orang lain.\" Jabir bin Sulaim berkata, \"Setelah itu aku tidak pernah mencela seorang pun; orang merdeka atau budak, unta atau kambing.\" Beliau bersabda lagi: \"Janganlah engkau remehkan perkara ma'ruf, berbicaralah kepada saudaramu dengan wajah yang penuh senyum dan berseri, sebab itu bagian dari perkara yang ma'ruf. Angkatlah sarungmu hingga setengah betis, jika tidak maka hingga kedua mata kaki. Dan janganlah engkau julurkan sarungmu karena itu bagian dari sifat sombong, sesungguhnya Allah tidak menyukai sifat sombong. Jika ada seseorang yang mencela dan memakimu karena cela yang ia ketahui darimu, maka janganlah engkau balas memaki karena cela yang engkau ketahui padanya, karena hal itu akan memberatkannya (pada hari kiamat).\""
            },
            {
                "number": 3563,
                "arab": "حَدَّثَنَا النُّفَيْلِيُّ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ جَرَّ ثَوْبَهُ خُيَلَاءَ لَمْ يَنْظُرْ اللَّهُ إِلَيْهِ يَوْمَ الْقِيَامَةِ فَقَالَ أَبُو بَكْرٍ إِنَّ أَحَدَ جَانِبَيْ إِزَارِي يَسْتَرْخِي إِنِّي لَأَتَعَاهَدُ ذَلِكَ مِنْهُ قَالَ لَسْتَ مِمَّنْ يَفْعَلُهُ خُيَلَاءَ",
                "id": "Telah menceritakan kepada kami [An Nufail] berkata, telah menceritakan kepada kami [Zuhair] berkata, telah menceritakan kepada kami [Musa bin Uqbah] dari [Salim bin Abdullah] dari [Bapaknya] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa menjulurkan kainnya karena sombong, maka Allah tidak akan melihatnya pada hari kiamat.\" Abu Bakar berkata, \"Sesungguhnya salah satu ujung pakaianku ada yang menjulur, padahal aku telah berjanji untuk tidak melakukannya!\" beliau bersabda: \" kamu bukan termasuk orang yang melakukannya karena sombong.\""
            },
            {
                "number": 3564,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا أَبَانُ حَدَّثَنَا يَحْيَى عَنْ أَبِي جَعْفَرٍ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَ قَالَبَيْنَمَا رَجُلٌ يُصَلِّي مُسْبِلًا إِزَارَهُ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اذْهَبْ فَتَوَضَّأْ فَذَهَبَ فَتَوَضَّأَ ثُمَّ جَاءَ فَقَالَ اذْهَبْ فَتَوَضَّأْ فَقَالَ لَهُ رَجُلٌ يَا رَسُولَ اللَّهِ مَا لَكَ أَمَرْتَهُ أَنْ يَتَوَضَّأَ ثُمَّ سَكَتَّ عَنْهُ قَالَ إِنَّهُ كَانَ يُصَلِّي وَهُوَ مُسْبِلٌ إِزَارَهُ وَإِنَّ اللَّهَ لَا يَقْبَلُ صَلَاةَ رَجُلٍ مُسْبِلٍ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Aban] berkata, telah menceritakan kepada kami [Yahya] dari [Abu Ja'far] dari [Atha bin Yasar] dari [Abu Hurairah] ia berkata, \"Ketika ada seorang laki-laki yang shalat sambil menjulurkan kainnya, Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Pergi dan berwudhulah.\" Laki-laki itu lantas pergi berwudhu kemudian kembali lagi, namun beliau tetap bersabda: \"Pergi dan berwudhulah.\" Lalu ada seorang laki-laki bertanya kepada beliau, \"Wahai Rasulullah, ada apa denganmu, engkau suruh dia berwudhu kemudian engkau diamkan?\" beliau menjawab, \"Laki-laki itu shalat dengan menjulurkan kain sarungnya, padahal Allah tidak menerima shalat seseorang yang menjulurkan kain sarungnya.\""
            },
            {
                "number": 3565,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ عَلِيِّ بْنِ مُدْرِكٍ عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ عَنْ خَرَشَةَ بْنِ الْحُرِّ عَنْ أَبِي ذَرٍّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ ثَلَاثَةٌ لَا يُكَلِّمُهُمْ اللَّهُ وَلَا يَنْظُرُ إِلَيْهِمْ يَوْمَ الْقِيَامَةِ وَلَا يُزَكِّيهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ قُلْتُ مَنْ هُمْ يَا رَسُولَ اللَّهِ قَدْ خَابُوا وَخَسِرُوا فَأَعَادَهَا ثَلَاثًا قُلْتُ مَنْ هُمْ يَا رَسُولَ اللَّهِ خَابُوا وَخَسِرُوا فَقَالَ الْمُسْبِلُ وَالْمَنَّانُ وَالْمُنَفِّقُ سِلْعَتَهُ بِالْحَلِفِ الْكَاذِبِ أَوْ الْفَاجِرِحَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ عَنْ الْأَعْمَشِ عَنْ سُلَيْمَانَ بْنِ مُسْهِرٍ عَنْ خَرَشَةَ بْنِ الْحُرِّ عَنْ أَبِي ذَرٍّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا وَالْأَوَّلُ أَتَمُّ قَالَ الْمَنَّانُ الَّذِي لَا يُعْطِي شَيْئًا إِلَّا مَنَّهُ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar] berkata, telah menceritakan kepada kami [Syu'bah] dari [Ali bin Mudrik] dari [Abu Zur'ah bin Amru bin Jarir] dari [Kharasyah Ibnul Hur] dari [Abu Dzar] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Ada tiga golongan yang tidak dilihat oleh Allah dan tidak dibersihkan dosanya pada hari kiamat serta bagi mereka siksa yang pedih.\" Aku bertanya, \"Siapa mereka itu ya Rasulullah? Sungguh sia-sia dan meruginya mereka!? Beliau mengulangi perkataan itu hingga tiga kali, aku bertanya lagi, \"Siapa mereka itu ya Rasulullah? Sungguh sia-sia dan meruginya mereka!? beliau menjawab: \"Mereka adalah orang yang menjulurkan kainnya, orang yang mengungkit-ungkit pemberiannya dan orang yang melariskan dagangannya dengan sumpah palsu.\" Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Yahya] dari [Sufyan] dari [Al A'masy] dari [Sulaiman bin Mushir] dari [Kharasyah Ibnul Hur] dari [Abu Dzar] dari Nabi shallallahu 'alaihi wasallam, sebagaimana dalam hadits ini. Namun riwayat yang pertama lebih sempurna, Abu Dzar berkata, \"Al Mannan adalah orang yang tidak memberikan sesuatu kecuali mengharap pengembalian.\""
            },
            {
                "number": 3566,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا أَبُو عَامِرٍ يَعْنِي عَبْدَ الْمَلِكِ بْنَ عَمْرٍو حَدَّثَنَا هِشَامُ بْنُ سَعْدٍ عَنْ قَيْسِ بْنِ بِشْرٍ التَّغْلِبِيِّ قَالَ أَخْبَرَنِي أَبِي وَكَانَ جَلِيسًا لِأَبِي الدَّرْدَاءِ قَالَكَانَ بِدِمَشْقَ رَجُلٌ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَالُ لَهُ ابْنُ الْحَنْظَلِيَّةِ وَكَانَ رَجُلًا مُتَوَحِّدًا قَلَّمَا يُجَالِسُ النَّاسَ إِنَّمَا هُوَ صَلَاةٌ فَإِذَا فَرَغَ فَإِنَّمَا هُوَ تَسْبِيحٌ وَتَكْبِيرٌ حَتَّى يَأْتِيَ أَهْلَهُ فَمَرَّ بِنَا وَنَحْنُ عِنْدَ أَبِي الدَّرْدَاءِ فَقَالَ لَهُ أَبُو الدَّرْدَاءِ كَلِمَةً تَنْفَعُنَا وَلَا تَضُرُّكَ قَالَ بَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَرِيَّةً فَقَدِمَتْ فَجَاءَ رَجُلٌ مِنْهُمْ فَجَلَسَ فِي الْمَجْلِسِ الَّذِي يَجْلِسُ فِيهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لِرَجُلٍ إِلَى جَنْبِهِ لَوْ رَأَيْتَنَا حِينَ الْتَقَيْنَا نَحْنُ وَالْعَدُوُّ فَحَمَلَ فُلَانٌ فَطَعَنَ فَقَالَ خُذْهَا مِنِّي وَأَنَا الْغُلَامُ الْغِفَارِيُّ كَيْفَ تَرَى فِي قَوْلِهِ قَالَ مَا أُرَاهُ إِلَّا قَدْ بَطَلَ أَجْرُهُ فَسَمِعَ بِذَلِكَ آخَرُ فَقَالَ مَا أَرَى بِذَلِكَ بَأْسًا فَتَنَازَعَا حَتَّى سَمِعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ سُبْحَانَ اللَّهِ لَا بَأْسَ أَنْ يُؤْجَرَ وَيُحْمَدَ فَرَأَيْتُ أَبَا الدَّرْدَاءِ سُرَّ بِذَلِكَ وَجَعَلَ يَرْفَعُ رَأْسَهُ إِلَيْهِ وَيَقُولُ أَنْتَ سَمِعْتَ ذَلِكَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَقُولُ نَعَمْ فَمَا زَالَ يُعِيدُ عَلَيْهِ حَتَّى إِنِّي لَأَقُولُ لَيَبْرُكَنَّ عَلَى رُكْبَتَيْهِ قَالَ فَمَرَّ بِنَا يَوْمًا آخَرَ فَقَالَ لَهُ أَبُو الدَّرْدَاءِ كَلِمَةً تَنْفَعُنَا وَلَا تَضُرُّكَ قَالَ قَالَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُنْفِقُ عَلَى الْخَيْلِ كَالْبَاسِطِ يَدَهُ بِالصَّدَقَةِ لَا يَقْبِضُهَا ثُمَّ مَرَّ بِنَا يَوْمًا آخَرَ فَقَالَ لَهُ أَبُو الدَّرْدَاءِ كَلِمَةً تَنْفَعُنَا وَلَا تَضُرُّكَ قَالَ قَالَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نِعْمَ الرَّجُلُ خُرَيْمٌ الْأَسَدِيُّ لَوْلَا طُولُ جُمَّتِهِ وَإِسْبَالُ إِزَارِهِ فَبَلَغَ ذَلِكَ خُرَيْمًا فَعَجِلَ فَأَخَذَ شَفْرَةً فَقَطَعَ بِهَا جُمَّتَهُ إِلَى أُذُنَيْهِ وَرَفَعَ إِزَارَهُ إِلَى أَنْصَافِ سَاقَيْهِ ثُمَّ مَرَّ بِنَا يَوْمًا آخَرَ فَقَالَ لَهُ أَبُو الدَّرْدَاءِ كَلِمَةً تَنْفَعُنَا وَلَا تَضُرُّكَ فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّكُمْ قَادِمُونَ عَلَى إِخْوَانِكُمْ فَأَصْلِحُوا رِحَالَكُمْ وَأَصْلِحُوا لِبَاسَكُمْ حَتَّى تَكُونُوا كَأَنَّكُمْ شَامَةٌ فِي النَّاسِ فَإِنَّ اللَّهَ لَا يُحِبُّ الْفُحْشَ وَلَا التَّفَحُّشَقَالَ أَبُو دَاوُد وَكَذَلِكَ قَالَ أَبُو نُعَيْمٍ عَنْ هِشَامٍ قَالَ حَتَّى تَكُونُوا كَالشَّامَةِ فِي النَّاسِ",
                "id": "Telah menceritakan kepada kami [Harun bin Abdullah] berkata, telah menceritakan kepada kami [Abu Amir] -maksudnya Abdul Malik bin Amru- berkata, telah menceritakan kepada kami [Hisyam bin Sa'd] dari [Qais bin Bisyr At Taghlibi] ia berkata; telah mengabarkan kepadaku [Bapakku] -ia adalah teman dekatnya Abu Darda`- ia berkata, \"Di Damasykus ada seorang laki-laki dari sahabat Nabi shallallahu 'alaihi wasallam yang bernama [Ibnu Al Hanzhaliyah]. Ia seorang laki-laki yang suka menyendiri, jarang sekali ia bersama orang-orang, ia selalu sibuk dengan shalat. Jika shalat telah selesai ia sibuk dengan tasbih dan takbir hingga ia kembali ke rumah. Suatu kali ia lewat saat kami sedang berada di sisi Abu Darda, Abu Darda lantas berkata kepadanya dengan suatu ucapan yang bermanfaat bagi kami dan tidak bermadharat bagi kamu. Ia berkata, \"Rasulullah shallallahu 'alaihi wasallam mengutus ekspedisi, sekembalinya ekspedisi itu, seorang laki-laki dari mereka duduk di tempat duduk yang biasa Rasulullah shallallahu 'alaihi wasallam pakai untuk duduk. Lalu ia berkata kepada laki-laki yang ada di sisinya, \"Sekiranya engkau melihat kami saat berhadapan dengan musuh. lantas ia -maksudnya dirinya- mengambil tombaknya dan menghunjamkannya ke salah seorang musuh dan berujar -dengan maksud mengejek- 'Silahkan kau cabut tombakku, aku anak bani ghifar yang masih belia'. Maka bagaimana komentarmu tentang ucapannya? -Maksudnya; ucapan ejekan 'Silahkan kau cabut tombakku, aku anak bani ghifar yang masih belia! - Kawan yang di sampingnya menjawab, 'Aku tak punya pendapat kecuali bahwa pahalanya telah musnah! '. Komentarnya tadi sempat didengar yang lain sehingga ia mengajukan protes 'Menurutku ucapan seperti itu tidak masalah!. Kedua orang ini larut dalam pertikaian hingga Rasulullah mendengar keributannya. Rasul berujar 'Subhanallah, ucapan seperti itu tidak masalah, dan ia tetap akan mendapat ganjaran dan pujian! '. Lantas kulihat Abu darda' terlihat riang hingga ia mengangkat kepalanya kepada orang itu dan berkomentar, 'Benarkah, kau mendengar hal itu dari Rasulullah! '. Ia menjawab, 'Iya'. Abu Darda berulang-ulang mengajukan pertanyaannya hingga aku berkata dalam hati, andaikan ia lipat kedua lututnya' (maksudnya disudahi). Qais berkata, \"Suatu hari ada seseorang melewati kami, lantas Abu Darda berkata kepadanya dengan suatu ucapan yang bermanfaat bagi kami dan tidak bermadharat bagi kamu. Abu Darda berkata, \"Rasulullah pernah berujar kepada kami: “Orang yang memberi nafkah kepada kuda di jalan Allah seperti seseorang yang membentangkan tangannya untuk sedekah dan tidak pernah menahannya.\" Dihari yang lain, seseorang melewati kami, lantas Abu Darda berkata kepadanya dengan suatu ucapan yang bermanfaat bagi kami dan tidak bermadharat bagi kamu. Abu Darda berkata, Rasulullah Shallallahu 'alaihi wasallam bersabda: 'Sebaik-baik orang adalah Khuraim Al-asadi, sekiranya ia tidak memanjangkan rambutnya sampai bahu dan memanjangkan kain hingga melewati mata kaki'. Ucapan Nabi ini menjadikan Khuraim bergegas mengambil pisau. Ia potong rambutnya hingga sebatas kedua telinganya dan ia naikkan kainnya hingga pertengahan betisnya. Di hari lain ada seorang lewat, lantas Abu darda' berkata kepadanya dengan suatu ucapan yang bermanfaat bagi kami dan tidak bermadharat bagi kamu. Abu Darda berkata, \"Aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya kalian akan menemui sahabat-sahabat kalian, maka rapikanlah pelana kendaraan kalian, rapikan pakaian kalian, hingga seolah-olah kalian manusia-manusia istimewa di tengah-tengah manusia, sebab Allah tidak suka keburukan dan tindakan-tindakan yang mencerminkan keburukan.” Abu Daud berkata; begitu juga Abu Nuaim berkata dari Hisyam dengan redaksi; 'Hingga kalian seolah-olah sosok-sosok istimewa di tengah-tengah manusia'."
            },
            {
                "number": 3567,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ ح و حَدَّثَنَا هَنَّادٌ يَعْنِي ابْنَ السَّرِيِّ عَنْ أَبِي الْأَحْوَصِ الْمَعْنَى عَنْ عَطَاءِ بْنِ السَّائِبِ قَالَ مُوسَى عَنْ سَلْمَانَ الْأَغَرِّ وَقَالَ هَنَّادٌ عَنْ الْأَغَرِّ أَبِي مُسْلِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَ هَنَّادٌ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اللَّهُ عَزَّ وَجَلَّ الْكِبْرِيَاءُ رِدَائِي وَالْعَظَمَةُ إِزَارِي فَمَنْ نَازَعَنِي وَاحِدًا مِنْهُمَا قَذَفْتُهُ فِي النَّارِ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Hammad]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Hannad] -maksudnya Hannad bin As Sari- dari [Abu Al Ahwash] secara makna, dari [Atha bin As Saib] berkata; [Musa] berkata; dari [Salman Al Aghar]. [Hannad] berkata dari [Al Aghar Abu Muslim] dari [Abu Hurairah]. [Hannad] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah Azza Wa Jalla berfirman: 'Kesombongan adalah selendang-Ku, kebesaran adalah sarung-Ku, barangsiapa mengambil salah satu dari keduanya dari-Ku, maka ia akan Aku lemparkan ke dalam neraka.\""
            },
            {
                "number": 3568,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا أَبُو بَكْرٍ يَعْنِي ابْنَ عَيَّاشٍ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَدْخُلُ الْجَنَّةَ مَنْ كَانَ فِي قَلْبِهِ مِثْقَالُ حَبَّةٍ مِنْ خَرْدَلٍ مِنْ كِبْرٍ وَلَا يَدْخُلُ النَّارَ مَنْ كَانَ فِي قَلْبِهِ مِثْقَالُ خَرْدَلَةٍ مِنْ إِيمَانٍقَالَ أَبُو دَاوُد رَوَاهُ الْقَسْمَلِيُّ عَنْ الْأَعْمَشِ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus] berkata, telah menceritakan kepada kami [Abu Bakr] -maksudnya Abu Bakr Ibnu Ayyasy- dari [Al A'masy] dari [Ibrahim] dari [Alqamah] dari [Abdullah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak akan masuk surga orang yang dalam hatinya terdapat kesombongan sebesar biji sawi, dan tidak akan masuk ke dalam neraka orang yang dalam hatinya terdapat keimanan sebesar biji sawi.\" Abu Dawud berkata, \" [Al Qaslami] meriwayatkannya dari [Al A'masy] seperti hadits ini.\""
            },
            {
                "number": 3569,
                "arab": "حَدَّثَنَا أَبُو مُوسَى مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْوَهَّابِ حَدَّثَنَا هِشَامٌ عَنْ مُحَمَّدٍ عَنْ أَبِي هُرَيْرَةَأَنَّ رَجُلًا أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَانَ رَجُلًا جَمِيلًا فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي رَجُلٌ حُبِّبَ إِلَيَّ الْجَمَالُ وَأُعْطِيتُ مِنْهُ مَا تَرَى حَتَّى مَا أُحِبُّ أَنْ يَفُوقَنِي أَحَدٌ إِمَّا قَالَ بِشِرَاكِ نَعْلِي وَإِمَّا قَالَ بِشِسْعِ نَعْلِي أَفَمِنْ الْكِبْرِ ذَلِكَ قَالَ لَا وَلَكِنَّ الْكِبْرَ مَنْ بَطِرَ الْحَقَّ وَغَمَطَ النَّاسَ",
                "id": "Telah menceritakan kepada kami [Abu Musa Muhammad Ibnul Mutsanna] berkata, telah menceritakan kepada kami [Abdul Wahhab] berkata, telah menceritakan kepada kami [Hisyam] dari [Muhammad] dari [Abu Hurairah] ia berkata, \"Seorang laki-laki datang menemui Nabi shallallahu 'alaihi wasallam -laki-laki itu seorang yang tampan- dan berkata, \"Wahai Rasulullah, aku menyukai keindahan, dan aku juga diberi keindahan sebagaimana yang engkau lihat, sampai-sampai aku tidak suka jika ada seseorang yang melebihiku -mungkin ia mengatakan, 'meskipun berupa sandal atau tali sandal'-, apakah itu bagian dari rasa sombong?\" Beliau menjawab: \"Tidak. Akan tetapi Sombong adalah menolak kebenaran dan meremehkan orang lain.\""
            },
            {
                "number": 3570,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ قَالَسَأَلْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ عَنْ الْإِزَارِ فَقَال عَلَى الْخَبِيرِ سَقَطْتَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِزْرَةُ الْمُسْلِمِ إِلَى نِصْفِ السَّاقِ وَلَا حَرَجَ أَوْ لَا جُنَاحَ فِيمَا بَيْنَهُ وَبَيْنَ الْكَعْبَيْنِ مَا كَانَ أَسْفَلَ مِنْ الْكَعْبَيْنِ فَهُوَ فِي النَّارِ مَنْ جَرَّ إِزَارَهُ بَطَرًا لَمْ يَنْظُرْ اللَّهُ إِلَيْهِ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar] berkata, telah menceritakan kepada kami [Syu'bah] dari [Al 'Ala bin 'Abdurrahman] dari [Bapaknya] ia berkata, \"Aku bertanya kepada [Abu Sa'id Al Khudri] tentang kain sarung, lalu ia berkata, \"Engkau bertanya kepada orang yang tepat. Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kain sarung seorang muslim sebatas setengah betis, dan tidak berdosa antara batas setengah betis hingga dua mata kaki. Adapun apa yang ada di bawah kedua mata kaki adalah di neraka. Dan barangsiapa menjulurkan kain sarungnya karena sombong, maka Allah tidak akan melihatnya pada hari kiamat.\""
            },
            {
                "number": 3571,
                "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ حَدَّثَنَا حُسَيْنٌ الْجُعْفِيُّ عَنْ عَبْدِ الْعَزِيزِ بْنِ أَبِي رَوَّادٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْإِسْبَالُ فِي الْإِزَارِ وَالْقَمِيصِ وَالْعِمَامَةِ مَنْ جَرَّ مِنْهَا شَيْئًا خُيَلَاءَ لَمْ يَنْظُرْ اللَّهُ إِلَيْهِ يَوْمَ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Hannad bin As Sari] berkata, telah menceritakan kepada kami [Husain Al Ju'fi] dari [Abdul Aziz bin Abu Rawwad] dari [Salim bin Abdullah] dari [Bapaknya] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Isbal (menjulurkan kain) itu ada pada sarung, baju dan surban. Siapa yang memanjangkan salah satu darinya karena sombong, maka Allah tidak akan melihatnya kelak pada hari kiamat.\""
            },
            {
                "number": 3572,
                "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا ابْنُ الْمُبَارَكِ عَنْ أَبِي الصَّبَّاحِ عَنْ يَزِيدَ بْنِ أَبِي سُمَيَّةَ قَالَ سَمِعْتُ ابْنَ عُمَرَ يَقُولُمَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْإِزَارِ فَهُوَ فِي الْقَمِيصِ",
                "id": "Telah menceritakan kepada kami [Hannad] berkata, telah menceritakan kepada kami [Ibnul Mubarak] dari [Abu Ash Shabbah] dari [Yazid bin Abu Sumayyah] ia berkata; Aku mendengar [Ibnu Umar] berkata, \"Apa yang Rasulullah shallallahu 'alaihi wasallam sabdakan dalam (isbalnya) sarung maka juga berlaku pada gamis.\""
            },
            {
                "number": 3573,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ مُحَمَّدِ بْنِ أَبِي يَحْيَى قَالَ حَدَّثَنِي عِكْرِمَةُأَنَّهُ رَأَى ابْنَ عَبَّاسٍ يَأْتَزِرُ فَيَضَعُ حَاشِيَةَ إِزَارِهِ مِنْ مُقَدَّمِهِ عَلَى ظَهْرِ قَدَمَيْهِ وَيَرْفَعُ مِنْ مُؤَخَّرِهِ قُلْتُ لِمَ تَأْتَزِرُ هَذِهِ الْإِزْرَةَ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْتَزِرُهَا",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Yahya] dari [Muhammad bin Abu Yahya] ia berkata; telah menceritakan kepadaku [Ikrimah] Bahwasanya ia pernah melihat [Ibnu Abbas] mengenakan sarung, ia meletakkan ujung sarungnya mulai dari arah depan hingga ujung telapak kakinya dengan meninggikan bagian belakang. Aku lalu bertanya, \"Kenapa engkau memakai sarung seperti ini?\" ia menjawab, \"Aku melihat Rasulullah shallallahu 'alaihi wasallam memakai sarung seperti ini.\""
            },
            {
                "number": 3574,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ لَعَنَ الْمُتَشَبِّهَاتِ مِنْ النِّسَاءِ بِالرِّجَالِ وَالْمُتَشَبِّهِينَ مِنْ الرِّجَالِ بِالنِّسَاءِ",
                "id": "Telah menceritakan kepada kami [Ubaidullah bin Mu'adz] berkata, telah menceritakan kepada kami [Bapakku] berkata, telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Ikrimah] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam, Bahwasanya beliau melakanat para wanita yang menyurupai laki-laki, dan melaknat laki-laki yang menyerupai wanita.\""
            },
            {
                "number": 3575,
                "arab": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا أَبُو عَامِرٍ عَنْ سُلَيْمَانَ بْنِ بِلَالٍ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَلَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الرَّجُلَ يَلْبَسُ لِبْسَةَ الْمَرْأَةِ وَالْمَرْأَةَ تَلْبَسُ لِبْسَةَ الرَّجُلِ",
                "id": "Telah menceritakan kepada kami [Zuhair bin Harb] berkata, telah menceritakan kepada kami [Abu Amir] dari [Sulaiman bin Hilal] dari [Suhail] dari [Bapaknya] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melaknat laki-laki yang memakai pakaian wanita dan wanita yang memakai pakaian laki-laki.\""
            },
            {
                "number": 3576,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ لُوَيْنٌ وَبَعْضُهُ قِرَاءَةً عَلَيْهِ عَنْ سُفْيَانَ عَنْ ابْنِ جُرَيْجٍ عَنْ ابْنِ أَبِي مُلَيْكَةَ قَالَقِيلَ لِعَائِشَةَ رَضِيَ اللَّهُ عَنْهَا إِنَّ امْرَأَةً تَلْبَسُ النَّعْلَ فَقَالَتْ لَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الرَّجُلَةَ مِنْ النِّسَاءِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Sulaiman Luwain] -dan sebagiannya dengan cara dibacakan kepadanya- dari [Sufyan] dari [Ibnu Juraij] dari [Ibnu Abu Mulaikah] ia berkata, \"Dikatakan kepada ['Aisyah radliallahu 'anhu], \"Bagaimana dengan wanita yang memakai sandal?\" ia menjawab, \"Rasulullah shallallahu 'alaihi wasallam melaknat wanita-wanita yang menyerupai laki-laki.\""
            },
            {
                "number": 3577,
                "arab": "حَدَّثَنَا أَبُو كَامِلٍ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ إِبْرَاهِيمَ بْنِ مُهَاجِرٍ عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَاأَنَّهَا ذَكَرَتْ نِسَاءَ الْأَنْصَارِ فَأَثْنَتْ عَلَيْهِنَّ وَقَالَتْ لَهُنَّ مَعْرُوفًا وَقَالَتْ لَمَّا نَزَلَتْ سُورَةُ النُّورِ عَمِدْنَ إِلَى حُجُورٍ أَوْ حُجُوزٍ شَكَّ أَبُو كَامِلٍ فَشَقَقْنَهُنَّ فَاتَّخَذْنَهُ خُمُرًا",
                "id": "Telah menceritakan kepada kami [Abu Kamil] berkata, telah menceritakan kepada kami [Abu Awanah] dari [Ibrahim bin Muhajir] dari [Shafiyah binti Syaibah] dari ['Aisyah radliallahu 'anha] Bahwasanya ia menyebut-nyebut wanita Anshar, ia memuji dan mengatakan kebaikan kepada mereka. 'Aisyah berkata, \"Ketika turun surat An Nuur, mereka masuk ke dalam kamar, atau tempat pakaian -Abu Kamil ragu-, lalu mereka membelah dan menjadikannya sebagai kerudung.\""
            },
            {
                "number": 3578,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ حَدَّثَنَا ابْنُ ثَوْرٍ عَنْ مَعْمَرٍ عَنْ ابْنِ خُثَيْمٍ عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ عَنْ أُمِّ سَلَمَةَ قَالَتْلَمَّا نَزَلَتْ{ يُدْنِينَ عَلَيْهِنَّ مِنْ جَلَابِيبِهِنَّ }خَرَجَ نِسَاءُ الْأَنْصَارِ كَأَنَّ عَلَى رُءُوسِهِنَّ الْغِرْبَانَ مِنْ الْأَكْسِيَةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ubaid] berkata, telah menceritakan kepada kami [Ibnu Tsaur] dari [Ma'mar] dari [Ibnu Khutsaim] dari [Shafiyah binti Syaibah] dari [Ummu Salamah] ia berkata, \"Ketika turun ayat: '(Hendaklah mereka mengulurkan jilbabnya) ', wanita-wanita Anshar keluar seakan di atas kepala mereka ada burung gagak -karena tertutup kerudung hitam-.\""
            },
            {
                "number": 3579,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ ح و حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ وَابْنُ السَّرْحِ وَأَحْمَدُ بْنُ سَعِيدٍ الْهَمْدَانِيُّ قَالُوا أَخْبَرَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي قُرَّةُ بْنُ عَبْدِ الرَّحْمَنِ الْمَعَافِرِيُّ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّهَا قَالَتْيَرْحَمُ اللَّهُ نِسَاءَ الْمُهَاجِرَاتِ الْأُوَلَ لَمَّا أَنْزَلَ اللَّهُ{ وَلْيَضْرِبْنَ بِخُمُرِهِنَّ عَلَى جُيُوبِهِنَّ }شَقَقْنَ أَكْنَفَ قَالَ ابْنُ صَالِحٍ أَكْثَفَ مُرُوطِهِنَّ فَاخْتَمَرْنَ بِهَاحَدَّثَنَا ابْنُ السَّرْحِ قَالَ رَأَيْتُ فِي كِتَابِ خَالِي عَنْ عُقَيْلٍ عَنْ ابْنِ شِهَابٍ بِإِسْنَادِهِ وَمَعْنَاهُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Sulaiman bin Dawud Al Mahri] dan [Ibnu As Sarh] dan [Ahmad bin Sa'id Al Hamdani] mereka berkata; telah mengabarkan kepada kami [Ibnu Wahb] berkata; telah mengabarkan kepadaku [Qurrah bin 'Abdurrahman Al Ma'arifi] dari [Ibnu Syihab] dari [Urwah bin Az Zubair] dari ['Aisyah] radliallahu 'anha, Bahwasanya ia pernah berkata, \"Semoga Allah merahmati wanita-wanita muhajirat (wanita-wanita yang berhijrah ke Madinah) yang terdahulu, ketika Allah menurunkan ayat: (Dan hendaklah mereka menutupkan kerudung ke dadanya..), mereka memotong (kain) lengan, [Ibnu Shalih] menyebutkan, \"(mereka memotong) kelebihan kain mereka untuk menutupi wajah mereka.\" Telah menceritakan kepada kami [Ibnu As Sarh] ia berkata, \"Aku melihat dalam buku [pamanku]; dari [Uqail] dari [Ibnu Syihab] dengan sanad dan maknanya.\""
            },
            {
                "number": 3580,
                "arab": "حَدَّثَنَا يَعْقُوبُ بْنُ كَعْبٍ الْأَنْطَاكِيُّ وَمُؤَمَّلُ بْنُ الْفَضْلِ الْحَرَّانِيُّ قَالَا حَدَّثَنَا الْوَلِيدُ عَنْ سَعِيدِ بْنِ بَشِيرٍ عَنْ قَتَادَةَ عَنْ خَالِدٍ قَالَ يَعْقُوبُ ابْنُ دُرَيْكٍ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَاأَنَّ أَسْمَاءَ بِنْتَ أَبِي بَكْرٍ دَخَلَتْ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْهَا ثِيَابٌ رِقَاقٌ فَأَعْرَضَ عَنْهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ يَا أَسْمَاءُ إِنَّ الْمَرْأَةَ إِذَا بَلَغَتْ الْمَحِيضَ لَمْ تَصْلُحْ أَنْ يُرَى مِنْهَا إِلَّا هَذَا وَهَذَا وَأَشَارَ إِلَى وَجْهِهِ وَكَفَّيْهِقَالَ أَبُو دَاوُد هَذَا مُرْسَلٌ خَالِدُ بْنُ دُرَيْكٍ لَمْ يُدْرِكْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا",
                "id": "Telah menceritakan kepada kami [Ya'qub bin Ka'b Al Anthaki] dan [Muammal Ibnul Fadhl Al Harrani] keduanya berkata; telah menceritakan kepada kami [Al Walid] dari [Sa'id bin Basyir] dari [Qatadah] dari [Khalid] berkata; Ya'qub bin Duraik berkata dari ['Aisyah radliallahu 'anha], bahwa Asma binti Abu Bakr masuk menemui Rasulullah shallallahu 'alaihi wasallam dengan mengenakan kain yang tipis, maka Rasulullah shallallahu 'alaihi wasallam pun berpaling darinya. Beliau bersabda: \"Wahai Asma`, sesungguhnya seorang wanita jika telah baligh tidak boleh terlihat darinya kecuali ini dan ini -beliau menunjuk wajah dan kedua telapak tangannya-.\" Abu Dawud berkata, \"Ini hadits mursal. Khalid bin Duraik belum pernah bertemu dengan 'Aisyah radliallahu 'anha.\""
            },
            {
                "number": 3581,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَابْنُ مَوْهَبٍ قَالَا حَدَّثَنَا اللَّيْثُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍأَنَّ أُمَّ سَلَمَةَ اسْتَأْذَنَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْحِجَامَةِ فَأَمَرَ أَبَا طَيْبَةَ أَنْ يَحْجُمَهَاقَالَ حَسِبْتُ أَنَّهُ قَالَ كَانَ أَخَاهَا مِنْ الرَّضَاعَةِ أَوْ غُلَامًا لَمْ يَحْتَلِمْ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Ibnu Mauhab] keduanya berkata; telah menceritakan kepada kami [Al Laits] dari [Abu Az Zubair] dari [Jabir] berkata, \"Bahwasanya Ummu Salamah memohon izin kepada Rasulullah shallallahu 'alaihi wasallam untuk berbekam, maka beliau menyuruh Abu Thaibah untuk membekamnya.\" Perawi berkata, \"Aku mengira bahwa Jabir mengatakan, \"Abu Thaibah adalah saudara persusuan Ummu Salamah, atau ia mengatakan, \"anak kecil yang belum mimpi basah (balig).\""
            },
            {
                "number": 3582,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا أَبُو جُمَيْعٍ سَالِمُ بْنُ دِينَارٍ عَنْ ثَابِتٍ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَى فَاطِمَةَ بِعَبْدٍ كَانَ قَدْ وَهَبَهُ لَهَا قَالَ وَعَلَى فَاطِمَةَ رَضِيَ اللَّهُ عَنْهَا ثَوْبٌ إِذَا قَنَّعَتْ بِهِ رَأْسَهَا لَمْ يَبْلُغْ رِجْلَيْهَا وَإِذَا غَطَّتْ بِهِ رِجْلَيْهَا لَمْ يَبْلُغْ رَأْسَهَا فَلَمَّا رَأَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا تَلْقَى قَالَ إِنَّهُ لَيْسَ عَلَيْكِ بَأْسٌ إِنَّمَا هُوَ أَبُوكِ وَغُلَامُكِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa] berkata, telah menceritakan kepada kami [Abu Jumai' Salim bin Dinar] dari [Tsabit] dari [Anas] berkata, \"Nabi shallallahu 'alaihi wasallam membawa seorang budak untuk Fatimah yang beliau hibahkan kepadanya.\" Anas berkata, \"Fatimah radliallahu 'anha mempunyai kain yang jika ia tutupkan kepala maka kakinya terlihat, dan jika ia tutupkan kaki maka kepalanya terlihat. Ketika Nabi shallallahu 'alaihi wasallam melihat hal itu beliau bersabda: \"Tidak ada masalah bagimu, sebab ini adalah bapak dan budakmu.\""
            },
            {
                "number": 3583,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ حَدَّثَنَا مُحَمَّدُ بْنُ ثَوْرٍ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ وَهِشَامِ بْنِ عُرْوَةَ عَنْ عُرْوَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْكَانَ يَدْخُلُ عَلَى أَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُخَنَّثٌ فَكَانُوا يَعُدُّونَهُ مِنْ غَيْرِ أُولِي الْإِرْبَةِ فَدَخَلَ عَلَيْنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا وَهُوَ عِنْدَ بَعْضِ نِسَائِهِ وَهُوَ يَنْعَتُ امْرَأَةً فَقَالَ إِنَّهَا إِذَا أَقْبَلَتْ أَقْبَلَتْ بِأَرْبَعٍ وَإِذَا أَدْبَرَتْ أَدْبَرَتْ بِثَمَانٍ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا أَرَى هَذَا يَعْلَمُ مَا هَاهُنَا لَا يَدْخُلَنَّ عَلَيْكُنَّ هَذَا فَحَجَبُوهُحَدَّثَنَا مُحَمَّدُ بْنُ دَاوُدَ بْنِ سُفْيَانَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ بِمَعْنَاهُ حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ بِهَذَا الْحَدِيثِ زَادَ وَأَخْرَجَهُ فَكَانَ بِالْبَيْدَاءِ يَدْخُلُ كُلَّ جُمْعَةٍ يَسْتَطْعِمُ حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ حَدَّثَنَا عُمَرُ عَنْ الْأَوْزَاعِيِّ فِي هَذِهِ الْقِصَّةِ فَقِيلَ يَا رَسُولَ اللَّهِ إِنَّهُ إِذَنْ يَمُوتُ مِنْ الْجُوعِ فَأَذِنَ لَهُ أَنْ يَدْخُلَ فِي كُلِّ جُمْعَةٍ مَرَّتَيْنِ فَيَسْأَلُ ثُمَّ يَرْجِعُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ubaid] berkata, telah menceritakan kepada kami [Muhammad bin Tsaur] dari [Ma'mar] dari [Az Zuhri] dan [Hisyam bin Urwah] dari [Urwah] dari ['Aisyah] radliallahu 'anha, ia berkata, \"Seorang laki-laki (banci) masuk menemui isteri-isteri Nabi shallallahu 'alaihi wasallam, dan para sahabat menganggapnya sebagai Ghairu Ulil Irbah (orang-orang yang tidak punya nafsu kepada wanita). Suatu ketika Nabi shallallahu 'alaihi wasallam masuk menemui kami sementara laki-laki banci itu bersama isteri-isteri beliau seraya mensifati wanita dengan berkata; 'Wanita itu jika menghadap ke depan maka ia menghadap dengan empat (lipatan), dan jika menghadap ke belakang maka ia menghadap dengan delapan (lipatan) '. Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Ketahuilah, aku melihat orang ini (banci) mengetahui apa yang ada pada wanita, maka jangan sekali-kali ia masuk menemui kalian.\" Mereka pun akhirnya memakai hijab.\" Telah menceritakan kepada kami [Muhammad bin Dawud bin Sufyan] berkata, telah menceritakan kepada kami [Abdurrazaq] berkata, telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Urwah] dari ['Aisyah] secara makna. Telah menceritakan kepada kami [Ahmad bin Shalih] berkata, telah menceritakan kepada kami [Ibnu Wahb] berkata, telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari [Urwah] dari ['Aisyah] dengan hadits ini.. dengan tambahan, \"Nabi shallallahu 'alaihi wasallam mengeluarkan laki-laki (banci) itu ke padang pasir, dan datang setiap hari jum'at untuk mencari makan.\" Telah menceritakan kepada kami [Mahmud bin Khalid] berkata, telah menceritakan kepada kami [Umar] dari [Al Auza'i] -dalam kisah ini-, dikatakan, \"Wahai Rasulullah, bagaimana jika laki-laki (banci itu) mati kelaparan?\" beliau lalu memberinya izin untuk masuk dua kali setiap hari jum'at untuk minta makan, kemudian kembali lagi.\"Ket; lipatan maksudnya, wanita yang gemuk jika dilihat dari arah perut maka akan terlihat dua lipatan -setiap lipatan ada dua sisi- yang ada diperutnya, sementara jika dilihat dari arah punggung maka akan terlihat empat lipatan yang memiliki delapan sisi. Dan ini hanya terjadi pada wanita yang gemuk. "
            },
            {
                "number": 3584,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ الْمَرْوَزِيُّ حَدَّثَنَا عَلِيُّ بْنُ الْحُسَيْنِ بْنِ وَاقِدٍ عَنْ أَبِيهِ عَنْ يَزِيدَ النَّحْوِيِّ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ{ وَقُلْ لِلْمُؤْمِنَاتِ يَغْضُضْنَ مِنْ أَبْصَارِهِنَّ }الْآيَةَ فَنُسِخَ وَاسْتَثْنَى مِنْ ذَلِكَ{ وَالْقَوَاعِدُ مِنْ النِّسَاءِ اللَّاتِي لَا يَرْجُونَ نِكَاحًا }الْآيَةَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Muhammad Al Marwazi] berkata, telah menceritakan kepada kami [Ali Ibnul Husain bin Waqid] dari [Bapaknya] dari [Yazid An Nahwi] dari [Ikrimah] dari [Ibnu Abbas] berkata, \"Tentang ayat: (Katakanlah kepada wanita yang beriman, 'Hendaklah mereka menahan pandangannya..) ' telah dihapus, namun ada yang dikecualikan: '(dan wanita-wanita tua yang telah terhenti (dari haid dan mengandung), yang tidak ingin kawin (lagi)..) '.\""
            },
            {
                "number": 3585,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا ابْنُ الْمُبَارَكِ عَنْ يُونُسَ عَنْ الزُّهْرِيِّ قَالَ حَدَّثَنِي نَبْهَانُ مَوْلَى أُمِّ سَلَمَةَ عَنْ أُمِّ سَلَمَةَ قَالَتْكُنْتُ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعِنْدَهُ مَيْمُونَةُ فَأَقْبَلَ ابْنُ أُمِّ مَكْتُومٍ وَذَلِكَ بَعْدَ أَنْ أُمِرْنَا بِالْحِجَابِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَجِبَا مِنْهُ فَقُلْنَا يَا رَسُولَ اللَّهِ أَلَيْسَ أَعْمَى لَا يُبْصِرُنَا وَلَا يَعْرِفُنَا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفَعَمْيَاوَانِ أَنْتُمَا أَلَسْتُمَا تُبْصِرَانِهِقَالَ أَبُو دَاوُد هَذَا لِأَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَاصَّةً أَلَا تَرَى إِلَى اعْتِدَادِ فَاطِمَةَ بِنْتِ قَيْسٍ عِنْدَ ابْنِ أُمِّ مَكْتُومٍ قَدْ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِفَاطِمَةَ بِنْتِ قَيْسٍ اعْتَدِّي عِنْدَ ابْنِ أُمِّ مَكْتُومٍ فَإِنَّهُ رَجُلٌ أَعْمَى تَضَعِينَ ثِيَابَكِ عِنْدَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad Ibnul 'Ala`] berkata, telah menceritakan kepada kami [Ibnul Mubarak] dari [Yunus] dari [Az Zuhri] ia berkata; telah menceritakan kepadaku [Nabhan] -mantan budak (yang telah dimerdekakan oleh) Ummu Salamah- dari [Ummu Salamah] ia berkata, \"Aku berada di sisi Rasulullah shallallahu 'alaihi wasallam ketika Maimunah sedang bersamanya. Lalu masuklah Ibnu Ummi Maktum -yaitu ketika perintah hijab telah turun-. Maka Nabi shallallahu 'alaihi wasallam pun bersabda: \"Berhijablah kalian berdua darinya.\" Kami bertanya, \"Wahai Rasulullah, bukankah ia buta sehingga tidak bisa melihat dan mengetahui kami?\" Nabi shallallahu 'alaihi wasallam balik bertanya: \"Apakah kalian berdua buta? Bukankah kalian berdua dapat melihat dia?\" Abu Dawud berkata, \"Ini hanya khusus untuk isteri-isteri Nabi shallallahu 'alaihi wasallam, tidakkah engkau lihat bagaimana Fatimah binti Qais di sisi Ibnu Ummi Maktum! Nabi shallallahu 'alaihi wasallam pernah berkata kepada Fatimah binti Qais, 'Bukalah hijabmu di sisi Ibnu Ummi Maktum, sebab ia adalah seorang laki-laki buta, maka tidak mengapa engkau letakkan pakaianmu di sisinya.\""
            },
            {
                "number": 3586,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمَيْمُونِ حَدَّثَنَا الْوَلِيدُ عَنْ الْأَوْزَاعِيِّ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا زَوَّجَ أَحَدُكُمْ عَبْدَهُ أَمَتَهُ فَلَا يَنْظُرْ إِلَى عَوْرَتِهَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah Ibnul Maimun] berkata, telah menceritakan kepada kami [Al Walid] dari [Al Auza'i] dari [Amru bin Syu'aib] dari [Bapaknya] dari [Kakeknya] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika salah seorang dari kalian menikahkan budak lelakinya dengan budak wanitanya, maka janganlah ia melihat aurat budak wanita tersebut.\""
            },
            {
                "number": 3587,
                "arab": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنِي دَاوُدُ بْنُ سَوَّارٍ الْمُزَنِيُّ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا زَوَّجَ أَحَدُكُمْ خَادِمَهُ عَبْدَهُ أَوْ أَجِيرَهُ فَلَا يَنْظُرْ إِلَى مَا دُونَ السُّرَّةِ وَفَوْقَ الرُّكْبَةِقَالَ أَبُو دَاوُد وَصَوَابُهُ سَوَّارُ بْنُ دَاوُدَ الْمُزَنِيُّ الصَّيْرَفِيُّ وَهِمَ فِيهِ وَكِيعٌ",
                "id": "Telah menceritakan kepada kami [Zuhair bin Harb] berkata, telah menceritakan kepada kami [Waki'] berkata, telah menceritakan kepadaku [Dawud bin Sawwar Al Muzani] dari [Amru bin Syu'aib] dari [Bapaknya] dari [Kakeknya] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika salah seorang dari kalian menikahkan pembantunya (budak wanita) dengan budak laki-lakinya atau pekerjanya, maka janganlah ia melihat apa yang ada di bawah pusar dan di atas lutut.\" Abu Dawud berkata, \"Yang benar adalah Sawwar bin Dawud Al Muzani Ash Shairafi, namun Waki' masih merasa ragu.\""
            },
            {
                "number": 3588,
                "arab": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ ح و حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ وَهْبٍ مَوْلَى أَبِي أَحْمَدَ عَنْ أُمِّ سَلَمَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا وَهِيَ تَخْتَمِرُ فَقَالَ لَيَّةً لَا لَيَّتَيْنِقَالَ أَبُو دَاوُد مَعْنَى قَوْلِهِ لَيَّةً لَا لَيَّتَيْنِ يَقُولُ لَا تَعْتَمُّ مِثْلَ الرَّجُلِ لَا تُكَرِّرُهُ طَاقًا أَوْ طَاقَيْنِ",
                "id": "Telah menceritakan kepada kami [Zuhair bin Harb] berkata, telah menceritakan kepada kami ['Abdurrahman]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Yahya] dari [Sufyan] dari [Habib bin Abu Tsabit] dari [Wahb] -mantan budak (yang telah dimerdekakan oleh) Abu Ahmad- dari [Ummu Salamah] Bahwasanya Nabi shallallahu 'alaihi wasallam pernah masuk menemuinya, sementara ia sedang mengenakan kerudung. Maka beliau bersabda: \"Lilitkanlah sekali saja, jangan dua kali lilitan.\" Abu Dawud berkata; \"Makna sabda Nabi, 'Lilitkanlah sekali saja, jangan dua kali lilitan' adalah janganlah engkau seperti lelaki memakai imamah (surban yang dililitkan pada kepala), jangan engkau ulangi berkali-kali.\""
            },
            {
                "number": 3589,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ وَأَحْمَدُ بْنُ سَعِيدٍ الْهَمْدَانِيُّ قَالَا أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنَا ابْنُ لَهِيعَةَ عَنْ مُوسَى بْنِ جُبَيْرٍ أَنَّ عُبَيْدَ اللَّهِ بْنَ عَبَّاسٍ حَدَّثَهُ عَنْ خَالِدِ بْنِ يَزِيدَ بْنِ مُعَاوِيَةَ عَنْ دِحْيَةَ بْنِ خَلِيفَةَ الْكَلْبِيِّ أَنَّهُ قَالَأُتِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَبَاطِيَّ فَأَعْطَانِي مِنْهَا قُبْطِيَّةً فَقَالَ اصْدَعْهَا صَدْعَيْنِ فَاقْطَعْ أَحَدَهُمَا قَمِيصًا وَأَعْطِ الْآخَرَ امْرَأَتَكَ تَخْتَمِرُ بِهِ فَلَمَّا أَدْبَرَ قَالَ وَأْمُرْ امْرَأَتَكَ أَنْ تَجْعَلَ تَحْتَهُ ثَوْبًا لَا يَصِفُهَاقَالَ أَبُو دَاوُد رَوَاهُ يَحْيَى بْنُ أَيُّوبَ فَقَالَ عَبَّاسُ بْنُ عُبَيْدِ اللَّهِ بْنِ عَبَّاسٍ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Amru bin As Sarh] dan [Ahmad bin Sa'id Al Hamdani] keduanya berkata; telah mengabarkan kepada kami [Ibnu Wahb] berkata, telah mengabarkan kepada kami [Ibnu Lahi'ah] dari [Musa bin Jubair] bahwa [Ubaidullah bin Abbas] menceritakan kepadanya dari [Khalid bin Yazid bin Mu'awiyah] dari [Dihyah bin Khalifah Al Kalbi] Bahwasanya ia berkata, \"Rasulullah shallallahu 'alaihi wasallam diberi beberapa potong kain Qubthiyah (kain mesir yang tipis dan berwarna putih), lalu memberikan satu potong kepadaku. Beliau bersabda: \"Bagilah menjadi dua bagian. Sebagian buatlah baju dan sebagian yang lain berikanlah kepada isterimu untuk dijadikan kerudung.\" Ketika telah berlalu, beliau berbalik dan bersabda: \"Perintahkanlah isterimu agar ia melapisi pada bagian bawahnya agar tidak membentuk tubuhnya.\" Abu Dawud berkata, \"Hadits ini diriwayatkan oleh [Yahya bin Ayyub], dan ia berkata; [Abbas bin Ubaidullah bin Abbas].\""
            },
            {
                "number": 3590,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ أَبِي بَكْرِ بْنِ نَافِعٍ عَنْ أَبِيهِ عَنْ صَفِيَّةَ بِنْتِ أَبِي عُبَيْدٍ أَنَّهَا أَخْبَرَتْهُأَنَّ أُمَّ سَلَمَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ ذَكَرَ الْإِزَارَ فَالْمَرْأَةُ يَا رَسُولَ اللَّهِ قَالَ تُرْخِي شِبْرًا قَالَتْ أُمُّ سَلَمَةَ إِذًا يَنْكَشِفُ عَنْهَا قَالَ فَذِرَاعًا لَا تَزِيدُ عَلَيْهِحَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى أَخْبَرَنَا عِيسَى عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ أُمِّ سَلَمَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْحَدِيثِ قَالَ أَبُو دَاوُد رَوَاهُ ابْنُ إِسْحَقَ وَأَيُّوبُ بْنُ مُوسَى عَنْ نَافِعٍ عَنْ صَفِيَّةَ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik] dari [Abu Bakr bin Nafi'] dari [bapaknya] bahwasanya [Shafiyah binti Abu Ubaid] mengabarkan kepadanya, bahwa [Ummu Salamah] isteri Nabi shallallahu 'alaihi wasallam berkata kepada Rasulullah shallallahu 'alaihi wasallam ketika beliau menyebutkan tentang kain sarung, \"Wahai Rasulullah, bagaimana dengan wanita?\" beliau menjawab: \"Lebihkanlah satu jengkal.\" Ummu Salamah berkata lagi, \"Bagaimana jika masih terlihat?\" beliau menjawab: \"Lebihkanlah satu hasta dan jangan lebih.\" Telah menceritakan kepada kami [Ibrahim bin Musa] berkata, telah mengabarkan kepada kami [Isa] dari [Ubaidullah] dari [Nafi'] dari [Sulaiman bin Yasar] dari [Ummu Salamah] dari Nabi shallallahu 'alaihi wasallam dengan hadits ini.\" Abu Dawud berkata, \" [Ibnu Ishaq] dan [Ayyub bin Musa] juga menceritakan dari [Nafi'] dari [Shafiyah].\""
            },
            {
                "number": 3591,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ سُفْيَانَ أَخْبَرَنِي زَيْدٌ الْعَمِّيُّ عَنْ أَبِي الصِّدِّيقِ النَّاجِيِّ عَنْ ابْنِ عُمَرَ قَالَرَخَّصَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأُمَّهَاتِ الْمُؤْمِنِينَ فِي الذَّيْلِ شِبْرًا ثُمَّ اسْتَزَدْنَهُ فَزَادَهُنَّ شِبْرًا فَكُنَّ يُرْسِلْنَ إِلَيْنَا فَنَذْرَعُ لَهُنَّ ذِرَاعًا",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Yahya bin Sa'id] dari [Sufyan] berkata, telah mengabarkan kepadaku [Zaid Al 'Ammi] dari [Abu Ash Shiddiq An Naji] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam memberi keringanan para Ummahatul Mukminin (isteri-isteri Nabi) untuk memanjangkan kain mereka satu jengkal, lalu mereka minta untuk ditambah dan beliau menambahkan satu jengkal lagi. Maka, mereka kemudian memanjangkan kainnya hingga satu hasta.\""
            },
            {
                "number": 3592,
                "arab": "حَدَّثَنَا مُسَدَّدٌ وَوَهْبُ بْنُ بَيَانٍ وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ وَابْنُ أَبِي خَلَفٍ قَالُوا حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ قَالَ مُسَدَّدٌ وَوَهْبٌ عَنْ مَيْمُونَةَ قَالَتْأُهْدِيَ لِمَوْلَاةٍ لَنَا شَاةٌ مِنْ الصَّدَقَةِ فَمَاتَتْ فَمَرَّ بِهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَلَا دَبَغْتُمْ إِهَابَهَا وَاسْتَنْفَعْتُمْ بِهِ قَالُوا يَا رَسُولَ اللَّهِ إِنَّهَا مَيْتَةٌ قَالَ إِنَّمَا حُرِّمَ أَكْلُهَاحَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَزِيدُ حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ بِهَذَا الْحَدِيثِ لَمْ يَذْكُرْ مَيْمُونَةَ قَالَ فَقَالَ أَلَا انْتَفَعْتُمْ بِإِهَابِهَا ثُمَّ ذَكَرَ مَعْنَاهُ لَمْ يَذْكُرْ الدِّبَاغَ",
                "id": "Telah menceritakan kepada kami [Musaddad] dan [Wahb bin Bayan] dan [Utsman bin Abu Syaibah] dan [Ibnu Abu Khalaf] mereka berkata; telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Ubaidullah bin Abdullah] dari [Ibnu Abbas]. [Musaddad] dan [Wahb] berkata; dari [Maimunah] ia berkata, \"Pelayan kami mendapat hadiah seekor kambing, kemudian kambing itu mati. Ketika Nabi shallallahu 'alaihi wasallam melewatinya, beliau bersabda: \"Kenapa kalian tidak menyamak kulitnya hingga kalian dapat memanfaatkannya?\" orang-orang menjawab, \"Kambing itu telah mati.\" Beliau bersabda: \"Yang diharamkan itu memakannya.\" Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Yazid] berkata, telah menceritakan kepada kami [Ma'mar] dari [Az Zuhri] seperti hadits ini, namun ia tidak menyebut nama Maimunah. Ia berkata, \"Rasulullah bersabda: \"Kenapa kalian tidak memanfaatkan kulitnya?\" Ia lalu menyebutkan makna hadits tersebut, namun tidak menyebutkan kata 'menyamak'.\""
            },
            {
                "number": 3593,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ قَالَ مَعْمَرٌ وَكَانَ الزُّهْرِيُّيُنْكِرُ الدِّبَاغَ وَيَقُولُ يُسْتَمْتَعُ بِهِ عَلَى كُلِّ حَالٍقَالَ أَبُو دَاوُد لَمْ يَذْكُرْ الْأَوْزَاعِيُّ وَيُونُسُ وَعُقَيْلٌ فِي حَدِيثِ الزُّهْرِيِّ الدِّبَاغَ وَذَكَرَهُ الزُّبَيْدِيُّ وَسَعِيدُ بْنُ عَبْدِ الْعَزِيزِ وَحَفْصُ بْنُ الْوَلِيدِ ذَكَرُوا الدِّبَاغَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris] berkata, telah menceritakan kepada kami [Abdurrazaq] ia berkata; [Ma'mar] berkata; [Az Zuhri] mengingkari bolehnya kulit yang disamak, ia mengatakan, \"Ia bisa dimanfaatkan dalam setiap keadaan.\" Abu Dawud berkata, \"Al Auza'I, Yunus dan Uqail dalam hadits Az Zuhri tidak menyebutkan kata 'samak'. Sedangkan Az Zubaidi, Sa'id bin Abdul Aziz dan Hafsh Ibnul Walid, mereka menyebutkan kata 'samak'.\""
            },
            {
                "number": 3594,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ وَعْلَةَ عَنْ ابْنِ عَبَّاسٍ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا دُبِغَ الْإِهَابُ فَقَدْ طَهُرَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] berkata, telah mengabarkan kepada kami [Sufyan] dari [Zaid bin Aslam] dari ['Abdurrahman bin Wa'lah] dari [Ibnu Abbas] ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika kulit disamak, maka ia telah suci.\""
            },
            {
                "number": 3595,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ قُسَيْطٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ ثَوْبَانَ عَنْ أُمِّهِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ أَنْ يُسْتَمْتَعَ بِجُلُودِ الْمَيْتَةِ إِذَا دُبِغَتْ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik] dari [Yazid bin Abdullah bin Qusaith] dari [Muhammad bin 'Abdurrahman bin Tsauban] dari [Ibunya] dari ['Aisyah] isteri Nabi shallallahu 'alaihi wasallam berkata, \"Rasulullah shallallahu 'alaihi wasallam memerintahkan untuk memanfaatkan kulit jika telah disamak.\""
            },
            {
                "number": 3596,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ وَمُوسَى بْنُ إِسْمَعِيلَ قَالَا حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ جَوْنِ بْنِ قَتَادَةَ عَنْ سَلَمَةَ بْنِ الْمُحَبَّقِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةِ تَبُوكَ أَتَى عَلَى بَيْتٍ فَإِذَا قِرْبَةٌ مُعَلَّقَةٌ فَسَأَلَ الْمَاءَ فَقَالُوا يَا رَسُولَ اللَّهِ إِنَّهَا مَيْتَةٌ فَقَالَ دِبَاغُهَا طُهُورُهَا",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar] dan [Musa bin Isma'il] keduanya berkata; telah menceritakan kepada kami [Hammam] dari [Qatadah] dari [Al Hasan] dari [Jaun bin Qatadah] dari [Salamah Ibnul Muhabbaq] berkata, \"Ketika perang Tabuk, Rasulullah shallallahu 'alaihi wasallam mendatangi sebuah rumah, lalu beliau menemukan sebuah wadah dari kulit yang digantung. Beliau kemudian minta diambilkan air dengan wadah tersebut, maka para sahabat pun berkata, \"Wahai Rasulullah, sesungguhnya wadah itu dari kulit bangkai!\" beliau bersabda: \"Penyamakannya telah menjadikan ia suci.\""
            },
            {
                "number": 3597,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو يَعْنِي ابْنَ الْحَارِثِ عَنْ كَثِيرِ بْنِ فَرْقَدٍ عَنْ عَبْدِ اللَّهِ بْنِ مَالِكِ بْنِ حُذَافَةَ حَدَّثَهُ عَنْ أُمِّهِ الْعَالِيَةِ بِنْتِ سُبَيْعٍ أَنَّهَا قَالَتْكَانَ لِي غَنَمٌ بِأُحُدٍ فَوَقَعَ فِيهَا الْمَوْتُ فَدَخَلْتُ عَلَى مَيْمُونَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرْتُ ذَلِكَ لَهَا فَقَالَتْ لِي مَيْمُونَةُ لَوَ أَخَذْتِ جُلُودَهَا فَانْتَفَعْتِ بِهَا فَقَالَتْ أَوَ يَحِلُّ ذَلِكَ قَالَتْ نَعَمْ مَرَّ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رِجَالٌ مِنْ قُرَيْشٍ يَجُرُّونَ شَاةً لَهُمْ مِثْلَ الْحِمَارِ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ أَخَذْتُمْ إِهَابَهَا قَالُوا إِنَّهَا مَيْتَةٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُطَهِّرُهَا الْمَاءُ وَالْقَرَظُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] berkata, telah menceritakan kepada kami [Ibnu Wahb] berkata, telah mengabarkan kepadaku [Amru] -yaitu Ibnul Harits- dari [Katsir bin Farqad] dari [Abdullah bin Malik bin Hudzafah] ia menceritakan kepadanya dari [ibunya yaitu Al 'Aliyah binti Subai'] Bahwasanya ia berkata, \"Aku mempunyai seekor kambing di gunung uhud, namun tiba-tiba ia mati. Lalu aku menemui [Maimunah] isteri Nabi shallallahu 'alaihi wasallam dan menceritakan hal itu kepadanya. Maimunah lantas berkata kepadaku, \"Kenapa tidak engkau ambil kulitnya hingga engkau bisa memanfaatkannya?\" Ia bertanya, \"Apakah itu boleh?\" Maimunah menjawab, \"Boleh. Suatu ketika beberapa laki-laki Quraisy melewati Rasulullah shallallahu 'alaihi wasallam dengan menyeret kambing mereka seperti keledai. Rasulullah shallallahu 'alaihi wasallam lalu berkata kepada mereka: \"Sekiranya kalian ambil kulitnya.\" Mereka berkata, \"Kambing itu telah mati.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Air dan Al Qarazh (daun dari jenis pohon yang biasa digunakan untuk menyamak) akan mensucikannya.\""
            },
            {
                "number": 3598,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ عَبْدِ اللَّهِ بْنِ عُكَيْمٍ قَالَقُرِئَ عَلَيْنَا كِتَابُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِأَرْضِ جُهَيْنَةَ وَأَنَا غُلَامٌ شَابٌّ أَنْ لَا تَسْتَمْتِعُوا مِنْ الْمَيْتَةِ بِإِهَابٍ وَلَا عَصَبٍ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar] berkata, telah menceritakan kepada kami [Syu'bah] dari [Al Hakam] dari ['Abdurrahman bin Abu Laila] dari [Abdullah bin Ukaim] ia berkata, \"Ketika kami sedang berada di Juhainah, buku Rasulullah shallallahu 'alaihi wasallam dibacakan kepada kami, dan waktu itu aku masih seorang bocah, yaitu: “Tidakkah kalian memanfaatkannya dengan menyamak kulitnya.”"
            },
            {
                "number": 3599,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ مَوْلَى بَنِي هَاشِمٍ حَدَّثَنَا الثَّقَفِيُّ عَنْ خَالِدٍ عَنْ الْحَكَمِ بْنِ عُتَيْبَةَأَنَّهُ انْطَلَقَ هُوَ وَنَاسٌ مَعَهُ إِلَى عَبْدِ اللَّهِ بْنِ عُكَيْمٍ رَجُلٌ مِنْ جُهَيْنَةَ قَالَ الْحَكَمُ فَدَخَلُوا وَقَعَدْتُ عَلَى الْبَابِ فَخَرَجُوا إِلَيَّ فَأَخْبَرُونِي أَنَّ عَبْدَ اللَّهِ بْنَ عُكَيْمٍ أَخْبَرَهُمْ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ إِلَى جُهَيْنَةَ قَبْلَ مَوْتِهِ بِشَهْرٍ أَنْ لَا تَنْتَفِعُوا مِنْ الْمَيْتَةِ بِإِهَابٍ وَلَا عَصَبٍقَالَ أَبُو دَاوُد قَالَ النَّضْرُ بْنُ شُمَيْلٍ يُسَمَّى إِهَابًا مَا لَمْ يُدْبَغْ فَإِذَا دُبِغَ لَا يُقَالُ لَه إِهَابٌ إِنَّمَا يُسَمَّى شَنًّا وَقِرْبَةً",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isma'il] -mantan budak bani Hasyim- berkata, telah menceritakan kepada kami [At Tsaqafi] dari [Khalid] dari [Al Hakam bin Utaibah] Bahwasanya ia dan beberapa orang menemui [Abdullah bin Ukaim] -seorang laki-laki dari Juhainah-. Al Hakam berkata, \"Mereka lalu masuk sementara aku duduk di depan pintu, kemudian mereka keluar menemuiku mengabarkan kepadaku bahwa Abdullah bin Ukaim telah mengabarkan kepada mereka, bahwa Rasulullah shallallahu 'alaihi wasallam telah menulis surat kepada orang-orang Juhainah sebulan sebelum beliau wafat, yaitu: \"Janganlah kalian memanfaatkan kulit atau tanduk bangkai.” Abu Daud berkata; An Nadhar bin Syumail mengatakan; \"dinamakan ihab (kulit bangkai) jika belum disamak, namun jika telah disamak maka tidak dinamakan lagi ihab (kulit bangkai), akan tetapi dinamakan griba (wadah dari kulit).”"
            },
            {
                "number": 3600,
                "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ وَكِيعٍ عَنْ أَبِي الْمُعْتَمِرِ عَنْ ابْنِ سِيرِينَ عَنْ مُعَاوِيَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَرْكَبُوا الْخَزَّ وَلَا النِّمَارَقَالَ وَكَانَ مُعَاوِيَةُ لَا يُتَّهَمُ فِي الْحَدِيثِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَنَا أَبُو سَعِيدٍ قَالَ لَنَا أَبُو دَاوُدَ أَبُو الْمُعْتَمِرِ اسْمُهُ يَزِيدُ بْنُ طَهْمَانَ كَانَ يَنْزِلُ الْحِيَرَةَ",
                "id": "Telah menceritakan kepada kami [Hannad bin As Sari] dari [Waki'] dari [Abu Al Mu'tamir] dari [Ibnu Sirin] dari [Mu'awiyah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian mengendarai dengan pelana dari sutera dan kulit harimau.\" Ia berkata, \"Mu'awiyah bukan termasuk orang-orang yang dituduh sebagai orang yang membuat-buat hadits dari Rasulullah shallallahu 'alaihi wasallam.\" Abu Sa'id berkata kepada kami, \"Abu Dawud berkata kepada kami, \"Abu Al Mu'tamir nama aslinya adalah Yazid bin Thahman, ia pernah singgah di daerah Al Hiyarah.\""
            },
            {
                "number": 3601,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو دَاوُدَ حَدَّثَنَا عِمْرَانُ عَنْ قَتَادَةَ عَنْ زُرَارَةَ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَصْحَبُ الْمَلَائِكَةُ رُفْقَةً فِيهَا جِلْدُ نَمِرٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Abu Dawud] berkata, telah menceritakan kepada kami [Imran] dari [Qatadah] dari [Zurarah] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Malaikat tidak akan menyertai rombongan yang di dalamnya terdapat kulit harimau.\""
            },
            {
                "number": 3602,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدٍ الْحِمْصِيُّ حَدَّثَنَا بَقِيَّةُ عَنْ بَحِيرٍ عَنْ خَالِدٍ قَالَوَفَدَ الْمِقْدَامُ بْنُ مَعْدِي كَرِبَ وَعَمْرُو بْنُ الْأَسْوَدِ وَرَجُلٌ مِنْ بَنِي أَسَدٍ مِنْ أَهْلِ قِنَّسْرِينَ إِلَى مُعَاوِيَةَ بْنِ أَبِي سُفْيَانَ فَقَالَ مُعَاوِيَةُ لِلْمِقْدَامِ أَعَلِمْتَ أَنَّ الْحَسَنَ بْنَ عَلِيٍّ تُوُفِّيَ فَرَجَّعَ الْمِقْدَامُ فَقَالَ لَهُ رَجُلٌ أَتَرَاهَا مُصِيبَةً قَالَ لَهُ وَلِمَ لَا أَرَاهَا مُصِيبَةً وَقَدْ وَضَعَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حِجْرِهِ فَقَالَ هَذَا مِنِّي وَحُسَيْنٌ مِنْ عَلِيٍّ فَقَالَ الْأَسَدِيُّ جَمْرَةٌ أَطْفَأَهَا اللَّهُ عَزَّ وَجَلَّ قَالَ فَقَالَ الْمِقْدَامُ أَمَّا أَنَا فَلَا أَبْرَحُ الْيَوْمَ حَتَّى أُغَيِّظَكَ وَأُسْمِعَكَ مَا تَكْرَهُ ثُمَّ قَالَ يَا مُعَاوِيَةُ إِنَّ أَنَا صَدَقْتُ فَصَدِّقْنِي وَإِنْ أَنَا كَذَبْتُ فَكَذِّبْنِي قَالَ أَفْعَلُ قَالَ فَأَنْشُدُكَ بِاللَّهِ هَلْ تَعْلَمُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ لُبْسِ الذَّهَبِ قَالَ نَعَمْ قَالَ فَأَنْشُدُكَ بِاللَّهِ هَلْ تَعْلَمُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ لُبْسِ الْحَرِيرِ قَالَ نَعَمْ قَالَ فَأَنْشُدُكَ بِاللَّهِ هَلْ تَعْلَمُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ لُبْسِ جُلُودِ السِّبَاعِ وَالرُّكُوبِ عَلَيْهَا قَالَ نَعَمْ قَالَ فَوَاللَّهِ لَقَدْ رَأَيْتُ هَذَا كُلَّهُ فِي بَيْتِكَ يَا مُعَاوِيَةُ فَقَالَ مُعَاوِيَةُ قَدْ عَلِمْتُ أَنِّي لَنْ أَنْجُوَ مِنْكَ يَا مِقْدَامُ قَالَ خَالِدٌ فَأَمَرَ لَهُ مُعَاوِيَةُ بِمَا لَمْ يَأْمُرْ لِصَاحِبَيْهِ وَفَرَضَ لِابْنِهِ فِي الْمِائَتَيْنِ فَفَرَّقَهَا الْمِقْدَامُ فِي أَصْحَابِهِ قَالَ وَلَمْ يُعْطِ الْأَسَدِيُّ أَحَدًا شَيْئًا مِمَّا أَخَذَ فَبَلَغَ ذَلِكَ مُعَاوِيَةُ فَقَالَ أَمَّا الْمِقْدَامُ فَرَجُلٌ كَرِيمٌ بَسَطَ يَدَهُ وَأَمَّا الْأَسَدِيُّ فَرَجُلٌ حَسَنُ الْإِمْسَاكِ لِشَيْئِهِ",
                "id": "Telah menceritakan kepada kami [Amru bin Utsman bin Sa'id Al Himshi] berkata, telah menceritakan kepada kami [Baqiyyah] dari [Bahira] dari [Khalid] ia berkata, \" [Al Miqdam bin Ma'di Karib], Amru bin Al Aswad dan seorang laki-laki dari bani Asad, dari penduduk Qinnasrin datang kepada [Mu'awiyah bin Abu Sufyan]. Mu'awiyah lalu berkata kepada Al Miqdam, \"Tidakkah kamu tahu bahwa Al Hasan bin Ali telah wafat?\" Al Miqdam pun mengucapkan istirja' (ucapan inna lillahi wa inna ilaihi raaji'uun). Lalu ada seorang laki-laki berkata kepadanya, \"Apakah kamu menganggapnya sebagai musibah?\" Al Miqdam balik berkata, \"Kenapa aku tidak menganggapnya sebagai musibah, padahal ia adalah orang yang pernah berada dalam pangkuan Rasulullah shallallahu 'alaihi wasallam? beliau juga telah bersabda: \"Ini (Hasan) dariku, dan Husain dari Ali.\" Al Asadi lantas berkata, \"Bara api ini (Hasan) telah Allah matikan (kalimat untuk membuat Mu'awiyah senang).\" Maka Al Miqdam pun berkata, \"Pada hari ini aku tidak akan bisa gembira sehingga aku dapat membuatmu marah, dan akan aku perdengarkan kepadamu sesuatu yang membuatmu benci.\" Kemudian ia berkata, \"Wahai Mu'awiyah! Jika aku benar maka benarkanlah, dan jika aku dusta maka dustakanlah aku.\" Mu'awiyah berkata, \"Akan aku lakukan.\" Al Miqdam lalu berkata, \"Aku bersumpah kepada Allah atas kamu, tidakkah kamu tahu bahwa Rasulullah shallallahu 'alaihi wasallam melarang untuk mengenakan emas?\" Mu'awiyah menjawab, \"Benar.\" Al Miqdam berkata, \"Aku bersumpah kepada Allah atas kamu, tidakkah kamu tahu bahwa Rasulullah shallallahu 'alaihi wasallam melarang mengenakan sutera?\" Mu'awiyah menjawab, \"Benar.\" Al Miqdam berkata, \"Aku bersumpah kepada Allah atas kamu, tidakkah kamu tahu bahwa Rasulullah shallallahu 'alaihi wasallam melarang mengenakan kulit binatang buas dan mengendarainya?\" Mu'awiyah menjawab, \"Benar.\" Al Miqdam berkata, \"Wahai Mu'awiyah, demi Allah semua ini telah aku lihat di rumahmu!\" Al Miqdam berkata, \"Wahai Al Miqdam, aku tahu bahwa aku tidak akan selamat dari kamu.\" Khalid berkata, \"Mu'awiyah memerintahkan (untuk memberikan sesuatu) yang belum pernah ia perintahkan kepada dua sahabatnya, dan ia juga memberikan kepada anak Al Miqdam sebanyak dua ratus (dinar). Maka Al Miqdam membagikannya kepada kawan-kawannya, tetapi ia tidak memberikan kepada Al Asadi sedikit pun dari apa yang ia ambil. Hal ini kemudian dilaporkan kepada Mu'awiyah hingga ia berkata, \"Al Miqdam itu seorang yang mulia lagi dermawan, adapun Al Asadi adalah orang baik tetapi pelit.\""
            },
            {
                "number": 3603,
                "arab": "حَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ أَنَّ يَحْيَى بْنَ سَعِيدٍ وَإِسْمَعِيلَ بْنَ إِبْرَاهِيمَ حَدَّثَاهُمْ الْمَعْنَى عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ أَبِي الْمَلِيحِ بْنِ أُسَامَةَ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ جُلُودِ السِّبَاعِ",
                "id": "Telah menceritakan kepada kami [Musaddad bin Musarhad] bahwa [Yahya bin Sa'id] dan [Isma'il bin Ibrahim] keduanya menceritakan kepada mereka secara makna, dari [Sa'id bin Abu Arubah] dari [Qatadah] dari [Abu Al Malih bin Usamah] dari [Bapaknya] berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang memakai kulit binatang buas.\""
            },
            {
                "number": 3604,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ الْبَزَّازُ حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ قَالَكُنَّا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَقَالَ أَكْثِرُوا مِنْ النِّعَالِ فَإِنَّ الرَّجُلَ لَا يَزَالُ رَاكِبًا مَا انْتَعَلَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah Al Bazzaz] berkata, telah menceritakan kepada kami [Ibnu Abu Az Zinad] dari [Musa bin Uqbah] dari [Abu Az Zubair] dari [Jabir] ia berkata, \"Kami pernah bersama Nabi shallallahu 'alaihi wasallam dalam suatu perjalanan, beliau lalu bersabda: \"Perbanyaklah mengenakan sandal, karena seseorang masih disebut pengendara selama ia mengenakan sandal.\""
            },
            {
                "number": 3605,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ أَنَسٍأَنَّ نَعْلَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ لَهَا قِبَالَانِ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] berkata, telah menceritakan kepada kami [Hammam] dari [Qatadah] dari [Anas] bahwa sandal Nabi shallallahu 'alaihi wasallam mempunyai dua tali (sandal).\""
            },
            {
                "number": 3606,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ أَبُو يَحْيَى أَخْبَرَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ حَدَّثَنَا إِبْرَاهِيمُ بْنُ طَهْمَانَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَنْتَعِلَ الرَّجُلُ قَائِمًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdurrahim Abu Yahya] berkata, telah mengabarkan kepada kami [Abu Ahmad Az Zubairi] berkata, telah menceritakan kepada kami [Ibrahim bin Thahman] dari [Abu Az Zubair] dari [Jabir] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang seorang mengenakan sandal sambil berdiri.\""
            },
            {
                "number": 3607,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَمْشِي أَحَدُكُمْ فِي النَّعْلِ الْوَاحِدَةِ لِيَنْتَعِلْهُمَا جَمِيعًا أَوْ لِيَخْلَعْهُمَا جَمِيعًا",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah salah seorang dari kalian memakai satu sandal. Hendaklah ia memakai semuanya atau melepaskan semuanya.\""
            },
            {
                "number": 3608,
                "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا انْقَطَعَ شِسْعُ أَحَدِكُمْ فَلَا يَمْشِ فِي نَعْلٍ وَاحِدَةٍ حَتَّى يُصْلِحَ شِسْعَهُ وَلَا يَمْشِ فِي خُفٍّ وَاحِدٍ وَلَا يَأْكُلْ بِشِمَالِهِ",
                "id": "Telah menceritakan kepada kami [Abu Al Walid Ath Thayalisi] berkata, telah menceritakan kepada kami [Zuhair] berkata, telah menceritakan kepada kami [Abu Az Zubair] dari [Jabir] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika tali sandal salah seorang dari kalian putus maka janganlah ia berjalan dengan mengenakan satu sandal hingga membetulkannya, dan jangan pula berjalan dengan satu khuf (sepatu, slop), serta jangan makan dengan tangan kiri.\""
            },
            {
                "number": 3609,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا صَفْوَانُ بْنُ عِيسَى حَدَّثَنَا عبْدُ اللَّهِ بْنُ هَارُونَ عَنْ زِيَادِ بْنِ سَعْدٍ عَنْ أَبِي نَهِيكٍ عَنْ ابْنِ عَبَّاسٍ قَالَمِنْ السُّنَّةِ إِذَا جَلَسَ الرَّجُلُ أَنْ يَخْلَعَ نَعْلَيْهِ فَيَضَعَهُمَا بِجَنْبِهِ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] berkata, telah menceritakan kepada kami [Shofwan bin Isa] berkata, telah menceritakan kepada kami [Abdullah bin Harun] dari [Ziyad bin Sa'd] dari [Abu Nahik] dari [Ibnu Abbas] ia berkata, \"Termasuk dari sunah adalah, jika seseorang duduk hendaklah ia melepas kedua sandalnya dan meletakkan di sebelahnya.\""
            },
            {
                "number": 3610,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا انْتَعَلَ أَحَدُكُمْ فَلْيَبْدَأْ بِالْيَمِينِ وَإِذَا نَزَعَ فَلْيَبْدَأْ بِالشِّمَالِ وَلْتَكُنْ الْيَمِينُ أَوَّلَهُمَا يَنْتَعِلُ وَآخِرَهُمَا يَنْزِعُ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian mengenakan sandal hendaklah memulai dari sebelah kanan, jika ingin melepas hendaklah dari sebelah kiri. Maka, jadikanlah sebelah kanan pertama kali saat mengenakan dan terakhir kali saat melepas.\""
            },
            {
                "number": 3611,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ وَمُسلِمُ بْنُ إِبْرَاهِيمَ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ الْأَشْعَثِ بْنِ سُلَيْمٍ عَنْ أَبِيهِ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُحِبُّ التَّيَمُّنَ مَا اسْتَطَاعَ فِي شَأْنِهِ كُلِّهِ فِي طُهُورِهِ وَتَرَجُّلِهِ وَنَعْلِهِ قَالَ مُسْلِمٌ وَسِوَاكِهِ وَلَمْ يَذْكُرْ فِي شَأْنِهِ كُلِّهِقَالَ أَبُو دَاوُد رَوَاهُ عَنْ شُعْبَةَ مُعَاذٌ وَلَمْ يَذْكُرْ سِوَاكَهُ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar] dan [Muslim bin Ibrahim] keduanya berkata; telah menceritakan kepada kami [Syu'bah] dari [Al Asy'ats bin Sulaim] dari [Bapaknya] dari [Masruq] dari ['Aisyah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam senang memulai dari yang sebelah kanan dalam setiap perbuatan yang dilakukannya, semampu mungkin; baik dalam bersuci, menyisir dan memakai sandal.\" Muslim menyebutkan, \"dan dalam bersiwaknya, \" tetapi ia tidak menyebutkan, 'setiap perbuatan yang dilakukannya'. Abu Dawud berkata, \" [Mu'adz] menceritakannya dari [Syu'bah], tetapi ia tidak menyebutkan dalam bersiwaknya'.\""
            },
            {
                "number": 3612,
                "arab": "حَدَّثَنَا النُّفَيْلِيُّ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا لَبِسْتُمْ وَإِذَا تَوَضَّأْتُمْ فَابْدَءُوا بِأَيَامِنِكُمْ",
                "id": "Telah menceritakan kepada kami [An Nufaili] berkata, telah menceritakan kepada kami [Zuhair] berkata, telah menceritakan kepada kami [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika kalian mengenakan (baju) atau berwudhu, maka mulailah dari yang sebelah kanan.\""
            },
            {
                "number": 3613,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ خَالِدٍ الْهَمْدَانِيُّ الرَّمْلِيُّ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ أَبِي هَانِيءٍ عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْحُبُلِيِّ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَذَكَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْفُرُشَ فَقَالَ فِرَاشٌ لِلرَّجُلِ وَفِرَاشٌ لِلْمَرْأَةِ وَفِرَاشٌ لِلضَّيْفِ وَالرَّابِعُ لِلشَّيْطَانِ",
                "id": "Telah menceritakan kepada kami [Yazid bin Khalid Al Hamdani Ar Ramli] berkata, telah menceritakan kepada kami [Ibnu Wahb] dari [Abu Hani`] dari [Abu 'Abdurrahman Al Hubuli] dari [Jabir bin Abdullah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam menyebutkan tentang ranjang tidur, beliau bersabda: \"Satu ranjang untuk seorang laki-laki, satu ranjang untuk wanita, satu ranjang untuk tamu, dan yang keempat adalah untuk setan.\""
            },
            {
                "number": 3614,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا وَكِيعٌ ح و حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْجَرَّاحِ عَنْ وَكِيعٍ عَنْ إِسْرَائِيلَ عَنْ سِمَاكٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَدَخَلْتُ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَيْتِهِ فَرَأَيْتُهُ مُتَّكِئًا عَلَى وِسَادَةٍ زَادَ ابْنُ الْجَرَّاحِ عَلَى يَسَارِهِقَالَ أَبُو دَاوُد رَوَاهُ إِسْحَقُ بْنُ مَنْصُورٍ عَنْ إِسْرَائِيلَ أَيْضًا عَلَى يَسَارِهِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] berkata, telah menceritakan kepada kami [Waki']. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Abdullah Ibnul Jarrah] dari [Waki'] dari [Isra'il] dari [Simak] dari [Jabir bin Samurah] ia berkata, \"Aku masuk menemui Nabi shallallahu 'alaihi wasallam di rumahnya, dan aku melihat beliau duduk bersandar di atas bantal.\" [Ibnul Jarrah] menambahkan, \"Sebelah kirinya.\" Abu Dawud berkata, \" [Ishaq bin Manshur] meriwayatkannya dari [Isra'il] juga dengan lafadz, 'Sebelah kirinya'.\""
            },
            {
                "number": 3615,
                "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ وَكِيعٍ عَنْ إِسْحَقَ بْنِ سَعِيدِ بْنِ عَمْرٍو الْقُرَشِيِّ عَنْ أَبِيهِ عَنْ ابْنِ عُمَرَأَنَّهُ رَأَى رُفْقَةً مِنْ أَهْلِ الْيَمَنِ رِحَالُهُمْ الْأَدَمُ فَقَالَ مَنْ أَحَبَّ أَنْ يَنْظُرَ إِلَى أَشْبَهِ رُفْقَةٍ كَانُوا بِأَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلْيَنْظُرْ إِلَى هَؤُلَاءِ",
                "id": "Telah menceritakan kepada kami [Hannad bin As Sari] dari [Waki'] dari [Ishaq bin Sa'id bin Amru Al Qurasyi] dari [Bapaknya] dari [Ibnu Umar] Bahwasanya ia melihat sekelompok orang-orang Yaman duduk di atas tikar dari kulit. Lalu ia berkata, \"Barangsiapa ingin melihat sekelompok orang seperti para sahabat Nabi shallallahu 'alaihi wasallam, maka lihatlah mereka.\""
            },
            {
                "number": 3616,
                "arab": "حَدَّثَنَا ابْنُ السَّرْحِ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ الْمُنْكَدِرِ عَنْ جَابِرٍ قَالَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَّخَذْتُمْ أَنْمَاطًا قُلْتُ وَأَنَّى لَنَا الْأَنْمَاطُ قَالَ أَمَا إِنَّهَا سَتَكُونُ لَكُمْ أَنْمَاطٌ",
                "id": "Telah menceritakan kepada kami [Ibnu As Sarh] berkata, telah menceritakan kepada kami [Sufyan] dari [Ibnul Munkadir] dari [Jabir] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bertanya kepadaku, \"Apakah kalian memakai permadani? ' Aku menjawab, \"bagaimana boleh kami memakai permadani?\" beliau bersabda: \"Sesungguhnya ia baik untuk kalian.\""
            },
            {
                "number": 3617,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَأَحْمَدُ بْنُ مَنِيعٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْكَانَ وِسَادَةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ابْنُ مَنِيعٍ الَّتِي يَنَامُ عَلَيْهَا بِاللَّيْلِ ثُمَّ اتَّفَقَا مِنْ أَدَمٍ حَشْوُهَا لِيفٌ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] dan [Ahmad bin Mani'] keduanya berkata; telah menceritakan kepada kami [Abu Mu'awiyah] dari [Hisyam bin Urwah] dari [Bapaknya] dari ['Aisyah radliallahu 'anha] ia berkata, \"Bantal Rasulullah shallallahu 'alaihi wasallam, -Ibnu Mani' menyebutkan-, 'yang beliau gunakan untuk tidur di waktu malam' dari kulit dan isinya dari serabut.\""
            },
            {
                "number": 3618,
                "arab": "حَدَّثَنَا أَبُو تَوْبَةَ حَدَّثَنَا سُلَيْمَانُ يَعْنِي ابْنَ حَيَّانَ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْكَانَتْ ضِجْعَةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ أَدَمٍ حَشْوُهَا لِيفٌ",
                "id": "Telah menceritakan kepada kami [Abu Taubah] berkata, telah menceritakan kepada kami [Sulaiman] -maksudnya Sulaiman bin Hayyan- dari [Hisyam] dari [Bapaknya] dari ['Aisyah radliallahu 'anha] ia berkata, \"Tempat tidur Rasulullah shallallahu 'alaihi wasallam terbuat dari kulit dan isinya dari serabut.\""
            },
            {
                "number": 3619,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا خَالِدٌ الْحَذَّاءُ عَنْ أَبِي قِلَابَةَ عَنْ زَيْنَبَ بِنْتِ أُمِّ سَلَمَةَ عَنْ أُمِّ سَلَمَةَ قَالَتْكَانَ فِرَاشُهَا حِيَالَ مَسْجِدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Yazid bin Zurai'] berkata, telah menceritakan kepada kami [Khalid Al Hadzdza`] dari [Abu Qilabah] dari [Zainab binti Ummu Salamah] dari [Ummu Salamah] ia berkata, \"Ranjang Ummu Salamah ada di hadapan masjid Rasulullah shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 3620,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا فُضَيْلُ بْنُ غَزْوَانَ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَى فَاطِمَةَ رَضِيَ اللَّهُ عَنْهَا فَوَجَدَ عَلَى بَابِهَا سِتْرًا فَلَمْ يَدْخُلْ قَالَ وَقَلَّمَا كَانَ يَدْخُلُ إِلَّا بَدَأَ بِهَا فَجَاءَ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُ فَرَآهَا مُهْتَمَّةً فَقَالَ مَا لَكِ قَالَتْ جَاءَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَيَّ فَلَمْ يَدْخُلْ فَأَتَاهُ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ فَاطِمَةَ اشْتَدَّ عَلَيْهَا أَنَّكَ جِئْتَهَا فَلَمْ تَدْخُلْ عَلَيْهَا قَالَ وَمَا أَنَا وَالدُّنْيَا وَمَا أَنَا وَالرَّقْمَ فَذَهَبَ إِلَى فَاطِمَةَ فَأَخْبَرَهَا بِقَوْلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ قُلْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا يَأْمُرُنِي بِهِ قَالَ قُلْ لَهَا فَلْتُرْسِلْ بِهِ إِلَى بَنِي فُلَانٍحَدَّثَنَا وَاصِلُ بْنُ عَبْدِ الْأَعْلَى الْأَسَدِيُّ حَدَّثَنَا ابْنُ فُضَيْلٍ عَنْ أَبِيهِ بِهَذَا الْحَدِيثِ قَالَ وَكَانَ سِتْرًا مَوْشِيًّا",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Ibnu Numair] berkata, telah menceritakan kepada kami [Fudhail bin Ghazwan] dari [Nafi'] dari [Abdullah bin Umar] berkata, \"Rasulullah shallallahu 'alaihi wasallam mendatangi Fatimah radliallahu 'anha dan mendapati di depan pintunya sebuah tirai, sehingga beliau tidak jadi masuk.\" Abdullah bin Umar berkata, \"jarang sekali beliau masuk melainkan menemui Fathimah dahulu, lalu Ali radliallahu 'anhu masuk dan melihat Fatimah dalam keadaan sedih. Maka ia bertanya, \"ada apa denganmu?\" Fathimah menjawab; \"Rasulullah shallallahu 'alaihi wasallam telah datang namun tidak masuk\", maka Ali datang menemui beliau dan berkata; \"Wahai Rasulullah sesungguhnya Fathimah sangat bersedih, karena engkau datang kepadanya namun tidak menemuinya\" Rasulullah shallallahu 'alaihi wasallam bersabda; \"aku tidak mencintai dunia, dan aku tidak menyukai lukisan (gambar).\", lalu Ali pergi menemui Fathimah dan memberitahukan sabda Rasulullah kepadanya, Fathimah berkata; katakan kepada Rasulullah apa yang beliau perintahkan dengan tirai yang berlukis tersebut, Rasulullah shallallahu 'alaihi wasallam bersabda; \"katakan kepadanya agar mengirim tirai berlukis itu kepada Bani Fulan.\", (perawi berkata;) telah menceritakan hadits ini kepada kami [Washil bin Abdul A'la] telah menceritakan kepada kami [Ibnu Fudhail] dari [bapaknya] ia berkata; \"tirai tersebut adalah tirai yang berlukis (bergambar).\""
            },
            {
                "number": 3621,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا أَبَانُ حَدَّثَنَا يَحْيَى حَدَّثَنَا عِمْرَانُ بْنُ حِطَّانَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَاأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ لَا يَتْرُكُ فِي بَيْتِهِ شَيْئًا فِيهِ تَصْلِيبٌ إِلَّا قَضَبَهُ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Aban] berkata, telah menceritakan kepada kami [Yahya] telah menceritakan kepada kami [Imran bin Hithan] dari ['Aisyah radliallahu 'anha] berkata, \"Tidaklah Rasulullah shallallahu 'alaihi wasallam meninggalkan sesuatu yang berbentuk salib di rumahnya kecuali beliau pasti memotongnya.\""
            },
            {
                "number": 3622,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ عَلِيِّ بْنِ مُدْرِكٍ عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ عَنْ عَبْدِ اللَّهِ بْنِ نُجَيٍّ عَنْ أَبِيهِ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَدْخُلُ الْمَلَائِكَةُ بَيْتًا فِيهِ صُورَةٌ وَلَا كَلْبٌ وَلَا جُنُبٌ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar] berkata, telah menceritakan kepada kami [Syu'bah] dari [Ali bin Mudrik] dari [Abu Zur'ah bin Amru bin Jarir] dari [Abdullah bin Nujay] dari [Bapaknya] dari [Ali radliallahu 'anhu] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Malaikat tidak akan masuk ke rumah yang di dalamnya ada gambar, atau anjing, atau orang junub (yang tidak bersuci dari dari junubnya dan menjadikannya kebiasaan).\""
            },
            {
                "number": 3623,
                "arab": "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ أَخْبَرَنَا خَالِدٌ عَنْ سُهَيْلٍ يَعْنِي ابْنَ أَبِي صَالِحٍ عَنْ سَعِيدِ بْنِ يَسَارٍ الْأَنْصَارِيِّ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ عَنْ أَبِي طَلْحَةَ الْأَنْصَارِيِّ قَالَسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تَدْخُلُ الْمَلَائِكَةُ بَيْتًا فِيهِ كَلْبٌ وَلَا تِمْثَالٌ وَقَالَ انْطَلِقْ بِنَا إِلَى أُمِّ الْمُؤْمِنِينَ عَائِشَةَ نَسْأَلْهَا عَنْ ذَلِكَ فَانْطَلَقْنَا فَقُلْنَا يَا أُمَّ الْمُؤْمِنِينَ إِنَّ أَبَا طَلْحَةَ حَدَّثَنَا عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِكَذَا وَكَذَا فَهَلْ سَمِعْتِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَذْكُرُ ذَلِكَ قَالَتْ لَا وَلَكِنْ سَأُحَدِّثُكُمْ بِمَا رَأَيْتُهُ فَعَلَ خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَعْضِ مَغَازِيهِ وَكُنْتُ أَتَحَيَّنُ قُفُولَهُ فَأَخَذْتُ نَمَطًا كَانَ لَنَا فَسَتَرْتُهُ عَلَى الْعَرَضِ فَلَمَّا جَاءَ اسْتَقْبَلْتُهُ فَقُلْتُ السَّلَامُ عَلَيْكَ يَا رَسُولَ اللَّهِ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ الْحَمْدُ لِلَّهِ الَّذِي أَعَزَّكَ وَأَكْرَمَكَ فَنَظَرَ إِلَى الْبَيْتِ فَرَأَى النَّمَطَ فَلَمْ يَرُدَّ عَلَيَّ شَيْئًا وَرَأَيْتُ الْكَرَاهِيَةَ فِي وَجْهِهِ فَأَتَى النَّمَطَ حَتَّى هَتَكَهُ ثُمَّ قَالَ إِنَّ اللَّهَ لَمْ يَأْمُرْنَا فِيمَا رَزَقَنَا أَنْ نَكْسُوَ الْحِجَارَةَ وَاللَّبِنَ قَالَتْ فَقَطَعْتُهُ وَجَعَلْتُهُ وِسَادَتَيْنِ وَحَشَوْتُهُمَا لِيفًا فَلَمْ يُنْكِرْ ذَلِكَ عَلَيَّحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ سُهَيْلٍ بِإِسْنَادِهِ مِثْلِهِ قَالَ فَقُلْتُ يَا أُمَّهْ إِنَّ هَذَا حَدَّثَنِي أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَقَالَ فِيهِ سَعِيدُ بْنُ يَسَارٍ مَوْلَى بَنِي النَّجَّارِ",
                "id": "Telah menceritakan kepada kami [Wahb bin Baqiyyah] berkata, telah mengabarkan kepada kami [Khalid] dari [Suhail] -maksudnya Suhail bin Abu Shalih- dari [Sa'id bin Yasar Al Anshari] dari [Zaid bin Khalid Al Juhani] dari [Abu Thalhah Al Anshari] ia berkata, \"Aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Malaikat tidak akan masuk ke dalam rumah yang di dalamnya terdapat anjing atau patung.\" Zaid bin Khalid berkata, \"Mari kita menemui 'Aisyah Ummul Mukminin untuk bertanya kepadanya tentang hal itu.\" Maka kami berangkat menemui 'Aisyah, kami lalu bertanya, \"Wahai Ummul Mukmini, Abu Thalhah menceritakan kepada kami dari Rasulullah shallallahu 'alaihi wasallam begini dan begini, maka apakah engkau mendengar Nabi shallallahu 'alaihi wasallam mengatakan itu?\" 'Aisyah menjawab, \"Tidak, tetapi akan aku ceritakan kepada kalian apa yang beliau lakukan. Rasulullah shallallahu 'alaihi wasallam pernah keluar dalam salah satu peperangannya, terkadang aku membawa kunci rumah hingga aku dapat mengambil permadani bergambar dan kujadikan sebagai tirai jendela. Ketika beliau datang, aku menyambutnya seraya mengucapkan, 'Wahai Rasulullah, assalaamu 'alaikum warahmatullah wa barakaatuhu. Segala puji bagi Allah yang memuliakan dan mengagungkanmu. Beliau lantas melihat ke arah rumah dan melihat permadani tersebut, beliau tidak menjawab salamku. Dan aku melihat kebencian di wajahnya. Beliau mendatangi permadani itu dan melepaskannya. Kemudian beliau bersabda: \"Allah tidak memerintahkan kepada kita atas apa yang Ia berikan kepada kita untuk memberi pakaian pada batu dan bata.\" 'Aisyah berkata, \"Aku lalu memotong kain tersebut dan menjadikannya dua bantal yang bagian dalamnya aku isi dengan serabut, dan beliau tidak mengingkarinya.\" Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Jarir] dari [Suhail] dengan sanad yang sama. Ia berkata; Aku berkata, \"Wahai ibu ('Aisyah), orang menyampaikan hadits kepadaku, bahwa Rasulullah shallallahu 'alaihi wasallam mengatakan begini dan begini.\" Sa'id bin Yasar mantan budak bani An Najar juga menyebutkan hadits ini. "
            },
            {
                "number": 3624,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ عَنْ بُكَيْرٍ عَنْ بُسْرِ بْنِ سَعِيدٍ عَنْ زَيْدِ بْنِ خَالِدٍ عَنْ أَبِي طَلْحَةَ أَنَّهُ قَالَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الْمَلَائِكَةَ لَا تَدْخُلُ بَيْتًا فِيهِ صُورَةٌقَالَ بُسْرٌ ثُمَّ اشْتَكَى زَيْدٌ فَعُدْنَاهُ فَإِذَا عَلَى بَابِهِ سِتْرٌ فِيهِ صُورَةٌ فَقُلْتُ لِعُبَيْدِ اللَّهِ الْخَوْلَانِيِّ رَبِيبِ مَيْمُونَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَمْ يُخْبِرْنَا زَيْدٌ عَنْ الصُّوَرِ يَوْمَ الْأَوَّلِ فَقَالَ عُبَيْدُ اللَّهِ أَلَمْ تَسْمَعْهُ حِينَ قَالَ إِلَّا رَقْمًا فِي ثَوْبٍ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] berkata, telah menceritakan kepada kami [Al Laits] dari [Bukair] dari [Busr bin Said] dari [Zaid bin Khalid] dari [Abu Thalhah] Bahwasanya ia berkata, 'Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya para malaikat tidak akan masuk ke dalam rumah yang di dalamnya ada gambar.\" Busr berkata, \"Ketika Zaid jatuh sakit kami menjenguknya, sementara di pintunya ada tirai yang bergambar. Maka aku berkata kepada [Ubaidullah Al Khaulani], pembantu Maimunah isteri Nabi shallallahu 'alaihi wasallam, \"Bukankah Zaid telah mengabarkan kepada kita tentang hukum, gambar sejak awal!\" Ubaidullah berkata, \"Tidakkah engkau mendengar ketika ia mengatakan, \"Kecuali gambar ukiran pada kain?\""
            },
            {
                "number": 3625,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ الصَّبَّاحِ أَنَّ إِسْمَعِيلَ بْنَ عَبْدِ الْكَرِيمِ حَدَّثَهُمْ قَالَ حَدَّثَنِي إِبْرَاهِيمُ يَعْنِي ابْنَ عَقِيلٍ عَنْ أَبِيهِ عَنْ وَهْبِ بْنِ مُنَبِّهٍ عَنْ جَابِرٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ عُمَرَ بْنَ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ زَمَنَ الْفَتْحِ وَهُوَ بِالْبَطْحَاءِ أَنْ يَأْتِيَ الْكَعْبَةَ فَيَمْحُوَ كُلَّ صُورَةٍ فِيهَا فَلَمْ يَدْخُلْهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى مُحِيَتْ كُلَّ صُورَةٍ فِيهَا",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ash Shabbah] bahwa [Isma'il bin Abdul Karim] menceritakan kepada mereka, ia berkata; telah menceritakan kepadaku [Ibrahim] -maksudnya Ibrahim bin Aqil- dari [bapaknya] dari [Wahb bin Munabbih] dari [Jabir] bahwa Nabi shallallahu 'alaihi wasallam memerintahkan Umar Ibnul Khaththab radliallahu 'anhu -pada waktu pembukaan (penaklukan) kota Makkah, dan ia berada di daerah Bathha- agar datang ke Ka'bah untuk menghapus semua gambar yang ada di dalamnya. Dan Nabi shallallahu 'alaihi wasallam tidak akan masuk ke dalam Ka'bah hingga semua gambar yang ada di dalamnya telah dihapus.\""
            },
            {
                "number": 3626,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ ابْنِ السَّبَّاقِ عَنْ ابْنِ عَبَّاسٍ قَالَ حَدَّثَتْنِي مَيْمُونَةُ زَوْجُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ جِبْرِيلَ عَلَيْهِ السَّلَام كَانَ وَعَدَنِي أَنْ يَلْقَانِي اللَّيْلَةَ فَلَمْ يَلْقَنِي ثُمَّ وَقَعَ فِي نَفْسِهِ جَرْوُ كَلْبٍ تَحْتَ بِسَاطٍ لَنَا فَأَمَرَ بِهِ فَأُخْرِجَ ثُمَّ أَخَذَ بِيَدِهِ مَاءً فَنَضَحَ بِهِ مَكَانَهُ فَلَمَّا لَقِيَهُ جِبْرِيلُ عَلَيْهِ السَّلَام قَالَ إِنَّا لَا نَدْخُلُ بَيْتًا فِيهِ كَلْبٌ وَلَا صُورَةٌ فَأَصْبَحَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ بِقَتْلِ الْكِلَابِ حَتَّى إِنَّهُ لَيَأْمُرُ بِقَتْلِ كَلْبِ الْحَائِطِ الصَّغِيرِ وَيَتْرُكُ كَلْبَ الْحَائِطِ الْكَبِيرِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] berkata, telah menceritakan kepada kami [Ibnu Wahb] berkata, telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari [Ibnu As Sabbaq] dari [Ibnu Abbas] ia berkata; telah menceritakan kepadaku [Maimunah] isteri Nabi shallallahu 'alaihi wasallam, bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Jibril Alaihis Salam pernah berjanji untuk menemuiku pada waktu malam, tetapi ia tidak datang.\" Kemudian beliau teringat bahwa ada anak anjing berada di bawah permadani milik kami, beliau memerintahkan (agar anjing itu dikeluarkan). Anak anjing itu lalu dikeluarkan, kemudian beliau mengambil air dengan tangannya seraya memercikkan pada bekasnya. Ketika Jibril Alaihis Salam menemui beliau, ia berkata, \"Sesungguhnya kami tidak akan masuk ke dalam rumah yang di dalamnya terdapat anjing atau gambar.\" Setelah itu Nabi shallallahu 'alaihi wasallam memerintahkan untuk membunuh anjing-anjing hingga beliau juga memerintahkan untuk membunuh anjing penjaga kebun yang masih kecil, dan membiarkan anjing penjaga kebun yang sudah besar.\""
            },
            {
                "number": 3627,
                "arab": "حَدَّثَنَا أَبُو صَالِحٍ مَحْبُوبُ بْنُ مُوسَى حَدَّثَنَا أَبُو إِسْحَقَ الْفَزَارِيُّ عَنْ يُونُسَ بْنِ أَبِي إِسْحَقَ عَنْ مُجَاهِدٍ قَالَ حَدَّثَنَا أَبُو هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَانِي جِبْرِيلُ عَلَيْهِ السَّلَام فَقَالَ لِي أَتَيْتُكَ الْبَارِحَةَ فَلَمْ يَمْنَعْنِي أَنْ أَكُونَ دَخَلْتُ إِلَّا أَنَّهُ كَانَ عَلَى الْبَابِ تَمَاثِيلُ وَكَانَ فِي الْبَيْتِ قِرَامُ سِتْرٍ فِيهِ تَمَاثِيلُ وَكَانَ فِي الْبَيْتِ كَلْبٌ فَمُرْ بِرَأْسِ التِّمْثَالِ الَّذِي فِي الْبَيْتِ يُقْطَعُ فَيَصِيرُ كَهَيْئَةِ الشَّجَرَةِ وَمُرْ بِالسِّتْرِ فَلْيُقْطَعْ فَلْيُجْعَلْ مِنْهُ وِسَادَتَيْنِ مَنْبُوذَتَيْنِ تُوطَآَنِ وَمُرْ بِالْكَلْبِ فَلْيُخْرَجْ فَفَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَإِذَا الْكَلْبُ لِحَسَنٍ أَوْ حُسَيْنٍ كَانَ تَحْتَ نَضَدٍ لَهُمْ فَأُمِرَ بِهِ فَأُخْرِجَقَالَ أَبُو دَاوُد وَالنَّضَدُ شَيْءٌ تُوضَعُ عَلَيْهِ الثِّيَابُ شَبَهُ السَّرِيرِ",
                "id": "Telah menceritakan kepada kami [Abu Shalih Mahbub bin Musa] berkata, telah menceritakan kepada kami [Abu Ishaq Al Fazari] dari [Yunus bin Abu Ishaq] dari [Mujahid] ia berkata; telah menceritakan kepada kami [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jibril Alaihis Salam datang menemuiku dan berkata, \"Tadi malam aku datang untuk menemuimu, dan tidak ada yang menghalangiku untuk masuk kecuali patung yang ada di atas pintu. Di dalam rumah juga ada kain satir tipis yang bergambar patung, serta terdapat anjing, maka perintahkanlah memotong kepala patung yang berada di rumah hingga berbentuk pohon, dan perintahkanlah memotong tirai untuk dijadikan dua bantal yang diduduki, dan perintahkanlah untuk mengeluarkan anjing.\" Rasulullah shallallahu 'alaihi wasallam pun melakukan saran Jibril, namun tiba-tiba anjing milik Hasan atau Husain berada di bawah ranjang (rak), maka beliau memerintahkan untuk mengeluarkan hingga ia pun dikeluarkan.\" Abu Dawud berkata, \"An Nadhad adalah sesuatu yang digunakan untuk meletakkan pakaian, semisal ranjang.\""
            }
  ]
}