{
    "kategori": "Kitab Merapikan Rambut",
  "hadits": [
    {
                "number": 3628,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ هِشَامِ بْنِ حَسَّانَ عَنْ الْحَسَنِ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ التَّرَجُّلِ إِلَّا غِبًّا",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Yahya] dari [Hisyam bin Hassan] dari [Al Hasan] dari [Abdullah bin Mughaffal] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang mengurai rambut untuk dibersihkan atau dibaguskan kecuai sesekali saja.\""
            },
            {
                "number": 3629,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا الْجُرَيْرِيُّ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَأَنَّ رَجُلًا مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَحَلَ إِلَى فَضَالَةَ بْنِ عُبَيْدٍ وَهُوَ بِمِصْرَ فَقَدِمَ عَلَيْهِ فَقَالَ أَمَا إِنِّي لَمْ آتِكَ زَائِرًا وَلَكِنِّي سَمِعْتُ أَنَا وَأَنْتَ حَدِيثًا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجَوْتُ أَنْ يَكُونَ عِنْدَكَ مِنْهُ عِلْمٌ قَالَ وَمَا هُوَ قَالَ كَذَا وَكَذَا قَالَ فَمَا لِي أَرَاكَ شَعِثًا وَأَنْتَ أَمِيرُ الْأَرْضِ قَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَنْهَانَا عَنْ كَثِيرٍ مِنْ الْإِرْفَاهِ قَالَ فَمَا لِي لَا أَرَى عَلَيْكَ حِذَاءً قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُنَا أَنْ نَحْتَفِيَ أَحْيَانًا",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali] berkata, telah menceritakan kepada kami [Yazid bin Harun] berkata, telah mengabarkan kepada kami [Al Jurairi] dari [Abdullah bin Buraidah] berkata, \"Seorang laki-laki dari sahabat Nabi shallallahu 'alaihi wasallam berkunjung ke rumah [Fadhalah bin Ubaid] yang berada di Mesir. Ia lalu datang kepadanya seraya berkata, \"Aku datang kepadamu bukan untuk berkunjung, tetapi aku dan kamu sendiri telah mendengar hadits Rasulullah shallallahu 'alaihi wasallam, maka aku berharap engkau mempunyai ilmu tentang itu.\" Fadhalah bertanya, \"Hadits tentang apa itu?\" sahabat Nabi itu menjawab, \"Begini dan begini.\" Fadhalah bertanya, \"Kenapa rambutmu tampak kusut dan berantakan, padahal engkau adalah seorang pemimpin?\" ia menjawab, \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam telah melarang kita untuk bermewah-mewah.\" Fadhalah lalu bertanya lagi, \"Kenapa aku juga melihatmu tidak mengenakan sepatu?\" ia menjawab, \"Nabi shallallahu 'alaihi wasallam memerintahkan untuk berjalan dengan tanpa alas kaki sesekali.\""
            },
            {
                "number": 3630,
                "arab": "حَدَّثَنَا النُّفَيْلِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أُمَامَةَ عَنْ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ عَنْ أَبِي أُمَامَةَ قَالَذَكَرَ أَصْحَابُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا عِنْدَهُ الدُّنْيَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا تَسْمَعُونَ أَلَا تَسْمَعُونَ إِنَّ الْبَذَاذَةَ مِنْ الْإِيمَانِ إِنَّ الْبَذَاذَةَ مِنْ الْإِيمَانِ يَعْنِي التَّقَحُّلَقَالَ أَبُو دَاوُد هُوَ أَبُو أُمَامَةَ بْنُ ثَعْلَبَةَ الْأَنْصَارِيُّ",
                "id": "Telah menceritakan kepada kami [An Nufaili] berkata, telah menceritakan kepada kami [Muhammad bin Salamah] dari [Muhammad bin Ishaq] dari [Abdullah bin Abu Umamah] dari [Abdullah bin Ka'b bin Malik] dari [Abu Umamah] ia berkata, \"Pada suatu hari sahabat Rasulullah shallallahu 'alaihi wasallam memperbincangkan tentang dunia di sisinya, maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidakkah kalian mendengar? Tidakkah kalian mendengar? Sesungguhnya sederhana dalam berpakaian adalah bagian dari iman. Sesungguhnya sederhana dalam berpakaian adalah bagian dari iman.\" Maksudnya adalah berpakaian apa adanya dan pantas.\", Abu Dawud berkata; \"Dia adalah Abu Umamah bin Tsa'labah Al Anshari.\""
            },
            {
                "number": 3631,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ حَدَّثَنَا أَبُو أَحْمَدَ عَنْ شَيْبَانَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُخْتَارِ عَنْ مُوسَى بْنِ أَنَسٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَكَانَتْ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُكَّةٌ يَتَطَيَّبُ مِنْهَا",
                "id": "Telah menceritakan kepada kami [Nashr bin Ali] berkata, telah menceritakan kepada kami [Abu Ahmad] dari [Syaiban bin 'Abdurrahman] dari [Abdullah Ibnul Mukhtar] dari [Musa bin Anas] dari [Anas bin Malik] ia berkata, \"Nabi shallallahu 'alaihi wasallam mempunyai sukkah (minyak terbagus) yang biasa beliau gunakan untuk wewangian.\""
            },
            {
                "number": 3632,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ أَخْبَرَنَا ابْنُ وَهْبٍ حَدَّثَنِي ابْنُ أَبِي الزِّنَادِ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ كَانَ لَهُ شَعْرٌ فَلْيُكْرِمْهُ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Dawud Al mahri] berkata, telah mengabarkan kepada kami [Ibnu Wahb] berkata, telah menceritakan kepadaku [Ibnu Abu Az Zinad] dari [Suhail bin Abu Shalih] dari [Bapaknya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mempunyai rambut hendaklah ia memuliakannya (merawat).\""
            },
            {
                "number": 3633,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عَلِيِّ بْنِ الْمُبَارَكِ قَالَ حَدَّثَتْنِي كَرِيمَةُ بِنْتُ هَمَّامٍأَنَّ امْرَأَةً أَتَتْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا فَسَأَلَتْهَا عَنْ خِضَابِ الْحِنَّاءِ فَقَالَتْ لَا بَأْسَ بِهِ وَلَكِنْ أَكْرَهُهُ كَانَ حَبِيبِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَكْرَهُ رِيحَهُقَالَ أَبُو دَاوُد تَعْنِي خِضَابَ شَعْرِ الرَّأْسِ",
                "id": "Telah menceritakan kepada kami [Ubaidullah bin Umar] berkata, telah menceritakan kepada kami [Yahya bin Sa'id] dari [Ali Ibnul Mubarak] ia berkata; telah menceritakan kepadaku [Karimah binti Hammam] berkata, \"bahwasanya ada seorang wanita yang datang menemui ['Aisyah radliallahu 'anha], lalu ia bertanya kepadanya tentang pewarna dari pacar?\" maka ia menjawab, \"Tidak apa-apa, hanya saja aku tidak menyukainya karena kekasihku, Rasulullah shallallahu 'alaihi wasallam tidak menyukai baunya.\" Abu Dawud berkata, \"Yakni pewarna rambut.\""
            },
            {
                "number": 3634,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَتْنِي غِبْطَةُ بِنْتُ عَمْرٍو الْمُجَاشِعِيَّةُ قَالَتْ حَدَّثَتْنِي عَمَّتِي أُمُّ الْحَسَنِ عَنْ جَدَّتِهَا عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَاأَنَّ هِنْدَ بِنْتَ عُتْبَةَ قَالَتْ يَا نَبِيَّ اللَّهِ بَايِعْنِي قَالَ لَا أُبَايِعُكِ حَتَّى تُغَيِّرِي كَفَّيْكِ كَأَنَّهُمَا كَفَّا سَبُعٍ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] berkata, telah menceritakan kepadaku [Ghibthah binti Amru Al Mujasyi'iyah] ia berkata; telah menceritakan kepadaku bibiku [Ummul Hasan] dari [Neneknya] dari ['Aisyah radliallahu 'anha] bahwa Hind binti Utbah berkata, \"Wahai Nabi Allah, baiatlah aku.\" Beliau bersabda: \"Aku tidak akan membaiatmu hingga kamu mengubah (pewarna) kedua telapak tanganmu, sebab kedua telapak tangannya seperti telapak tangan binatang buas.\""
            },
            {
                "number": 3635,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مُحَمَّدٍ الصُّورِيُّ حَدَّثَنَا خَالِدُ بْنُ عَبْدِ الرَّحْمَنِ حَدَّثَنَا مُطِيعُ بْنُ مَيْمُونٍ عَنْ صَفِيَّةَ بِنْتِ عِصْمَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْأَوْمَتْ امْرَأَةٌ مِنْ وَرَاءِ سِتْرٍ بِيَدِهَا كِتَابٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَبَضَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَهُ فَقَالَ مَا أَدْرِي أَيَدُ رَجُلٍ أَمْ يَدُ امْرَأَةٍ قَالَتْ بَلْ امْرَأَةٌ قَالَ لَوْ كُنْتِ امْرَأَةً لَغَيَّرْتِ أَظْفَارَكِ يَعْنِي بِالْحِنَّاءِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Muhammad Ash Shuri] berkata, telah menceritakan kepada kami [Khalid bin 'Abdurrahman] berkata, telah menceritakan kepada kami [Muthi' bin Maimun] dari [Shafiyah binti Ishmah] dari ['Aisyah radliallahu 'anha] ia berkata, \"Seorang wanita dari balik satir memberikan kitab (Al Qur'an kepada Rasulullah shallallahu 'alaihi wasallam, lalu Nabi shallallahu 'alaihi wasallam memegang tangannya. Beliau bersabda: \"Aku tidak tahu, ini tangan laki-laki atau tangan perempuan?\" Wanita itu menjawab, \"Ini tangan perempuan.\" Beliau bersabda lagi: \"Jika kamu perempuan maka ubahlah warna kulitmu.\" Yaitu dengan pacar. "
            },
            {
                "number": 3636,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِأَنَّهُ سَمِعَ مُعَاوِيَةَ بْنَ أَبِي سُفْيَانَ عَامَ حَجَّ وَهُوَ عَلَى الْمِنْبَرِ وَتَنَاوَلَ قُصَّةً مِنْ شَعْرٍ كَانَتْ فِي يَدِ حَرَسِيٍّ يَقُولُ يَا أَهْلَ الْمَدِينَةِ أَيْنَ عُلَمَاؤُكُمْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَى عَنْ مِثْلِ هَذِهِ وَيَقُولُ إِنَّمَا هَلَكَتْ بَنُو إِسْرَائِيلَ حِينَ اتَّخَذَ هَذِهِ نِسَاؤُهُمْ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik] dari [Ibnu Syihab] dari [Humaid bin 'Abdurrahman] Bahwasanya ia mendengar [Mu'awiyah bin Abu Sufyan] berkata di atas mimbar pada tahun haji -saat itu ia memegang wig yang berada di tangan penjaga, \"Wahai penduduk Madinah, di mana ulama kalian! Aku mendengar Rasulullah shallallahu 'alaihi wasallam melarang dari perkara semacam ini, beliau bersabda: \"Hanyasanya orang-orang bani Isra'il hancur karena wanita-wanita mereka menggunakan barang ini.\""
            },
            {
                "number": 3637,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ وَمُسَدَّدٌ قَالَا حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ قَالَ حَدَّثَنِي نَافِعٌ عَنْ عَبْدِ اللَّهِ قَالَلَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْوَاصِلَةَ وَالْمُسْتَوْصِلَةَ وَالْوَاشِمَةَ وَالْمُسْتَوْشِمَةَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] dan [Musaddad] keduanya berkata; telah menceritakan kepada kami [Yahya] dari [Ubaidullah] ia berkata; telah menceritakan kepadaku [Nafi'] dari [Abdullah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melaknat wanita yang menyambung rambut dan wanita yang minta untuk disambung rambutnya, wanita yang mentato dan wanita yang minta untuk ditato.\""
            },
            {
                "number": 3638,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ الْمَعْنَى قَالَا حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَلَعَنَ اللَّهُ الْوَاشِمَاتِ وَالْمُسْتَوْشِمَاتِ قَالَ مُحَمَّدٌ وَالْوَاصِلَاتِ و قَالَ عُثْمَانُ وَالْمُتَنَمِّصَاتِ ثُمَّ اتَّفَقَا وَالْمُتَفَلِّجَاتِ لِلْحُسْنِ الْمُغَيِّرَاتِ خَلْقَ اللَّهِ عَزَّ وَجَلَّ فَبَلَغَ ذَلِكَ امْرَأَةً مِنْ بَنِي أَسَدٍ يُقَالُ لَهَا أُمُّ يَعْقُوبَ زَادَ عُثْمَانُ كَانَتْ تَقْرَأُ الْقُرْآنَ ثُمَّ اتَّفَقَا فَأَتَتْهُ فَقَالَتْ بَلَغَنِي عَنْكَ أَنَّكَ لَعَنْتَ الْوَاشِمَاتِ وَالْمُسْتَوْشِمَاتِ قَالَ مُحَمَّدٌ وَالْوَاصِلَاتِ و قَالَ عُثْمَانُ وَالْمُتَنَمِّصَاتِ ثُمَّ اتَّفَقَا وَالْمُتَفَلِّجَاتِ قَالَ عُثْمَانُ لِلْحُسْنِ الْمُغَيِّرَاتِ خَلْقَ اللَّهِ تَعَالَى فَقَالَ وَمَا لِي لَا أَلْعَنُ مَنْ لَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ فِي كِتَابِ اللَّهِ تَعَالَى قَالَتْ لَقَدْ قَرَأْتُ مَا بَيْنَ لَوْحَيْ الْمُصْحَفِ فَمَا وَجَدْتُهُ فَقَالَ وَاللَّهِ لَئِنْ كُنْتِ قَرَأْتِيهِ لَقَدْ وَجَدْتِيهِ ثُمَّ قَرَأَ{ وَمَا آتَاكُمْ الرَّسُولُ فَخُذُوهُ وَمَا نَهَاكُمْ عَنْهُ فَانْتَهُوا }قَالَتْ إِنِّي أَرَى بَعْضَ هَذَا عَلَى امْرَأَتِكَ قَالَ فَادْخُلِي فَانْظُرِي فَدَخَلَتْ ثُمَّ خَرَجَتْ فَقَالَ مَا رَأَيْتِو قَالَ عُثْمَانُ فَقَالَتْ مَا رَأَيْتُ فَقَالَ لَوْ كَانَ ذَلِكَ مَا كَانَتْ مَعَنَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa] dan [Utsman bin Abu Syaibah] secara makna, keduanya berkata; telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Ibrahim] dari [Alqamah] dari [Abdullah] ia berkata, \"Allah melaknat wanita yang mentato dan wanita yang minta untuk ditato.\" Muhammad menyebutkan, \"dan wanita yang meyambung rambut.\" Utsman menyebutkan, \"dan wanita yang mencukur bulu alis.\" Dan keduanya sepakat dengan penyebutan, \"dan mengikir gigi untuk kecantikan dengan merubah ciptaan Allah Azza Wa Jalla. Hadits ini kemudian di dengar oleh seorang wanita dari bani Asad yang biasa di panggil dengan nama Ummu Ya'qub, Utsman menambahkan, \"yang sedang membaca Al-Qur'an. Ia lalu mendatangi Abdullah dan berkata, \"Telah sampai kabar kepadaku bahwa engkau melaknat Wanita yang mentato dan wanita yang minta untuk ditato?\" Muhammad menyebutkan, \"dan wanita yang menyambung rambut.\" Utsman menyebutkan, \"dan wanita yang mencukur alis. Kemudian keduanya sepakat dengan penyebutan, \"wanita yang mengikir gigi, Utsman menyebutkan, \"untuk kecantikan dengan merubah ciptaan Allah Ta'ala.\" Ummu Ya'qub berkata, \"Aku telah membaca lembaran-lembaran Al-Qur'an tetapi aku tidak mendapatkannya.\" Abdullah berkata, \"Demi Allah, jika engkau membacanya, sungguh engkau pasti mendapatkannya.\" Kemudian Abdullah membaca: (Apa yang diberikan Rasul kepadamu maka terimalah dia, dan apa yang dilarangnya bagimu maka tinggalkanlah.. (Qs. Al Hasyr: 7).\" Ummu Ya'qub berkata, \"Aku melihat hal ini ada pada isterimu!\" Abdullah berkata, \"Masuk dan lihatlah.\" Ummu Ya'qub kemudian masuk dan keluar lagi. Abdullah berkata, \"Apa yang engkau lihat?\" Utsman berkata (dalam riwayatnya) maka Ummu Ya'qub berkata; \"Aku tidak melihatnya\", Ibnu Mas'ud berkata; \"Jikalau hal itu ada pada istriku niscaya dia tidak akan ada bersama kami.\""
            },
            {
                "number": 3639,
                "arab": "حَدَّثَنَا ابْنُ السَّرْحِ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ أُسَامَةَ عَنْ أَبَانَ بْنِ صَالِحٍ عَنْ مُجَاهِدِ بْنِ جَبْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَلُعِنَتْ الْوَاصِلَةُ وَالْمُسْتَوْصِلَةُ وَالنَّامِصَةُ وَالْمُتَنَمِّصَةُ وَالْوَاشِمَةُ وَالْمُسْتَوْشِمَةُ مِنْ غَيْرِ دَاءٍقَالَ أَبُو دَاوُد وَتَفْسِيرُ الْوَاصِلَةِ الَّتِي تَصِلُ الشَّعْرَ بِشَعْرِ النِّسَاءِ وَالْمُسْتَوْصِلَةُ الْمَعْمُولُ بِهَا وَالنَّامِصَةُ الَّتِي تَنْقُشُ الْحَاجِبَ حَتَّى تُرِقَّهُ وَالْمُتَنَمِّصَةُ الْمَعْمُولُ بِهَا وَالْوَاشِمَةُ الَّتِي تَجْعَلُ الْخِيلَانَ فِي وَجْهِهَا بِكُحْلٍ أَوْ مِدَادٍ وَالْمُسْتَوْشِمَةُ الْمَعْمُولُ بِهَا",
                "id": "Telah menceritakan kepada kami [Ibnu As Sarh] berkata, telah menceritakan kepada kami [Ibnu Wahb] dari [Usamah] dari [Aban bin Shalih] dari [Mujahid bin Jabr] dari [Ibnu Abbas] ia berkata, \"Telah dilaknat wanita yang menyambung rambut dan wanita yang minta untuk disambung rambutnya, wanita yang mencabut alis dan wanita yang minta dicabut alisnya, wanita yang mentato dan wanita yang minta antuk ditato, tanpa ada penyakit.\" Abu Dawud berkata, \"Al Washilah adalah wanita yang menyambung rambutnya dengan rambut wanita (wig). Al Mustaushilat adalah orang yang disambung rambutnya. An Namishat adalah orang yang mencabut alisnya hingga tipis, dan Al Mutanamishat adalah orang yang minta dicabut alisnya. Al Wasyimah adalah orang yang membuat tato di wajahnya baik dengan celak atau tinta, Al Mustausyimah adalah orang yang minta ditato.\""
            },
            {
                "number": 3640,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرِ بْنِ زِيَادٍ قَالَ حَدَّثَنَا شَرِيَكٌ عَنْ سَالِمٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ قَالَلَا بَأْسَ بِالْقَرَامِلِقَالَ أَبُو دَاوُد كَأَنَّهُ يَذْهَبُ إِلَى أَنَّ الْمَنْهِيَّ عَنْهُ شُعُورُ النِّسَاءِ قَالَ أَبُو دَاوُد كَانَ أَحْمَدُ يَقُولُ الْقَرَامِلُ لَيْسَ بِهِ بَأْسٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far bin Ziyad] ia berkata; telah menceritakan kepada kami [Syarik] dari [Salim] dari [Sa'id bin Jubair] ia berkata, \"Benang sutera tidak apa-apa.\" Abu Dawud berkata, \"Seakan-akan ia berpendapat bahwa yang dilarang adalah rambut wanita.\" Abu Dawud berkata, \"Ahmad berkata, \"Benang dari sutera tidak ada masalah (boleh).\""
            },
            {
                "number": 3641,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ وَهَارُونُ بْنُ عَبْدِ اللَّهِ الْمَعْنَى أَنَّ أَبَا عَبْدِ الرَّحْمَنِ الْمُقْرِئَ حَدَّثَهُمْ عَنْ سَعِيدِ بْنِ أَبِي أَيُّوبَ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ عُرِضَ عَلَيْهِ طِيبٌ فَلَا يَرُدَّهُ فَإِنَّهُ طَيِّبُ الرِّيحِ خَفِيفُ الْمَحْمَلِ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali] dan [Harun bin Abdullah] secara makna, bahwa [Abu 'Abdurrahman Al Muqri] menceritakan kepada mereka dari [Sa'id bin Abu Ayyub] dari [Ubaidullah bin Abu Ja'far] dari [Al A'raj] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa ditawari minyak wangi janganlah menolak, karena minyak wangi itu enak aromanya dan ringan membawanya.\""
            },
            {
                "number": 3642,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى أَخْبَرَنَا ثَابِتُ بْنُ عُمَارَةَ حَدَّثَنِي غُنَيْمُ بْنُ قَيْسٍ عَنْ أَبِي مُوسَىعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا اسْتَعْطَرَتْ الْمَرْأَةُ فَمَرَّتْ عَلَى الْقَوْمِ لِيَجِدُوا رِيحَهَا فَهِيَ كَذَا وَكَذَا قَالَ قَوْلًا شَدِيدًا",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Yahya] berkata, telah mengabarkan kepada kami [Tsabit bin Umarah] berkata, telah menceritakan kepadaku [Ghunaim bin Qais] dari [Abu Musa] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika seorang wanita memakai wewangian, lalu sengaja melewati suatu kaum agar mereka mencium baunya, maka ia adalah begini dan begini.\" Beliau mengatakan itu dengan intonasi yang keras.\""
            },
            {
                "number": 3643,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ حَدَّثَنَا سُفْيَانُ عَنْ عَاصِمِ بْنِ عُبَيْدِ اللَّهِ عَنْ عُبَيْدٍ مَوْلَى أَبِي رُهْمٍ عَنْ أَبِي هُرَيْرَةَ قَالَلَقِيَتْهُ امْرَأَةٌ وَجَدَ مِنْهَا رِيحَ الطِّيبِ يَنْفَحُ وَلِذَيْلِهَا إِعْصَارٌ فَقَالَ يَا أَمَةَ الْجَبَّارِ جِئْتِ مِنْ الْمَسْجِدِ قَالَتْ نَعَمْ قَالَ وَلَهُ تَطَيَّبْتِ قَالَتْ نَعَمْ قَالَ إِنِّي سَمِعْتُ حِبِّي أَبَا الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تُقْبَلُ صَلَاةٌ لِامْرَأَةٍ تَطَيَّبَتْ لِهَذَا الْمَسْجِدِ حَتَّى تَرْجِعَ فَتَغْتَسِلَ غُسْلَهَا مِنْ الْجَنَابَةِقَالَ أَبُو دَاوُد الْإِعْصَارُ غُبَارٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] berkata, telah menceritakan kepada kami [Sufyan] dari [Ashim bin Ubaidullah] dari [Ubaid] mantan budak Abu Ruhm, dari [Abu Hurairah] ia berkata, \"Ia bertemu seorang wanita dan mencium bau harum darinya, dan ujung pakaiannya menjuntai (menyapu tanah). Ia lalu berkata, \"Wahai Budak Al Jabbar, apakah engkau datang dari masjid?\" wanita itu menjawab, \"Ya.\" Abu Hurairah bertanya lagi, \"Karena ingin ke masjidkah kamu memakai wewangian?\" wanita itu menjawab, \"Ya.\" Abu Hurairah lalu berkata, \"Sesungguhnya aku mendengar kekasihku, Abu Al Qasim shallallahu 'alaihi wasallam bersabda: \"Tidak akan diterima shalat seorang wanita yang memakai wewangian karena ingin pergi ke masjid ini, sehingga ia kembali dan mandi sebagaimana ia mandi dari junub.\" Abu Dawud berkata, \"Al I'shar maksudnya adalah debu.\""
            },
            {
                "number": 3644,
                "arab": "حَدَّثَنَا النُّفَيْلِيُّ وَسَعِيدُ بْنُ مَنْصُورٍ قَالَا حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ أَبُو عَلْقَمَةَ قَالَ حَدَّثَنِي يَزِيدُ بْنُ خُصَيْفَةَ عَنْ بُسْرِ بْنِ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّمَا امْرَأَةٍ أَصَابَتْ بَخُورًا فَلَا تَشْهَدَنَّ مَعَنَا الْعِشَاءَ قَالَ ابْنُ نُفَيْلٍ عِشَاءَ الْآخِرَةِ",
                "id": "Telah menceritakan kepada kami [An nufaili] dan [Sa'id bin Manshur] keduanya berkata; telah menceritakan kepada kami [Abdullah bin Muhammad Abu Alqamah] ia berkata; telah menceritakan kepadaku [Yazid bin Khushaifah] dari [Busr bin Sa'id] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wanita mana saja yang terkena bakhur (wewangian), maka jangan sekali-kali ia shalat isya bersama kami.\" Ia (perawi) berkata, \"Maksudnya adalah shalat isya yang akhir (larut malam).\""
            },
            {
                "number": 3645,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا عَطَاءٌ الْخُرَاسَانِيُّ عَنْ يَحْيَى بْنِ يَعْمَرَ عَنْ عَمَّارِ بْنِ يَاسِرٍ قَالَقَدِمْتُ عَلَى أَهْلِي لَيْلًا وَقَدْ تَشَقَّقَتْ يَدَايَ فَخَلَّقُونِي بِزَعْفَرَانٍ فَغَدَوْتُ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَلَّمْتُ عَلَيْهِ فَلَمْ يَرُدَّ عَلَيَّ وَلَمْ يُرَحِّبْ بِي وَقَالَ اذْهَبْ فَاغْسِلْ هَذَا عَنْكَ فَذَهَبْتُ فَغَسَلْتُهُ ثُمَّ جِئْتُ وَقَدْ بَقِيَ عَلَيَّ مِنْهُ رَدْعٌ فَسَلَّمْتُ فَلَمْ يَرُدَّ عَلَيَّ وَلَمْ يُرَحِّبْ بِي وَقَالَ اذْهَبْ فَاغْسِلْ هَذَا عَنْكَ فَذَهَبْتُ فَغَسَلْتُهُ ثُمَّ جِئْتُ فَسَلَّمْتُ عَلَيْهِ فَرَدَّ عَلَيَّ وَرَحَّبَ بِي وَقَالَ إِنَّ الْمَلَائِكَةَ لَا تَحْضُرُ جَنَازَةَ الْكَافِرِ بِخَيْرٍ وَلَا الْمُتَضَمِّخَ بِالزَّعْفَرَانِ وَلَا الْجُنُبَ قَالَ وَرَخَّصَ لِلْجُنُبِ إِذَا نَامَ أَوْ أَكَلَ أَوْ شَرِبَ أَنْ يَتَوَضَّأَحَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي عُمَرُ بْنُ عَطَاءِ ابْنِ أَبِي الْخُوَارِ أَنَّهُ سَمِعَ يَحْيَى بْنَ يَعْمَرَ يُخْبِرُ عَنْ رَجُلٍ أَخْبَرَهُ عَنْ عَمَّارِ بْنِ يَاسِرٍ زَعَمَ عُمَرُ أَنَّ يَحْيَى سَمَّى ذَلِكَ الرَّجُلَ فَنَسِيَ عُمَرُ اسْمَهُ أَنَّ عَمَّارًا قَالَ تَخَلَّقْتُ بِهَذِهِ الْقِصَّةِ وَالْأَوَّلُ أَتَمُّ بِكَثِيرٍ فِيهِ ذِكْرُ الْغُسْلِ قَالَ قُلْتُ لِعُمَرَ وَهُمْ حُرُمٌ قَالَ لَا الْقَوْمُ مُقِيمُونَ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Hammad] berkata, telah mengabarkan kepada kami [Atha Al Khurasani] dari [Yahya bin Ya'mar] dari [Ammar bin Yasir] ia berkata, \"Aku kembali ke rumah di waktu yang sudah malam, dan tanganku terlihat pecah-pecah hingga mereka melumuri aku dengan Za'faran (yang berwarna kuning). Aku lalu mendatangi Nabi shallallahu 'alaihi wasallam di waktu pagi, aku mengucapkan salam namun beliau tidak menjawab salam atau menyambutku. Bahkan beliau bersabda: \"Pergi dan bersihkanlah ini darimu.\" Aku lantas pergi dan membersihkan Za'faran tersebut. Kemudian aku mendatangi beliau meskipun masih ada sisa-sisa Za'faran. Aku mengucapkan salam namun beliau tidak menjawab atau menyambutku. Beliau bersabda: \"Bersihkan ini darimu.\" Aku lalu pergi dan membersihkannya. Kemudian aku datang dan mengucapkan salam kepadanya, lalu beliau menjawab atau menyambutku. Beliau lantas bersabda: \"Sesungguhnya malaikat tidak akan datang menghadiri jenazah orang kafir dengan kebaikan, dan pula orang yang melumuri dirinya dengan Za'faran dan orang yang junub.\" Ammar berkata, \"Beliau memberi keringanan kepada orang yang junub jika ingin tidur, atau makan, atau minum cukup dengan berwudhu.\" Telah menceritakan kepada kami [Nashr bin Ali] berkata, telah menceritakan kepada kami [Muhammad bin Bakr] berkata, telah mengabarkan kepada kami [Ibnu Juraij] berkata, telah mengabarkan kepadaku [Umar bin Atha bin Abu Al Khuwar] Bahwasanya ia mendengar [Yahya bin Ya'mar] mengabarkan dari [seorang laki-laki] ia mengabarkan kepadanya dari [Ammar bin Yasir] berkata -Umar berkeyakinan bahwa Yahya menyebut nama laki-laki itu, namun Umar lupa namanya-, \"Aku memakai wewangian…sama seperti hadits ini. namun yang pertama lebih lengkap dan sempurna, sebab disebutkan tentang mandi di dalamnya.\" Ia berkata, \"Aku bertanya kepada Umar, \"Apakah mereka sedang ihram?\" Umar berkata, \"Tidak, mereka sedang menetap di rumah.\""
            },
            {
                "number": 3646,
                "arab": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ الْأَسَدِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ ابْنِ الزُّبَيْرِ الْأَسَدِيُّ حَدَّثَنَا أَبُو جَعْفَرٍ الرَّازِيُّ عَنْ الرَّبِيعِ بْنِ أَنَسٍ عَنْ جَدَّيْهِ قَالَا سَمِعْنَا أَبَا مُوسَى يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَقْبَلُ اللَّهُ تَعَالَى صَلَاةَ رَجُلٍ فِي جَسَدِهِ شَيْءٌ مِنْ خَلُوقٍقَالَ أَبُو دَاوُد جَدَّاهُ زَيْدٌ وَزِيَادٌ",
                "id": "Telah menceritakan kepada kami [Zuhair bin Harb Al Asadi] berkata, telah menceritakan kepada kami [Muhammad bin Abdullah bin Az Zubair Al Asadi] berkata, telah menceritakan kepada kami [Abu Ja'far Ar Razi] dari [Ar Rabi' bin Anas] dari [Kedua kakeknya] keduanya berkata; kami mendengar [Abu Musa] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah Ta'ala tidak menerima shalat seorang laki-laki yang pada tubuhnya Za'faran.\" Abu Dawud berkata, \"Kedua kakeknya adalah [Zaid] dan [Ziyad].\""
            },
            {
                "number": 3647,
                "arab": "حَدَّثَنَا مُسَدَّدٌ أَنَّ حَمَّادَ بْنَ زَيْدٍ وَإِسْمَعِيلَ بْنَ إِبْرَاهِيمَ حَدَّثَاهُمْ عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ عَنْ أَنَسٍ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ التَّزَعْفُرِ لِلرِّجَالِ وَقَالَ عَنْ إِسْمَعِيلَ أَنْ يَتَزَعْفَرَ الرَّجُلُ",
                "id": "Telah menceritakan kepada kami [Musaddad] bahwa [Hammad bin Zaid] dan [Isma'il bin Ibrahim] keduanya menceritakan kepada mereka dari [Abdul Aziz bin Shuhaib] dari [Anas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang penggunakan Za'faran untuk laki-laki.\""
            },
            {
                "number": 3648,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ الْأُوَيْسِيُّ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ عَنْ ثَوْرِ بْنِ زَيْدٍ عَنْ الْحَسَنِ بْنِ أَبِي الْحَسَنِ عَنْ عَمَّارِ بْنِ يَاسِرٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ثَلَاثَةٌ لَا تَقْرَبُهُمْ الْمَلَائِكَةُ جِيفَةُ الْكَافِرِ وَالْمُتَضَمِّخُ بِالْخَلُوقِ وَالْجُنُبُ إِلَّا أَنْ يَتَوَضَّأَ",
                "id": "Telah menceritakan kepada kami [Harun bin Abdullah] berkata, telah menceritakan kepada kami [Abdul Aziz bin Abdullah Al Uwaisi] berkata, telah menceritakan kepada kami [Sulaiman bin Bilal] dari [Tsaur bin Zaid] dari [Al Hasan bin Abu Al Hasan] dari [Ammar bin Yasir] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tiga kelompok yang tidak akan didekati oleh malaikat; bangkai orang kafir, orang yang berlebihan dalam menggunakan wewangian dan orang junub kecuali jika ia berwudhu.\""
            },
            {
                "number": 3649,
                "arab": "حَدَّثَنَا أَيُّوبُ بْنُ مُحَمَّدٍ الرَّقِّيُّ حَدَّثَنَا عُمَرُ بْنُ أَيُّوبَ عَنْ جَعْفَرِ بْنِ بُرْقَانَ عَنْ ثَابِتِ بْنِ الْحَجَّاجِ عَنْ عَبْدِ اللَّهِ الْهَمْدَانِيِّ عَنْ الْوَلِيدِ بْنِ عُقْبَةَ قَالَلَمَّا فَتَحَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَكَّةَ جَعَلَ أَهْلُ مَكَّةَ يَأْتُونَهُ بِصِبْيَانِهِمْ فَيَدْعُو لَهُمْ بِالْبَرَكَةِ وَيَمْسَحُ رُءُوسَهُمْ قَالَ فَجِيءَ بِي إِلَيْهِ وَأَنَا مُخَلَّقٌ فَلَمْ يَمَسَّنِي مِنْ أَجْلِ الْخَلُوقِ",
                "id": "Telah menceritakan kepada kami [Ayyub bin Muhammad Ar Raqqi] berkata, telah menceritakan kepada kami [Umar bin Ayyub] dari [Ja'far bin Burqan] dari [Tsabit Ibnul Hajjaj] dari [Abdullah Al Hamdani] dari [Al Walid bin Uqbah] ia berkata, \"Ketika Nabi Allah shallallahu 'alaihi wasallam membuka kota Makkah, penduduk Makkah datang kepada beliau dengan membawa anak-anak mereka, lalu beliau mendoakan keberkahan bagi mereka dan mengusap kepala mereka.\" Al Walid berkata, \"Aku lalu dibawa menghadap beliau sementara aku penuh dengan Za'faran, maka beliau pun tidak mengusapku karena alasan Za'faran tersebut.\""
            },
            {
                "number": 3650,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ بْنِ مَيْسَرَةَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ حَدَّثَنَا سَلْمٌ الْعَلَوِيُّ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَجُلًا دَخَلَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْهِ أَثَرُ صُفْرَةٍ وَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَلَّمَا يُوَاجِهُ رَجُلًا فِي وَجْهِهِ بِشَيْءٍ يَكْرَهُهُ فَلَمَّا خَرَجَ قَالَ لَوْ أَمَرْتُمْ هَذَا أَنْ يَغْسِلَ هَذَا عَنْهُ",
                "id": "Telah menceritakan kepada kami [Ubaidullah bin Umar bin Maisarah] berkata, telah menceritakan kepada kami [Hammad bin Zaid] berkata, telah menceritakan kepada kami [Salm Al 'Alawi] dari [Anas bin Malik] berkata, \"Seorang laki-laki masuk menemui Rasulullah shallallahu 'alaihi wasallam, sementara pada dirinya terdapat sisa-sisa warna kuning (Za'faran). Dan jarang sekali Nabi shallallahu 'alaihi wasallam menemui seseorang dengan wajah yang kurang senang karena sesuatu, maka ketika keluar beliau bersabda: \"Sekiranya kalian suruh orang ini untuk membersihkan dirinya dari sisa-sisa warna kuning.\""
            },
            {
                "number": 3651,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ وَمُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ أَبِي إِسْحَقَ عَنْ الْبَرَاءِ قَالَمَا رَأَيْتُ مِنْ ذِي لِمَّةٍ أَحْسَنَ فِي حُلَّةٍ حَمْرَاءَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَادَ مُحَمَّدُ بْنُ سُلَيْمَانَ لَهُ شَعْرٌ يَضْرِبُ مَنْكِبَيْهِقَالَ أَبُو دَاوُد كَذَا رَوَاهُ إِسْرَائِيلُ عَنْ أَبِي إِسْحَقَ قَالَ يَضْرِبُ مَنْكِبَيْهِ و قَالَ شُعْبَةُ يَبْلُغُ شَحْمَةَ أُذُنَيْهِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dan [Muhammad bin Sulaiman Al Anbari] keduanya berkata; telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Abu Ishaq] dari [Al Bara] ia berkata, \"Aku belum pernah melihat seseorang berambut panjang yang lebih bagus ketika mengenakan pakaian berwarna merah melebihi Rasulullah shallallahu 'alaihi wasallam.\" [Muhammad bin Sulaiman] menambahkan, \"Beliau mempunyai rambut hingga kedua bahu.\" Abu Dawud berkata, \"Demikian [Isra'il] meriwayatkannya dari [Abu Ishaq], ia berkata, \"(Rambutnya) Hingga kedua pundaknya.\" Sementara Syu'bah menceritakan, \"Hingga daun telinga.\""
            },
            {
                "number": 3652,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ عَنْ الْبَرَاءِ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَهُ شَعْرٌ يَبْلُغُ شَحْمَةَ أُذُنَيْهِ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar] berkata, telah menceritakan kepada kami [Syu'bah] dari [Abu Ishaq] dari [Al Bara] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam mempunyai rambut yang panjangnya hingga daun telinga.\""
            },
            {
                "number": 3653,
                "arab": "حَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ ثَابِتٍ عَنْ أَنَسٍ قَالَكَانَ شَعْرُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى شَحْمَةِ أُذُنَيْهِ",
                "id": "Telah menceritakan kepada kami [Makhlad bin Khalid] berkata, telah menceritakan kepada kami [Abdurrazaq] berkata, telah mengabarkan kepada kami [Ma'mar] dari [Tsabit] dari [Anas] ia berkata, \"Rambut Rasulullah shallallahu 'alaihi wasallam panjangnya hingga dua daun telinga.\""
            },
            {
                "number": 3654,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا إِسْمَعِيلُ أَخْبَرَنَا حُمَيْدٌ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَكَانَ شَعْرُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى أَنْصَافِ أُذُنَيْهِ",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Isma'il] berkata, telah mengabarkan kepada kami [Humaid] dari [Anas bin Malik] ia berkata, \"Rambut Rasulullah shallallahu 'alaihi wasallam panjangnya hingga pertengahan daun telinganya.\""
            },
            {
                "number": 3655,
                "arab": "حَدَّثَنَا ابْنُ نُفَيْلٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي الزِّنَادِ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْكَانَ شَعْرُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَوْقَ الْوَفْرَةِ وَدُونَ الْجُمَّةِ",
                "id": "Telah menceritakan kepada kami [Ibnu Nufail] berkata, telah menceritakan kepada kami ['Abdurrahman bin Abu Az Zinad] dari [Hisyam bin Urwah] dari [Bapaknya] dari ['Aisyah] ia berkata, \"Rambut Rasulullah shallallahu 'alaihi wasallam panjangnya melebihi daun telinga tetapi belum sampai kedua pundaknya.\""
            },
            {
                "number": 3656,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ أَخْبَرَنِي ابْنُ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ ابْنِ عَبَّاسٍ قَالَكَانَ أَهْلُ الْكِتَابِ يَعْنِي يَسْدِلُونَ أَشْعَارَهُمْ وَكَانَ الْمُشْرِكُونَ يَفْرُقُونَ رُءُوسَهُمْ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تُعْجِبُهُ مُوَافَقَةُ أَهْلِ الْكِتَابِ فِيمَا لَمْ يُؤْمَرْ بِهِ فَسَدَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَاصِيَتَهُ ثُمَّ فَرَقَ بَعْدُ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Ibrahim bin Sa'd] berkata, telah mengabarkan kepadaku [Ibnu Syihab] dari [Ubaidullah bin Abdullah bin Utbah] dari [Ibnu Abbas] ia berkata, \"orang-orang ahli kitab biasa mengurai rambutnya dan orang-orang musyrik biasa membelah rambut kepada mereka menjadi dua bagian. Sedangkan Rasulullah shallallahu 'alaihi wasallam lebih senang menyamai orang-orang ahli kitab pada hal-hal yang tidak ada perintahnya. Maka Rasulullah shallallahu 'alaihi wasallam pun mengurai rambutnya bagian depan, kemudian membelahnya setelah itu.\""
            },
            {
                "number": 3657,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ خَلَفٍ حَدَّثَنَا عَبْدُ الْأَعْلَى عَنْ مُحَمَّدٍ يَعْنِي ابْنَ إِسْحَقَ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ جَعْفَرِ بْنِ الزُّبَيْرِ عَنْ عُرْوَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْكُنْتُ إِذَا أَرَدْتُ أَنْ أَفْرُقَ رَأْسَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَدَعْتُ الْفَرْقَ مِنْ يَافُوخِهِ وَأُرْسِلُ نَاصِيَتَهُ بَيْنَ عَيْنَيْهِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Khalaf] berkata, telah menceritakan kepada kami [Abdul A'la] dari [Muhammad] -yaitu Ibnu Ishaq- ia berkata; telah menceritakan kepadaku [Muhammad bin Ja'far bin Az Zubair] dari [Urwah] dari ['Aisyah radliallahu 'anha] ia berkata, \"Jika aku ingin membelah (menyisir) rambut Rasulullah shallallahu 'alaihi wasallam, maka aku memulainya dari ubun-ubun dan mengurai rambut bagian depan antara dua matanya.\""
            },
            {
                "number": 3658,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ وَسُفْيَانُ بْنُ عُقْبَةَ السُّوَائِيُّ هُوَ أَخُو قَبِيصَةَ وَحُمَيْدُ بْنُ خُوَارٍ عَنْ سُفْيَانَ الثَّوْرِيِّ عَنْ عَاصِمِ بْنِ كُلَيْبٍ عَنْ أَبِيهِ عَنْ وَائِلِ بْنِ حُجْرٍ قَالَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلِي شَعْرٌ طَوِيلٌ فَلَمَّا رَآنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ذُبَابٌ ذُبَابٌ قَالَ فَرَجَعْتُ فَجَزَزْتُهُ ثُمَّ أَتَيْتُهُ مِنْ الْغَدِ فَقَالَ إِنِّي لَمْ أَعْنِكَ وَهَذَا أَحْسَنُ",
                "id": "Telah menceritakan kepada kami [Muhammad Ibnul 'Ala] berkata, telah menceritakan kepada kami [Mu'awiyah bin Hisyam] dan [Sufyan bin Uqbah As Suwa`i] -ia adalah saudara Qabishah dan [Humaid bin Khuwar] - dari [Sufyan Ats Tsauri] dari [Ashim bin Kulaib] dari [Bapaknya] dari [Wail bin Hujr] ia berkata, \"Aku mendatangi Nabi shallallahu 'alaihi wasallam, sementara aku mempunyai rambut yang panjang. Ketika Rasulullah shallallahu 'alaihi wasallam melihatku beliau bersabda: \"Lalat, lalat.\" Wail bin Hujr berkata, \"Maka aku kembali pulang dan memangkasnya, setelah itu aku mendatangi beliau pada keesokan harinya. Beliau bersabda: \"Sesungguhnya aku tidak bermaksud untuk menjelekkanmu namun ini (sekarang) lebih baik.\""
            },
            {
                "number": 3659,
                "arab": "حَدَّثَنَا النُّفَيْلِيُّ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ أَبِي نَجِيحٍ عَنْ مُجَاهِدٍ قَالَ قَالَتْ أُمُّ هَانِئٍقَدِمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى مَكَّةَ وَلَهُ أَرْبَعُ غَدَائِرَ تَعْنِي عَقَائِصَ",
                "id": "Telah menceritakan kepada kami [An Nufaili] berkata, telah menceritakan kepada kami [Sufyan] dari [Ibnu Abu Najih] dari [Mujahid] ia berkata; [Ummu Hani] berkata, \"Nabi shallallahu 'alaihi wasallam datang ke Makkah, dan saat itu beliau mempunyai empat kepangan.\""
            },
            {
                "number": 3660,
                "arab": "حَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ وَابْنُ الْمُثَنَّى قَالَا حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ حَدَّثَنَا أَبِي قَالَ سَمِعْتُ مُحَمَّدَ بْنَ أَبِي يَعْقُوبَ يُحَدِّثُ عَنْ الْحَسَنِ بْنِ سَعْدٍ عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمْهَلَ آلَ جَعْفَرٍ ثَلَاثًا أَنْ يَأْتِيَهُمْ ثُمَّ أَتَاهُمْ فَقَالَ لَا تَبْكُوا عَلَى أَخِي بَعْدَ الْيَوْمِ ثُمَّ قَالَ ادْعُوا لِي بَنِي أَخِي فَجِيءَ بِنَا كَأَنَّا أَفْرُخٌ فَقَالَ ادْعُوا لِي الْحَلَّاقَ فَأَمَرَهُ فَحَلَقَ رُءُوسَنَا",
                "id": "Telah menceritakan kepada kami [Uqbah bin Mukram] dan [Ibnu Al Mutsanna] keduanya berkata; telah menceritakan kepada kami [Wahb bin Jarir] berkata, telah menceritakan kepada kami [Bapakku] ia berkata, \"Aku mendengar [Muhammad bin Abu Ya'qub] ia menceritakan dari [Al Hasan bin Sa'd] dari [Abdullah bin Ja'far] berkata, \"Nabi shallallahu 'alaihi wasallam memberi tenggang waktu untuk keluarga Ja'far selama tiga hari, setelah itu beliau datang kepada mereka dan bersabda: \"Setelah ini, janganlah kalian menangisi saudaraku.\" Setelah itu beliau bersabda: \"Undanglah kemari bani saudaraku.\" kami lalu dihadapkan kepada beliau layaknya anak-anak ayam, beliau lantas bersabda: \"Panggilkan tukang cukur kepadaku.\" Beliau lalu memerintah tukang tukur itu (untuk mencukur), hingga kami semua dicukur olehnya.\""
            },
            {
                "number": 3661,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عُثْمَانُ بْنُ عُثْمَانَ قَالَ أَحْمَدُ كَانَ رَجُلًا صَالِحًا قَالَ أَخْبَرَنَا عُمَرُ بْنُ نَافِعٍ عَنْ أَبِيهِ عَنْ ابْنِ عُمَرَ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْقَزَعِ وَالْقَزَعُ أَنْ يُحْلَقَ رَأْسُ الصَّبِيِّ فَيُتْرَكَ بَعْضُ شَعْرِهِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] berkata, telah menceritakan kepada kami [Utsman bin Utsman] -Ahmad berkata; ia adalah seorang laki-laki yang shalih- ia berkata; telah mengabarkan kepada kami [Umar bin Nafi'] dari [Bapaknya] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang Al Qaza', Al Qaza' adalah kepala anak kecil yang dicukur sebagiannya dan dibiarkan sebagian.\""
            },
            {
                "number": 3662,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ حَدَّثَنَا أَيُّوبُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْقَزَعِ وَهُوَ أَنْ يُحْلَقَ رَأْسُ الصَّبِيِّ فَتُتْرَكَ لَهُ ذُؤَابَةٌ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Hammad] berkata, telah menceritakan kepada kami [Ayyub] dari [Nafi'] dari [Ibnu Umar] berkata, \"Nabi shallallahu 'alaihi wasallam melarang Al Qaza'. Yaitu mencukur kepala anak kecil dengan menyisakan sedikit (dikepang).\""
            },
            {
                "number": 3663,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى صَبِيًّا قَدْ حُلِقَ بَعْضُ شَعْرِهِ وَتُرِكَ بَعْضُهُ فَنَهَاهُمْ عَنْ ذَلِكَ وَقَالَ احْلِقُوهُ كُلَّهُ أَوْ اتْرُكُوهُ كُلَّهُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] berkata, telah menceritakan kepada kami [Abdurrazaq] berkata, telah menceritakan kepada kami [Ma'mar] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar] berkata, \"Nabi shallallahu 'alaihi wasallam melihat melihat anak kecil yang rambutnya dicukur sebagian dan disisakan sebagian, lalu beliau melarang hal itu. Beliau bersabda: \"Cukurlah semua atau sisakan semua.\""
            },
            {
                "number": 3664,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ عَنْ مَيْمُونِ بْنِ عَبْدِ اللَّهِ عَنْ ثَابِتٍ الْبُنَانِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَكَانَتْ لِي ذُؤَابَةٌ فَقَالَتْ لِي أُمِّي لَا أَجُزُّهَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمُدُّهَا وَيَأْخُذُ بِهَا",
                "id": "Telah menceritakan kepada kami [Muhammad Ibnul 'Ala] berkata, telah menceritakan kepada kami [Zaid Ibnul Hubab] dari [Maimun bin Abdullah] dari [Tsabit Al Bunani] dari [Anas bin Malik] ia berkata, \"Aku mempunyai jambul. Ibuku lalu berkata kepadaku, \"Aku tidak akan memotongnya, Rasulullah shallallahu 'alaihi wasallam biasa memanjangkan dan memegangnya.\""
            },
            {
                "number": 3665,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا الْحَجَّاجُ بْنُ حَسَّانَ قَالَ دَخَلْنَا عَلَى أَنَسِ بْنِ مَالِكٍ فَحَدَّثَتْنِي أُخْتِي الْمُغِيرَةُ قَالَتْوَأَنْتَ يَوْمَئِذٍ غُلَامٌ وَلَكَ قَرْنَانِ أَوْ قُصَّتَانِ فَمَسَحَ رَأْسَكَ وَبَرَّكَ عَلَيْكَ وَقَالَ احْلِقُوا هَذَيْنِ أَوْ قُصُّوهُمَا فَإِنَّ هَذَا زِيُّ الْيَهُودِ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali] berkata, telah menceritakan kepada kami [Yazid bin Harun] berkata, telah menceritakan kepada kami [Al Hajjaj bin Hassan] ia berkata; Kami masuk menemui [Anas bin Malik], lalu [saudara pererempuan Al Mughirah] menceritakan kepadaku, ia berkata, \"Dahulu kamu masih bocah, dan kamu mempunyai dua tanduk (jambul), lalu Anas mengusap kepalamu dan mendoakan keberkahan untukmu. Ia lalu berkata, \"cukurlah atau pangkaslah dua jambul ini, karena ini adalah hiasan orang-orang yahudi.\""
            },
            {
                "number": 3666,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَيَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْفِطْرَةُ خَمْسٌ أَوْ خَمْسٌ مِنْ الْفِطْرَةِ الْخِتَانُ وَالِاسْتِحْدَادُ وَنَتْفُ الْإِبِطِ وَتَقْلِيمُ الْأَظْفَارِ وَقَصُّ الشَّارِبِ",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Sa'id] dari [Abu Hurairah] dan sampai kepada Nabi shallallahu 'alaihi wasallam, \"Fitrah (suci) itu ada pada lima hal, atau ada lima hal dari fitrah; khitan, mencukur bulu kemaluan, mencabut bulu ketiak, memotong kuku dan mencukur kumis.\""
            },
            {
                "number": 3667,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ أَبِي بَكْرِ بْنِ نَافِعٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِإِحْفَاءِ الشَّوَارِبِ وَإِعْفَاءِ اللِّحَى",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah Al Qa'nabi] dari [Malik] dari [Abu Bakr bin Nafi'] dari [Bapaknya] dari [Abdullah bin Umar] berkata, \"Rasulullah shallallahu 'alaihi wasallam memerintahkan mencukur kumis dan membiarkan janggut.\""
            },
            {
                "number": 3668,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا صَدُقَةُ الدَّقِيقِيُّ حَدَّثَنَا أَبُو عِمْرَانَ الْجَوْنِيُّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَوَقَّتَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَلْقَ الْعَانَةِ وَتَقْلِيمَ الْأَظْفَارِ وَقَصَّ الشَّارِبِ وَنَتْفَ الْإِبِطِ أَرْبَعِينَ يَوْمًا مَرَّةًقَالَ أَبُو دَاوُد رَوَاهُ جَعْفَرُ بْنُ سُلَيْمَانَ عَنْ أَبِي عِمْرَانَ عَنْ أَنَسٍ لَمْ يَذْكُرْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وُقِّتَ لَنَا وَهَذَا أَصَحُّ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] berkata, telah menceritakan kepada kami [Shadaqah Ad Daqiqi] berkata, telah menceritakan kepada kami [Abu Imran Al Jauni] dari [Anas bin Malik] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam memberi waktu kita untuk mencukur bulu kemaluan, memotong kuku, mencukur kumis dan mencabut bulu ketiak selama empat puluh hari sekali.\" Abu Dawud berkata \" [Ja'far bin Sulaiman] menceritakannya dari [Abu Imran], dari [Anas]. Namun ia tidak menyebut Nabi shallallahu 'alaihi wasallam. Ia berkata, \"Kami diberi waktu…\", dan ini yang benar. "
            },
            {
                "number": 3669,
                "arab": "حَدَّثَنَا ابْنُ نُفَيْلٍ حَدَّثَنَا زُهَيْرٌ قَرَأْتُ عَلَى عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ وَقَرَأَهُ عَبْدُ الْمَلِكِ عَلَى أَبِي الزُّبَيْرِ وَرَوَاهُ أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَكُنَّا نُعْفِي السِّبَالَ إِلَّا فِي حَجٍّ أَوْ عُمْرَةٍقَالَ أَبُو دَاوُد الِاسْتِحْدَادُ حَلْقُ الْعَانَةِ",
                "id": "Telah menceritakan kepada kami [Ibnu Nufail] berkata, telah menceritakan kepada kami [Zuhair] aku membaca di hadapan [Abdul Malik bin Abu Sualiman] dan Abdul Malik membacanya di hadapan [Abu Az Zubair] dan Abu Az Zubair meriwayatkannya dari [Jabir] ia berkata, \"Kami membiarkan Sibal (bulu janggut yang panjang hingga dada) kecuali pada saat haji dan umrah.\" Abu Dawud berkata, \"Al Istihdad artinya adalah mencukur bulu kemaluan.\""
            },
            {
                "number": 3670,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى ح و حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا سُفْيَانُ الْمَعْنَى عَنْ ابْنِ عَجْلَانَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَنْتِفُوا الشَّيْبَ مَا مِنْ مُسْلِمٍ يَشِيبُ شَيْبَةً فِي الْإِسْلَامِ قَالَ عَنْ سُفْيَانَ إِلَّا كَانَتْ لَهُ نُورًا يَوْمَ الْقِيَامَةِ وَقَالَ فِي حَدِيثِ يَحْيَى إِلَّا كَتَبَ اللَّهُ لَهُ بِهَا حَسَنَةً وَحَطَّ عَنْهُ بِهَا خَطِيئَةً",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Yahya]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Sufyan] secara makna, dari [Ibnu 'Ajlan] dari [Amru bin Syu'aib] dari [Bapaknya] dari [Kakeknya] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian mencabut uban, tidaklah seorang muslim tumbuh uban padanya dalam Islam -disebutkan oleh Sufyan dalam riwayatnya- \"Kecuali ia akan menjadi cahaya baginya pada hari kiamat.\" Dalam riwayat lain (oleh Yahya) disebutkan, \"Kecuali dengannya Allah akan menuliskan satu kebaikan dan dihapuskan darinya satu dosa.\""
            },
            {
                "number": 3671,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ وَسُلَيْمَانَ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَيَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الْيَهُودَ وَالنَّصَارَى لَا يَصْبُغُونَ فَخَالِفُوهُمْ",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Abu Salamah] dan [Sulaiman bin Yasar] dari [Abu Hurairah] dan sampai kepada Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya orang-orang Yahudi dan Nashara tidak mencelup (menyemir rambut), maka selisihilah mereka.\""
            },
            {
                "number": 3672,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ وَأَحْمَدُ بْنُ سَعِيدٍ الْهَمْدَانِيُّ قَالَا حَدَّثَنَا ابْنُ وَهْبٍ حَدَّثَنَا ابْنُ جُرَيْجٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَأُتِيَ بِأَبِي قُحَافَةَ يَوْمَ فَتْحِ مَكَّةَ وَرَأْسُهُ وَلِحْيَتُهُ كَالثَّغَامَةِ بَيَاضًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَيِّرُوا هَذَا بِشَيْءٍ وَاجْتَنِبُوا السَّوَادَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Amru bin As Sarh] dan [Ahmad bin Sa'id Al Hamdani] keduanya berkata; telah menceritakan kepada kami [Ibnu Wahb] berkata, telah menceritakan kepada kami [Ibnu Juraij] dari [Abu Az Zubair] dari [Jabir bin Abdullah] ia berkata, \"Pada saat pembukaan kota Makkah, Abu Kuhafah dihadapkan kepada Rasulullah, sementara rambut dan janggutnya putih seperti bunga berwarna putih, maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Rubahlah warna rambutmu ini dengan sesuatu, dan jauhilah warna hitam.\""
            },
            {
                "number": 3673,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ سَعِيدٍ الْجُرَيْرِيِّ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ أَبِي الْأَسْوَدِ الدِّيْلِيِّ عَنْ أَبِي ذَرٍّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَحْسَنَ مَا غُيِّرَ بِهِ هَذَا الشَّيْبُ الْحِنَّاءُ وَالْكَتَمُ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali] berkata, telah menceritakan kepada kami [Abdurrazaq] berkata, telah menceritakan kepada kami [Ma'mar] dari [Sa'id Al Jurairi] dari [Abdullah bin Buraidah] dari [Abu Al Aswad Ad dili] dari [Abu Dzar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya yang paling baik untuk mengubah warna uban ini adalah pacar dan Al Katam (sejenis pacar).\""
            },
            {
                "number": 3674,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا عُبَيْدُ اللَّهِ يَعْنِي ابْنَ إِيَادٍ قَالَ حَدَّثَنَا إِيَادٌ عَنْ أَبِي رِمْثَةَ قَالَانْطَلَقْتُ مَعَ أَبِي نَحْوَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِذَا هُوَ ذُو وَفْرَةٍ بِهَا رَدْعُ حِنَّاءٍ وَعَلَيْهِ بُرْدَانِ أَخْضَرَانِحَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا ابْنُ إِدْرِيسَ قَالَ سَمِعْتُ ابْنَ أَبْجَرَ عَنْ إِيَادِ بْنِ لَقِيطٍ عَنْ أَبِي رِمْثَةَ فِي هَذَا الْخَبَرِ قَالَ فَقَالَ لَهُ أَبِي أَرِنِي هَذَا الَّذِي بِظَهْرِكَ فَإِنِّي رَجُلٌ طَبِيبٌ قَالَ اللَّهُ الطَّبِيبُ بَلْ أَنْتَ رَجُلٌ رَفِيقٌ طَبِيبُهَا الَّذِي خَلَقَهَا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus] berkata, telah menceritakan kepada kami [Ubaidullah] - maksudnya Ubaidullah bin Had- ia berkata; telah menceritakan kepada kami [Iyad] dari [Abu Rimtsah] ia berkata, \"Aku bersama bapakku pergi menemui Nabi shallallahu 'alaihi wasallam, dan ternyata rambut beliau panjangnya hingga daun telinga yang diberi warna dengan daun pacar, dan beliau mengenakan dua kain berwarna hijau.\" Telah menceritakan kepada kami [Muhammad Ibnul 'Ala] berkata, telah menceritakan kepada kami [Ibnu Idris] ia berkata; Aku mendengar [Ibnu Abjar] dari [Iyad bin Laqith] dari [Abu Rimtsah] berkenaan dengan kabar ini. Ia (perawi) berkata; Lalu bapakku berkata kepadanya, \"Perlihatkanlah kepadaku apa yang ada di punggungmu, karena aku adalah seorang tabib.\" Ia berkata, \"Demi Allah, engkau hanyalah perantara. Tabib yang sebenarnya adalah Dzat Yang telah menciptakannya (sakit).\""
            },
            {
                "number": 3675,
                "arab": "حَدَّثَنَا ابْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ حَدَّثَنَا سُفْيَانُ عَنْ إِيَادِ بْنِ لَقِيطٍ عَنْ أَبِي رِمْثَةَ قَالَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَا وَأَبِي فَقَالَ لِرَجُلٍ أَوْ لِأَبِيهِ مَنْ هَذَا قَالَ ابْنِي قَالَ لَا تَجْنِي عَلَيْهِ وَكَانَ قَدْ لَطَّخَ لِحْيَتَهُ بِالْحِنَّاءِ",
                "id": "Telah menceritakan kepada kami [Ibnu Basysyar] berkata, telah menceritakan kepada kami ['Abdurrahman] berkata, telah menceritakan kepada kami [Sufyan] dari [Iyad bin Laqith] dari [Abu Rimtsah] ia berkata, \"Aku dan bapakku mendatangi Nabi shallallahu 'alaihi wasallam, lalu beliau bertanya kepada seorang laki-laki, atau kepada bapaknya: \"Siapa ini?\" orang itu menjawab, \"Anakku.\" Beliau bersabda: \"Jangan engkau berlaku jahat kepadanya.\" Dan saat itu ia sedang mewarnai janggutnya dengan pacar.\""
            },
            {
                "number": 3676,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ حَدَّثَنَا حَمَّادٌ عَنْ ثَابِتٍ عَنْ أَنَسٍأَنَّهُ سُئِلَ عَنْ خِضَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ أَنَّهُ لَمْ يَخْضِبْ وَلَكِنْ قَدْ خَضَبَ أَبُو بَكْرٍ وَعُمَرُ رَضِيَ اللَّهُ عَنْهُمَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ubaid] berkata, telah menceritakan kepada kami [Hammad] dari [Tsabit] dari [Anas] Bahwasanya ia pernah ditanya tentang warna cat (rambut) Nabi shallallahu 'alaihi wasallam. Lalu ia menyebutkan bahwa Rasulullah tidak pernah mengecat rambutnya, hanya saja hal itu pernah dilakukan oleh Abu Bakar dan Umar radliallahu 'anhuma.\""
            },
            {
                "number": 3677,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ مُطَرِّفٍ أَبُو سُفْيَانَ حَدَّثَنَا عَمْرُو بْنُ مُحَمَّدٍ حَدَّثَنَا ابْنُ أَبِي رَوَّادٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَلْبَسُ النِّعَالَ السِّبْتِيَّةَ وَيُصَفِّرُ لِحْيَتَهُ بِالْوَرْسِ وَالزَّعْفَرَانِوَكَانَ ابْنُ عُمَرَ يَفْعَلُ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Abdurrahim bin Mutaharrif Abu Sufyan] berkata, telah menceritakan kepada kami [Amru bin Muhammad] berkata, telah menceritakan kepada kami [Ibnu Abu Rawwad] dari [Nafi'] dari [Ibnu Umar] berkata, \"Nabi shallallahu 'alaihi wasallam mengenakan sandal yang bertali dan memberi warna janggutnya dengan Al Waras (semacam tumbuhan) dan Za'faran. Dan Ibnu Umar juga melakukan hal itu.\""
            },
            {
                "number": 3678,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ حَدَّثَنَا مُحَمَّدُ بْنُ طَلْحَةَ عَنْ حُمَيْدِ بْنِ وَهْبٍ عَنْ ابْنِ طَاوُسٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ قَالَمَرَّ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلٌ قَدْ خَضَّبَ بِالْحِنَّاءِ فَقَالَ مَا أَحْسَنَ هَذَا قَالَ فَمَرَّ آخَرُ قَدْ خَضَّبَ بِالْحِنَّاءِ وَالْكَتَمِ فَقَالَ هَذَا أَحْسَنُ مِنْ هَذَا قَالَ فَمَرَّ آخَرُ قَدْ خَضَّبَ بِالصُّفْرَةِ فَقَالَ هَذَا أَحْسَنُ مِنْ هَذَا كُلِّهِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Ishaq bin Manshur] berkata, telah menceritakan kepada kami [Muhammad bin Thalhah] dari [Humaid bin Wahb] dari [Ibnu Thawus] dari [Thawus] dari [Ibnu Abbas] ia berkata, \"Seorang laki-laki yang mengecat rambutnya dengan pacar lewat dihadapan Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Betapa bagusnya ini.\" Setelah itu lewat orang lain yang mewarnai rambutnya dengan pacar dan Al Katam (tanaman semacam daun pacar), beliau bersabda: \"Orang ini lebih bagus dari yang tadi.\" Setelah itu lewat orang lain yang mewarnai rambutnya dengan warna kuning, beliau bersabda: \"Orang ini lebih bagus dari yang tadi-tadi.\""
            },
            {
                "number": 3679,
                "arab": "حَدَّثَنَا أَبُو تَوْبَةَ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ عَبْدِ الْكَرِيمِ الْجَزَرِيِّ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَكُونُ قَوْمٌ يَخْضِبُونَ فِي آخِرِ الزَّمَانِ بِالسَّوَادِ كَحَوَاصِلِ الْحَمَامِ لَا يَرِيحُونَ رَائِحَةَ الْجَنَّةِ",
                "id": "Telah menceritakan kepada kami [Abu Taubah] berkata, telah menceritakan kepada kami [Ubaidullah] dari [Abdul Karim Al jazari] dari [Sa'id bin Jubair] dari [Ibnu Abbas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pada akhir zaman nanti akan ada orang-orang yang mengecat rambutnya dengan warna hitam seperti warna mayoritas dada merpati, mereka tidak akan mendapat bau surga.\""
            },
            {
                "number": 3680,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ جُحَادَةَ عَنْ حُمَيْدٍ الشَّامِيِّ عَنْ سُلَيْمَانَ الْمُنَبِّهِيِّ عَنْ ثَوْبَانَ مَوْلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَافَرَ كَانَ آخِرُ عَهْدِهِ بِإِنْسَانٍ مِنْ أَهْلِهِ فَاطِمَةَ وَأَوَّلُ مَنْ يَدْخُلُ عَلَيْهَا إِذَا قَدِمَ فَاطِمَةَ فَقَدِمَ مِنْ غَزَاةٍ لَهُ وَقَدْ عَلَّقَتْ مِسْحًا أَوْ سِتْرًا عَلَى بَابِهَا وَحَلَّتْ الْحَسَنَ وَالْحُسَيْنَ قُلْبَيْنِ مِنْ فِضَّةٍ فَقَدِمَ فَلَمْ يَدْخُلْ فَظَنَّتْ أَنَّ مَا مَنَعَهُ أَنْ يَدْخُلَ مَا رَأَى فَهَتَكَتْ السِّتْرَ وَفَكَّكَتْ الْقُلْبَيْنِ عَنْ الصَّبِيَّيْنِ وَقَطَّعَتْهُ بَيْنَهُمَا فَانْطَلَقَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُمَا يَبْكِيَانِ فَأَخَذَهُ مِنْهُمَا وَقَالَ يَا ثَوْبَانُ اذْهَبْ بِهَذَا إِلَى آلِ فُلَانٍ أَهْلِ بَيْتٍ بِالْمَدِينَةِ إِنَّ هَؤُلَاءِ أَهْلُ بَيْتِي أَكْرَهُ أَنْ يَأْكُلُوا طَيِّبَاتِهِمْ فِي حَيَاتِهِمْ الدُّنْيَا يَا ثَوْبَانُ اشْتَرِ لِفَاطِمَةَ قِلَادَةً مِنْ عَصَبٍ وَسِوَارَيْنِ مِنْ عَاجٍ",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Abdul Warits bin Sa'id] dari [Muhammad bin Juhadah] dari [Humaid Asy Syami] dari [Sulaiman Al Munabbihi] dari [Tsauban] mantan budak (yang telah dimerdekakan oleh) Rasulullah shallallahu 'alaihi wasallam, ia berkata, \"Jika Rasulullah shallallahu 'alaihi wasallam melakukan safar, maka orang yang paling akhir beliau beri nasihat dari keluarganya adalah Fatimah, dan orang yang pertama kali beliau temui saat datang adalah Fatimah. Satu kali beliau tiba dari peperangan yang dilakukannya, sementara Fatimah telah memasang satir di pintunya dan memasang perhiasan gelang perak pada hasan dan husain. Beliau datang namun tidak masuk, hal itu menjadikan Fatimah berperasangka bahwa tidak masuknya Rasulullah adalah karena apa yang beliau lihat dari yang ia lakukan. Lalu ia menyobek tirai dan melepas dua gelang yang ada pada kedua anaknya. Setelah itu ia membawa kedua anaknya yang masih menangis untuk menemui Rasulullah shallallahu 'alaihi wasallam. Beliau lantas meraih gelang tersebut dari keduanya dan bersabda: \"Wahai Tsauban, pergilah dengan membawa ini (gelang) ke keluarga fulan -ahlu bait di Madinah-, mereka (keluarga Fathimah) adalah ahli baitku, aku tidak ingin mereka makan dengan enak dalam kehidupan mereka di dunia. Wahai Tsauban, belikanlah Fatimah kalung dari ashab (sejenis tumbuhan) dan dua gelang dari gading.\""
            }
  ]
}