{
    "kategori": "Kitab Huruf dan Bacaan",
  "hadits": [
    {
                "number": 3455,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ ح و حَدَّثَنَا نَصْرُ بْنُ عَاصِمٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرٍ رَضِيَ اللَّهُ عَنْهُأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ{ وَاتَّخِذُوا مِنْ مَقَامِ إِبْرَاهِيمَ مُصَلًّى }",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili] telah menceritakan kepada kami [Hatim bin Isma'il]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Nashr bin 'Ashim] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Ja'far bin Muhammad] dari [Ayahnya] dan [Jabir] radliallahu 'anhu, bahwa Nabi shallallahu 'alaihi wasallam membaca ayat: '(Dan jadikanlah sebahagian maqam Ibrahim tempat shalat) ' (Qs. Al Baqarah: 125). "
            },
            {
                "number": 3456,
                "arab": "حَدَّثَنَا مُوسَى يَعْنِي ابْنَ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ عُرْوَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّ رَجُلًا قَامَ مِنْ اللَّيْلِ فَقَرَأَ فَرَفَعَ صَوْتَهُ بِالْقُرْآنِ فَلَمَّا أَصْبَحَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْحَمُ اللَّهُ فُلَانًا كَائِنْ مِنْ آيَةٍ أَذْكَرَنِيهَا اللَّيْلَةَ كُنْتُ قَدْ أُسْقِطْتُهَا",
                "id": "Telah menceritakan kepada kami Musa bin Isma'il telah menceritakan kepada kami Hammad dari Hisyam bin 'Urwah dari 'Urwah dan Aisyah radliyallahu 'anhuma, bahwa Seorang laki-laki melakukan shalat malam kemudian membaca Al Qur'an dan mengeraskan suaranya. Di pagi harinya Rasulullah shallallahu 'alaihi wa sallam bersabda: \"Semoga Allah merahmati Fulan, dengan bacaan yang ia lakukan tadi malam, ia telah banyak mengingatkan aku dengan ayat-ayat yang aku lupa.\""
            },
            {
                "number": 3457,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ حَدَّثَنَا خُصَيْفٌ حَدَّثَنَا مِقْسَمٌ مَوْلَى ابْنِ عَبَّاسٍ قَالَ قَالَ ابْنُ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَانَزَلَتْ هَذِهِ الْآيَةُ{ وَمَا كَانَ لِنَبِيٍّ أَنْ يَغُلَّ }فِي قَطِيفَةٍ حَمْرَاءَ فُقِدَتْ يَوْمَ بَدْرٍ فَقَالَ بَعْضُ النَّاسِ لَعَلَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخَذَهَا فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ{ وَمَا كَانَ لِنَبِيٍّ أَنْ يَغُلَّ }إِلَى آخِرِ الْآيَةِقَالَ أَبُو دَاوُد يَغُلَّ مَفْتُوحَةُ الْيَاءِ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Abdul Wahid bin Ziyad] telah menceritakan kepada kami [Khushaif] telah menceritakan kepada kami [Miqsam] mantan budak Ibnu Abbas, ia berkata, [Ibnu Abbas] radliallahu 'anhu berkata, \"Turunnya ayat ini: '(Tidak mungkin seorang nabi berkhianat dalam urusan harta rampasan perang) ' (Qs. Ali Imran: 161), berkenaan dengan hilangnya kasur merah di badar. Sebagian orang mengatakan, \"Kemungkinan Rasulullah shallallahu 'alaihi wasallam mengambilnya, maka Allah 'azza wajalla menurunkan ayat: '(Tidak mungkin seorang nabi berkhianat dalam urusan harta rampasan perang) ' (Qs. Ali Imran: 161), hingga akhir ayat.\" Abu Daud berkata, \"Yaghulla, dengan memberi harakat fathah pada huruf ya'.\""
            },
            {
                "number": 3458,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا مُعْتَمِرٌ قَالَ سَمِعْتُ أَبِي قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْبَخَلِ وَالْهَرَمِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Mu'tamir] ia berkata; aku mendengar [Ayahku] berkata; aku pernah mendengar [Anas bin Malik] berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"ALLAAHUMMA INNII A'UUDZU BIKA MINAL BUKHLI WAL HARAMI (Ya Allah, aku berlindung kepada-Mu dari sifat kikir dan pikun) '.\""
            },
            {
                "number": 3459,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا يَحْيَى بْنُ سُلَيْمٍ عَنْ إِسْمَعِيلَ بْنِ كَثِيرٍ عَنْ عَاصِمِ بْنِ لَقِيطِ بْنِ صَبِرَةَ عَنْ أَبِيهِ لَقِيطِ بْنِ صَبِرَةَ قَالَ كُنْتُ وَافِدَ بَنِي الْمُنْتَفِقِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ الْحَدِيثَ فَقَالَ يَعْنِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَحْسِبَنَّ وَلَمْ يَقُلْ لَا تَحْسَبَنَّ",
                "id": "Telah menceritakan kepada kami Qutaibah bin Sa'id telah menceritakan kepada kami Yahya bin Sulaim dari Isma'il bin Katsir dari 'Ashim bin Laqith bin Shabirah dari ayahnya Laqith bin Shabirah ia berkata: Dahulu aku pernah menjadi delegasi Bani Al Muntafiq kepada Rasulullah shallallahu 'alaihi wa sallam. Kemudian ia menyebutkan hadits. Nabi shallallahu 'alaihi wa sallam kemudian mengucapkan: \"LAA TAHSIBANNA\" bukan \"LAA TAHSABANNA.\""
            },
            {
                "number": 3460,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا سُفْيَانُ حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ قَالَلَحِقَ الْمُسْلِمُونَ رَجُلًا فِي غُنَيْمَةٍ لَهُ فَقَالَ السَّلَامُ عَلَيْكُمْ فَقَتَلُوهُ وَأَخَذُوا تِلْكَ الْغُنَيْمَةَ فَنَزَلَتْ{ وَلَا تَقُولُوا لِمَنْ أَلْقَى إِلَيْكُمْ السَّلَامَ لَسْتَ مُؤْمِنًا تَبْتَغُونَ عَرَضَ الْحَيَاةِ الدُّنْيَا }تِلْكَ الْغُنَيْمَةَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami ['Amru bin Dinar] dari ['Atha] dari [Ibnu Abbas] ia berkata, \"Orang-orang muslim bertemu dengan seorang laki-laki yang membawa kambingnya, kemudian ia mengucapkan, 'Assalaamu 'alaikum! ' Lalu mereka membunuhnya dan mengambil kambing tersebut. Maka turunlah ayat: '(Dan janganlah kamu mengatakan kepada orang yang mengucapkan 'salam' kepadamu: 'Kamu bukan seorang mukmin' (lalu kamu membunuhnya), dengan maksud mencari harta benda kehidupan di dunia) ' (Qs. An Nisaa: 94), yaitu kambing tersebut.\""
            },
            {
                "number": 3461,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ ح و حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ عَنْ ابْنِ أَبِي الزِّنَادِ وَهُوَ أَشْبَعُ عَنْ أَبِيهِ عَنْ خَارِجَةَ بْنِ زَيْدِ بْنِ ثَابِتٍ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ{ غَيْرُ أُولِي الضَّرَرِ }وَلَمْ يَقُلْ سَعِيدٌ كَانَ يَقْرَأُ",
                "id": "Telah menceritakan kepada kami [Sa'id bin Manshur] telah menceritakan kepada kami [Ibnu Abu Az Zinad]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Sulaiman Al Anbari] telah menceritakan kepada kami [Hajjaj bin Muhammad] dari [Ibnu Abu Az Zinad Asyba'] dari [Ayahnya] dari [Kharijah bin Zaid bin Tsabit] dari [Ayahnya], bahwa Nabi shallallahu 'alaihi wasallam membaca ayat: (yang tidak mempunyai 'uzur…) ' (Qs. An Nisaa; 95). Sa'id tidak menyebutkan kata, 'membaca'.\""
            },
            {
                "number": 3462,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ الْعَلَاءِ قَالَا حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ حَدَّثَنَا يُونُسُ بْنُ يَزِيدَ عَنْ أَبِي عَلِيِّ بْنِ يَزِيدَ عَنْ الزُّهْرِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَقَرَأَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ{ وَالْعَيْنُ بِالْعَيْنِ }",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] dan [Muhammad bin Al 'Ala] mereka berkata; telah menceritakan kepada kami [Abdullah bin Al Mubarak] telah menceritakan kepada kami [Yunus bin Yazid] dari [Abu Ali bin Yazid] dari [Az Zuhri] dari [Anas bin Malik] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam membaca ayat: '(... dan mata dengan mata) ' (Qs. Al Maidah: 45). "
            },
            {
                "number": 3463,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ حَدَّثَنَا أَبِي حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ حَدَّثَنَا يُونُسُ بْنُ يَزِيدَ عَنْ أَبِي عَلِيِّ بْنِ يَزِيدَ عَنْ الزُّهْرِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ { وَكَتَبْنَا عَلَيْهِمْ فِيهَا أَنَّ النَّفْسَ بِالنَّفْسِ وَالْعَيْنُ بِالْعَيْنِ }",
                "id": "Telah menceritakan kepada kami Nashr bin Ali telah menceritakan kepada kami Bapakku telah menceritakan kepada kami Abdullah bin Al Mubarak telah menceritakan kepada kami Yunus bin Yazid dari Abu Ali bin Yazid dari Az Zuhri dari Anas bin Malik radliyallahu 'anhu, bahwa Rasulullah shallallahu 'alaihi wa sallam membaca ayat: {Dan Kami telah tetapkan terhadap mereka di dalamnya (At Taurat) bahwasanya jiwa (dibalas) dengan jiwa, mata dengan mata} (Al Maidah: 45)."
            },
            {
                "number": 3464,
                "arab": "حَدَّثَنَا النُّفَيْلِيُّ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا فُضَيْلُ بْنُ مَرْزُوقٍ عَنْ عَطِيَّةَ بْنِ سَعْدٍ الْعَوْفِيِّ قَالَقَرَأْتُ عَلَى عَبْدِ اللَّهِ بْنِ عُمَرَ{ اللَّهُ الَّذِي خَلَقَكُمْ مِنْ ضَعْفٍ }فَقَالَ{ مِنْ ضُعْفٍ }قَرَأْتُهَا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَمَا قَرَأْتَهَا عَلَيَّ فَأَخَذَ عَلَيَّ كَمَا أَخَذْتُ عَلَيْكَ",
                "id": "Telah menceritakan kepada kami [An Nufaili] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Fudlail bin Marzuq] dari ['Athiyyah bin Sa'dan Al 'Aufi] ia berkata, \"Aku pernah membacakan kepada [Abdullah bin Umar] ayat: 'ALLAHULLADZII KHALAQAKUM MIN DLA'FIN… (Allah, Dialah yang menciptakan kamu dari keadaan lemah...) (Qs. Ar Ruum: 54) ', kemudian ia berkata, 'MIN DLU'FIN…(dari kelemahan) -dengan dlammah-', aku pernah membacakan ayat tersebut kepada Rasulullah shallallahu 'alaihi wasallam sebagaimana engkau telah membacakannya kepadaku, kemudian beliau mengoreksiku sebagaimana aku telah mengoreksimu.\""
            },
            {
                "number": 3465,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى الْقُطَعِيُّ حَدَّثَنَا عُبَيْدٌ يَعْنِي ابْنَ عَقِيلٍ عَنْ هَارُونَ عَنْ عَبْدِ اللَّهِ بْنِ جَابِرٍ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ ضُعْفٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya Al Qutha'i] telah menceritakan kepada kami ['Ubaid bin 'Aqil] dari [Harun] dari [Abdullah bin Jabir] dari ['Athiyyah] dari [Abu Sa'id] dari Nabi shallallahu 'alaihi wasallam, beliau membaca: 'MIN DLU'FIN (dari kelemahan) (Qs. Ar Ruum: 54). -dengan harakat dlammah-. "
            },
            {
                "number": 3466,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ أَسْلَمَ الْمِنْقَرِيِّ عَنْ عَبْدِ اللَّهِ عَنْ أَبِيهِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى قَالَ قَالَ أُبَيُّ بْنُ كَعْبٍ { بِفَضْلِ اللَّهِ وَبِرَحْمَتِهِ فَبِذَلِكَ فَلْتَفْرَحُوا } قَالَ أَبُو دَاوُد بِالتَّاءِ",
                "id": "Telah menceritakan kepada kami Muhammad bin Katsir telah mengabarkan kepada kami Sufyan dari Aslam Al Minqari dari Abdullah dari ayahnya Abdurrahman bin Abza ia berkata: Ubay bin Ka'b membaca: {BIFADLLILLAAHI WA BIRAHMATIHI FABIDZAALIKA FALTAFRAHUU} (Katakanlah: Dengan kurnia Allah dan rahmat-Nya, hendaklah dengan itu mereka bergembira) (Yunus: 58). Abu Daud berkata: Yaitu dengan menggunakan huruf Ta`."
            },
            {
                "number": 3467,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا الْمُغِيرَةُ بْنُ سَلَمَةَ حَدَّثَنَا ابْنُ الْمُبَارَكِ عَنْ الْأَجْلَحِ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ أَبِيهِ عَنْ أُبَيٍّأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ{ بِفَضْلِ اللَّهِ وَبِرَحْمَتِهِ فَبِذَلِكَ فَلْتَفْرَحُوا هُوَ خَيْرٌ مِمَّا تَجْمَعُونَ }",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah] telah menceritakan kepada kami [Al Mughirah bin Salamah] telah menceritakan kepada kami [Ibnu Al Mubarak] dari [Al Ajlah] telah menceritakan kepadaku [Abdullah bin Abdurrahman bin Abza] dari [ayahnya] dari [Ubai] bahwa Nabi shallallahu 'alaihi wasallam pernah membaca ayat: BIFADHLILLAAHI WA RAHMATIHI, FABIDZAALIKA FAL TAFRAHUU, HUWA KHAIRUN MIMMAA TAJMA'UUN (Katakanlah: \"Dengan karunia Allah dan rahmat-Nya, hendaklah dengan itu kalian bergembira. Karunia Allah dan rahmat-Nya itu adalah lebih baik dari apa yang kalian kumpulkan.\"); "
            },
            {
                "number": 3468,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا ثَابِتٌ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ أَسْمَاءَ بِنْتِ يَزِيدَأَنَّهَا سَمِعَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ{ إِنَّهُ عَمِلَ غَيْرَ صَالِحٍ }",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] telah mengabarkan kepada kami [Tsabit] dari [Syahr bin Hausyab] dari [Asma` binti Yazid], bahwa ia pernah mendengar Nabi shallallahu 'alaihi wasallam membaca: 'INNAHUU 'AMILA GHAIRA SHAALIH (Sesungguhnya ia telah melakukan perbuatan yang tidak baik) '. (Qs. Huud: 46). "
            },
            {
                "number": 3469,
                "arab": "حَدَّثَنَا أَبُو كَامِلٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ الْمُخْتَارِ حَدَّثَنَا ثَابِتٌ عَنْ شَهْرِ بْنِ حَوْشَبٍ قَالَ سَأَلْتُ أُمَّ سَلَمَةَ كَيْفَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ هَذِهِ الْآيَةَ { إِنَّهُ عَمَلٌ غَيْرُ صَالِحٍ } فَقَالَتْ قَرَأَهَا { إِنَّهُ عَمِلَ غَيْرَ صَالِحٍ } قَالَ أَبُو دَاوُد وَرَوَاهُ هَارُونُ النَّحْوِيُّ وَمُوسَى بْنُ خَلَفٍ عَنْ ثَابِتٍ كَمَا قَالَ عَبْدُ الْعَزِيزِ",
                "id": "Telah menceritakan kepada kami Abu Kamil telah menceritakan kepada kami Abdul Aziz bin Al Mukhtar telah menceritakan kepada kami Tsabit dari Syahr bin Hausyab ia berkata: Aku bertanya kepada Ummu Salamah: \"Bagaimana Rasulullah shallallahu 'alaihi wa sallam membaca ayat ini: {INNAHUU 'AMALUN GHAIRU SHAALIH} (sesungguhnya (perbuatan) nya perbuatan yang tidak baik)? (Huud: 46)\" Kemudian Ummu Salamah menjawab: Beliau membacanya: {INNAHUU 'AMILA GHAIRA SHAALIH} (sesungguhnya (perbuatan) nya perbuatan yang tidak baik). Abu Daud berkata: Hadits tersebut diriwayatkan oleh Harun An Nahwi dan Musa bin Khalaf dari Tsabit sebagaimana yang dikatakan Abdul Aziz."
            },
            {
                "number": 3470,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى أَخْبَرَنَا عِيسَى عَنْ حَمْزَةَ الزَّيَّاتِ عَنْ أَبِي إِسْحَقَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ عَنْ أُبَيِّ بْنِ كَعْبٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَعَا بَدَأَ بِنَفْسِهِ وَقَالَ رَحْمَةُ اللَّهِ عَلَيْنَا وَعَلَى مُوسَى لَوْ صَبَرَ لَرَأَى مِنْ صَاحِبِهِ الْعَجَبَ وَلَكِنَّهُ قَالَ { إِنْ سَأَلْتُكَ عَنْ شَيْءٍ بَعْدَهَا فَلَا تُصَاحِبْنِي قَدْ بَلَغْتَ مِنْ لَدُنِّي } طَوَّلَهَا حَمْزَةُ",
                "id": "Telah menceritakan kepada kami Ibrahim bin Musa telah mengabarkan kepada kami Isa dari Hamzah Az Zayyat dari Abu Ishaq dari Sa'id bin Jubair dari Ibnu Abbas dari Ubay bin Ka'b ia berkata: Jika Rasulullah shallallahu 'alaihi wa sallam berdoa, maka beliau memulai dari dirinya. Beliau lalu bersabda: \"Semoga rahmat Allah terlimpahkan kepada kita, dan kepada Musa. Seandainya bersabar niscaya ia melihat dari sahabatnya sesuatu yang mengagumkan, akan tetapi ia mengatakan: {Jika aku bertanya kepadamu tentang sesuatu sesudah (kali) ini, maka janganlah kamu memperbolehkan aku menyertaimu, sesungguhnya kamu sudah cukup memberikan uzur padaku} (Al Kahfi: 76).\" Hamzah memanjangkan bacaan \"LADUNNII.\""
            },
            {
                "number": 3471,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ أَبُو عَبْدِ اللَّهِ الْعَنْبَرِيُّ حَدَّثَنَا أُمَيَّةُ بْنُ خَالِدٍ حَدَّثَنَا أَبُو الْجَارِيَةِ الْعَبْدِيُّ عَنْ شُعْبَةَ عَنْ أَبِي إِسْحَقَ عَنْ سَعِيدِ بْنِ حُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ عَنْ أُبَيِّ بْنِ كَعْبٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَرَأَهَا { قَدْ بَلَغْتَ مِنْ لَدُنِّي } وَثَقَّلَهَا",
                "id": "Telah menceritakan kepada kami Muhammad bin Abdurrahman Abu Abdullah Al 'Anbari telah menceritakan kepada kami Umayyah bin Khalid telah menceritakan kepada kami Abu Al Jariyah Al 'Abdi dari Syu'bah dari Abu Ishaq dari Sa'id bin Jubair dari Ibnu Abbas dari Ubay bin Ka'b dari Nabi shallallahu 'alaihi wa sallam, bahwa Beliau membaca: {QAD BALAGHTA MIN LADUNNII}, yaitu dengan memberatkannya (mentasydidkannya)."
            },
            {
                "number": 3472,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مَسْعُودٍ الْمِصِّيصِيُّ حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ حَدَّثَنَا مُحَمَّدُ بْنُ دِينَارٍ حَدَّثَنَا سَعْدُ بْنُ أَوْسٍ عَنْ مِصْدَعٍ أَبِي يَحْيَى قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُ أَقْرَأَنِي أُبَيُّ بْنُ كَعْبٍ كَمَا أَقْرَأَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ { فِي عَيْنٍ حَمِئَةٍ } مُخَفَّفَةً",
                "id": "Telah menceritakan kepada kami Muhammad bin Mas'ud Al Mishshi telah menceritakan kepada kami Abdushshamad bin Abdul Warits telah menceritakan kepada kami Muhammad bin Dinar telah menceritakan kepada kami Sa'd bin Aus dari Mishda' Abu Yahya ia berkata: Aku mendengar Ibnu Abbas berkata: Ubay bin Ka'b membacakan kepadaku sebagaimana Rasulullah shallallahu 'alaihi wa sallam membacakan kepadanya ayat: {FII 'AININ HAMIATIN} (Al Kahfi), yaitu dengan tidak mentasydidkannya."
            },
            {
                "number": 3473,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ الْفَضْلِ حَدَّثَنَا وُهَيْبٌ يَعْنِي ابْنَ عَمْرٍو النَّمَرِيَّ أَخْبَرَنَا هَارُونُ أَخْبَرَنِي أَبَانُ بْنُ تَغْلِبَ عَنْ عَطِّيَةَ الْعَوْفِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الرَّجُلَ مِنْ أَهْلِ عِلِّيِّينَ لَيُشْرِفُ عَلَى أَهْلِ الْجَنَّةِ فَتُضِيءُ الْجَنَّةُ لِوَجْهِهِ كَأَنَّهَا كَوْكَبٌ دُرِّيٌّ قَالَ وَهَكَذَا جَاءَ الْحَدِيثُ دُرِّيٌّ مَرْفُوعَةٌ الدَّالُ لَا تُهْمَزُ وَإِنَّ أَبَا بَكْرٍ وَعُمَرَ لَمِنْهُمْ وَأَنْعَمَا",
                "id": "Telah menceritakan kepada kami Yahya bin Al Fadll telah menceritakan kepada kami Wuhaib bin 'Amru An Namari telah mengabarkan kepada kami Harun telah mengabarkan kepadaku Aban bin Taghlib dari 'Athiyyah Al 'Aufi dari Abu Sa'id Al Khudri, bahwa Nabi shallallahu 'alaihi wa sallam bersabda: \"Sungguh, seorang laki-laki dari 'Illiyyin menengok kepada penduduk Surga, kemudian Surga tersebut menjadi terang karena wajahnya. Seolah-olah bintang yang bersinar.\" Abu Sa'id Al Khudri berkata: seperti itulah yang disebutkan dalam hadits 'durriyun', dengan dlammah pada huruf 'dal' dan tidak diakhiri dengan huruf hamzah. Dan sungguh, Abu Bakar dan Umar termasuk di antara penduduk 'Illiyyin, dan bahkan lebih dari itu."
            },
            {
                "number": 3474,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَهَارُونُ بْنُ عَبْدِ اللَّهِ قَالَا حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنِي الْحَسَنُ بْنُ الْحَكَمِ النَّخَعِيُّ حَدَّثَنَا أَبُو سَبْرَةَ النَّخَعِيُّ عَنْ فَرْوَةَ بْنِ مُسَيْكٍ الْغُطَيْفِيِّ قَالَ أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ الْحَدِيثَ فَقَالَ رَجُلٌ مِنْ الْقَوْمِ يَا رَسُولَ اللَّهِ أَخْبِرْنَا عَنْ سَبَأٍ مَا هُوَ أَرْضٌ أَمْ امْرَأَةٌ فَقَالَ لَيْسَ بِأَرْضٍ وَلَا امْرَأَةٍ وَلَكِنَّهُ رَجُلٌ وَلَدَ عَشْرَةً مِنْ الْعَرَبِ فَتَيَامَنَ سِتَّةٌ وَتَشَاءَمَ أَرْبَعَةٌ قَالَ عُثْمَانُ الْغَطَفَانِيُّ مَكَانَ الْغُطَيْفِيِّ وَقَالَ حَدَّثَنَا الْحَسَنُ بْنُ الْحَكَمِ النَّخَعِيُّ",
                "id": "Telah menceritakan kepada kami Utsman bin Abu Syaibah dan Harun bin Abdullah mereka berkata: telah menceritakan kepada kami Abu Usamah telah menceritakan kepadaku Al Hasan bin Al Hakam An Nakha'i telah menceritakan kepada kami Abu Sabrah An Nakha'i dari Farwah bin Musaik Al Ghuthaifi ia berkata: Aku pernah datang kepada Nabi shallallahu 'alaihi wa sallam. Kemudian ia menyebutkan hadits tersebut. Seorang laki-laki dari para sahabat lalu berkata: \"Wahai Rasulullah, beritahukan kepada kami mengenai Saba`, apakah Saba` itu, tanah ataukah seorang wanita?\" Beliau kemudian bersabda: \"Bukan tanah dan bukan seorang wanita, akan tetapi seorang laki-laki yang melahirkan sepuluh orang Arab. Kemudian enam orang menuju ke Yaman dan tinggal di sana, dan empat orang menuju Syam serta tinggal di sana.\" Utsman mengatakan Al Ghathafani sebagai ganti Al Ghuthaifi. Ia berkata lagi: Al Hasan bin Al Hakam An Nakha'i menceritakannya kepada kami."
            },
            {
                "number": 3475,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ وَإِسْمَعِيلُ بْنُ إِبْرَاهِيمَ أَبُو مَعْمَرٍ الْهُذَلِيُّ عَنْ سُفْيَانَ عَنْ عَمْرٍو عَنْ عِكْرِمَةَ قَالَ حَدَّثَنَا أَبُو هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِسْمَعِيلُ عَنْ أَبِي هُرَيْرَةَ رِوَايَةً فَذَكَرَ حَدِيثَ الْوَحْيِ قَالَ فَذَلِكَ قَوْلُهُ تَعَالَى { حَتَّى إِذَا فُزِّعَ عَنْ قُلُوبِهِمْ }",
                "id": "Telah menceritakan kepada kami Ahmad bin 'Abdah, dan Isma'il bin Ibrahim Abu Ma'mar Al Hudzali dari Sufyan dan 'Amru dari Ikrimah ia berkata: telah menceritakan kepada kami Abu Hurairah dari Nabi shallallahu 'alaihi wa sallam, Isma'il menyebutkan dari Abu Hurairah secara riwayat. Kemudian ia menyebutkan hadits mengenai wahyu, ia berkata: Yang demikian itu sebagaimana firman Allah Ta'ala: {sehingga apabila telah dihilangkan ketakutan dari hati mereka} (Saba': 23)."
            },
            {
                "number": 3476,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ النَّيْسَابُورِيُّ حَدَّثَنَا إِسْحَقُ بْنُ سُلَيْمَانَ الرَّازِيُّ سَمِعْتُ أَبَا جَعْفَرٍ يَذْكُرُ عَنْ الرَّبِيعِ بْنِ أَنَسٍ عَنْ أُمِّ سَلَمَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ قِرَاءَةُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ { بَلَى قَدْ جَاءَتْكِ آيَاتِي فَكَذَبْتِ بِهَا وَاسْتَكْبَرْتِ وَكُنْتِ مِنْ الْكَافِرِينَ } قَالَ أَبُو دَاوُد هَذَا مُرْسَلٌ الرَّبِيعُ لَمْ يُدْرِكْ أُمَّ سَلَمَةَ",
                "id": "Telah menceritakan kepada kami Muhammad bin Rafi' An Naisaburi telah menceritakan kepada kami Ishaq bin Sulaiman Ar Razi aku mendengar Abu Ja'far menyebutkan dari Ar Rabi' bin Anas dari Ummu Salamah isteri Nabi shallallahu 'alaihi wa sallam, ia berkata: Bacaan Nabi shallallahu 'alaihi wa sallam: {BALAA QAD JAA ATKI AAYAATII FAKADZABTI BIHAA WASTAKBARTI WA KUNTI MINAL KAAFIRIIN} (Bukan demikian sebenarnya telah datang keterangan-keterangan-Ku kepadamu lalu kamu mendustakannya dan kamu menyombongkan diri dan adalah kamu termasuk orang-orang yang kafir) (Az Zumar: 59). Abu Daud berkata: Hadits ini adalah hadits mursal, sebab Ar Rabi' tidak bertemu dengan Ummu Salamah."
            },
            {
                "number": 3477,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هَارُونُ بْنُ مُوسَى النَّحْوِيُّ عَنْ بُدَيْلِ بْنِ مَيْسَرَةَ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَؤُهَا { فَرُوحٌ وَرَيْحَانٌ }",
                "id": "Telah menceritakan kepada kami Muslim bin Ibrahim telah menceritakan kepada kami Harun bin Musa An Nahwi dari Budail bin Maisarah dari Abdullah bin Syaqiq dari Aisyah radliyallahu 'anhuma, ia berkata: Aku mendengar Nabi shallallahu 'alaihi wa sallam membaca: {FARUUHUN WA RAIHAANUN} (maka dia memperoleh ketenteraman dan rezki) (Al Waaqi'ah: 89)."
            },
            {
                "number": 3478,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ وَأَحْمَدُ بْنُ عَبْدَةَ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو عَنْ عَطَاءٍ قَالَ ابْنُ حَنْبَلٍ لَمْ أَفْهَمْهُ جَيِّدًا عَنْ صَفْوَانَ قَالَ ابْنُ عَبْدَةَ ابْنُ يَعْلَى عَنْ أَبِيهِ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ يَقْرَأُ { وَنَادَوْا يَا مَالِكُ } قَالَ أَبُو دَاوُد يَعْنِي بِلَا تَرْخِيمٍ",
                "id": "Telah menceritakan kepada kami Ahmad bin Hanbal dan Ahmad bin 'Abdah mereka berkata: telah menceritakan kepada kami Sufyan dari 'Amru dari 'Atha -Ibnu Hanbal berkata: aku tidak memahaminya dengan baik- dari Shafwan, Ibnu 'Abdah bin Ya'la menyebutkan dari Ayahnya ia berkata: Aku mendengar Nabi shallallahu 'alaihi wa sallam di atas mimbar membaca: {WA NAADAU YAA MAALIKU} (Mereka berseru: \"Hai Malik\") (Az Zukhruf: 77). Abu Daud berkata: Yaitu tanpa tarkhim."
            },
            {
                "number": 3479,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ أَخْبَرَنَا أَبُو أَحْمَدَ أَخْبَرَنَا إِسْرَائِيلُ عَنْ أَبِي إِسْحَقَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ عَنْ عَبْدِ اللَّهِ قَالَ أَقْرَأَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي أَنَا الرَّزَّاقُ ذُو الْقُوَّةِ الْمَتِينُ",
                "id": "Telah menceritakan kepada kami Nashr bin Ali telah mengabarkan kepada kami Abu Ahmad telah mengabarkan kepada kami Israil dari Abu Ishaq dari Abdurrahman bin Yazid dari Abdullah ia berkata: Rasulullah shallallahu 'alaihi wa sallam membacakan kepadaku ayat: {INNII ANARRAZZAAQU DZUL QUWWATIL MATIIN} (Sesungguhnya Aku Maha Pemberi rezki Yang mempunyai Kekuatan lagi Sangat Kokoh). (Adz Dzariyat: 58)"
            },
            {
                "number": 3480,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ عَنْ الْأَسْوَدِ عَنْ عَبْدِ اللَّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَؤُهَا { فَهَلْ مِنْ مُدَّكِرٍ } يَعْنِي مُثَقَّلًا قَالَ أَبُو دَاوُد مَضْمُومَةُ الْمِيمِ مَفْتُوحَةُ الدَّالِ مَكْسُورَةُ الْكَافِ",
                "id": "Telah menceritakan kepada kami Hafsh bin Umar telah menceritakan kepada kami Syu'bah dari Abu Ishaq dari Al Aswad dari Abdullah, bahwa Nabi shallallahu 'alaihi wa sallam membaca ayat: {FAHAL MIN MUDDAKIR} (maka adakah orang yang mau mengambil pelajaran?) (Al Qamar: 15), yaitu dengan ditasydidkan. Abu Daud berkata: Huruf \"Mim\" di dlammahkan dan huruf \"Dal\" di fat-hahkan, sedangkan huruf \"Kaf\" dikasrahkan."
            },
            {
                "number": 3481,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عَبْدِ الرَّحْمَنِ الذِّمَارِيُّ حَدَّثَنَا سُفْيَانُ حَدَّثَنِي مُحَمَّدُ بْنُ الْمُنْكَدِرِ عَنْ جَابِرٍ قَالَ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ أَ { يَحْسَبُ أَنَّ مَالَهُ أَخْلَدَهُ }",
                "id": "Telah menceritakan kepada kami Ahmad bin Shalih telah menceritakan kepada kami Abdul Malik bin Abdurrahman Adz Dzimari telah menceritakan kepada kami Sufyan telah menceritakan kepadaku Muhammad bin Al Munkadir dari Jabir ia berkata: Aku melihat Nabi shallallahu 'alaihi wa sallam membaca: {AYAHSABU ANNA MAALAHU AKHLADAHU} (apakah dia mengira bahwa hartanya itu dapat mengekalkannya?) (Al Humazah: 3)."
            },
            {
                "number": 3482,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ خَالِدٍ عَنْ أَبِي قِلَابَةَ عَمَّنْ أَقْرَأَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ { فَيَوْمَئِذٍ لَا يُعَذِّبُ عَذَابَهُ أَحَدٌ وَلَا يُوثِقُ وَثَاقَهُ أَحَدٌ } قَالَ أَبُو دَاوُد بَعْضُهُمْ أَدْخَلَ بَيْنَ خَالِدٍ وَأَبِي قِلَابَةَ رَجُلًا",
                "id": "Telah menceritakan kepada kami Hafsh bin Umar telah menceritakan kepada kami Syu'bah dari Khalid dari Abu Qilabah dari orang yang telah dibacakan Rasulullah shallallahu 'alaihi wa sallam kepadanya: {FAYAUMAIDZIN LAA YU'ADZDZIBU 'ADZAABAHU AHAD, WA LAA YUUTSIQU WA TSAAQAHUU AHAD} (Maka pada hari itu tiada seorangpun yang menyiksa seperti siksa-Nya, dan tiada seorangpun yang mengikat seperti ikatan-Nya) (QS. Al Fajr: 25-26). Abu Daud berkata: Sebagian mereka memasukkan antara Khalid dan Abu Qilabah satu orang."
            },
            {
                "number": 3483,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ حَدَّثَنَا حَمَّادٌ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ أَبِي قِلَابَةَ قَالَ أَنْبَأَنِي مَنْ أَقْرَأَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْ مَنْ أَقْرَأَهُ مَنْ أَقْرَأَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ { فَيَوْمَئِذٍ لَا يُعَذَّبُ } قَالَ أَبُو دَاوُد قَرَأَ عَاصِمٌ وَالْأَعْمَشُ وَطَلْحَةُ بْنُ مُصَرِّفٍ وَأَبُو جَعْفَرٍ يَزِيدُ بْنُ الْقَعْقَاعِ وَشَيْبَةُ بْنُ نَصَّاحٍ وَنَافِعُ بْنُ عَبْدِ الرَّحْمَنِ وَعَبْدُ اللَّهِ بْنُ كَثِيرٍ الدَّارِيُّ وَأَبُو عَمْرِو بْنُ الْعَلَاءِ وَحَمْزَةُ الزَّيَّاتُ وَعَبْدُ الرَّحْمَنِ الْأَعْرَجُ وَقَتَادَةُ وَالْحَسَنُ الْبَصْرِيُّ وَمُجَاهِدٌ وَحُمَيْدٌ الْأَعْرَجُ وَعَبْدُ اللَّهِ بْنُ عَبَّاسٍ وَعَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرٍ لَا يُعَذِّبُ وَلَا يُوثِقُ إِلَّا الْحَدِيثَ الْمَرْفُوعَ فَإِنَّه يُعَذَّبُ بِالْفَتْحِ",
                "id": "Telah menceritakan kepada kami Muhammad bin 'Ubaid telah menceritakan kepada kami Hammad dari Khalid Al Hadzdza` dari Abu Qilabah ia berkata: Telah mengabarkan kepadaku orang yang dibacakan Nabi shallallahu 'alaihi wa sallam kepadanya: {FAYAUMAIDZIN LAA YU'ADZDZABU} (pada saat itu tidak ada yang diadzab) (QS. Al Fajr: 25). Abu Daud berkata: 'Ashim, Al A'masy, Thalhah bin Musharrif, Abu Ja'far Yazid bin Al Qa'qa', Syaibah bin Nashshah, Nafi' bin Abdurrahman, Abdullah bin Katsir Ad Dari, Abu 'Amru bin Al 'Ala`, Hamzah Az Zayyat, Abdurrahman Al A'raj, Qatadah, Al Hasan Al Bashri, Mujahid, Humaid Al A'raj, Abdullah bin 'Abbas, Abdurrahman bin Abu Bakr membaca: LAA YU'ADZDZIBU WA LAA YUUTSIQU, kecuali hadits marfu' sesungguhnya lafazhnya adalah YU'ADZDZABU dengan difathahkan."
            },
            {
                "number": 3484,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ الْعَلَاءِ أَنَّ مُحَمَّدَ بْنَ أَبِي عُبَيْدَةَ حَدَّثَهُمْ قَالَ حَدَّثَنَا أَبِي عَنْ الْأَعْمَشِ عَنْ سَعْدٍ الطَّائِيِّ عَنْ عَطِيَّةَ الْعَوْفِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ حَدَّثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدِيثًا ذَكَرَ فِيهِ جِبْرِيلَ وَمِيكَالَ فَقَالَ جِبْرَائِلُ وَمِيكَائِلُ قَالَ أَبُو دَاوُد قَالَ خَلَفٌ مُنْذُ أَرْبَعِينَ سَنَةً لَمْ أَرْفَعِ الْقَلَمَ عَنْ كِتَابَةِ الْحُرُوفِ مَا أَعْيَانِي شَيْءٌ مَا أَعْيَانِي جِبْرَائِلُ وَمِيكَائِلُ",
                "id": "Telah menceritakan kepada kami Utsman bin Abu Syaibah dan Muhammad bin Al 'Ala bahwa Muhammad bin Abu 'Ubaidah telah menceritakan kepada mereka, ia berkata: telah menceritakan kepada kami Ayahku dari Al A'masy dari Sa'd Ath Thai dari 'Athiyyah Al 'Aufi dari Abu Sa'id Al Khudri ia berkata: Rasulullah shallallahu 'alaihi wa sallam menceritakan sebuah hadits, dalam hadits tersebut beliau menyebutkan Jibril dan Mikail. Kemudian Jibril dan Mikail disebutkan. Abu Daud berkata: Khalaf berkata: \"Semenjak empat puluh tahun aku tidak mengangkat pena dari menulis huruf, tidak ada sesuatupun yang membuatku letih sebagaimana Jibril dan Mikail membuatku letih.\""
            },
            {
                "number": 3485,
                "arab": "حَدَّثَنَا زَيْدُ بْنُ أَخْزَمَ حَدَّثَنَا بِشْرٌ يَعْنِي ابْنَ عُمَرَ حَدَّثَنَا مُحَمَّدُ بْنُ خَازِمٍ قَالَ ذُكِرَ كَيْفَ قِرَاءَةُ جِبْرَائِلَ وَمِيكَائِلَ عِنْدَ الْأَعْمَشِ فَحَدَّثَنَا الْأَعْمَشُ عَنْ سَعْدٍ الطَّائِيِّ عَنْ عَطِيَّةَ الْعَوْفِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ ذَكَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَاحِبَ الصُّورِ فَقَالَ عَنْ يَمِينِهِ جِبْرَائِلُ وَعَنْ يَسَارِهِ مِيكَائِلُ",
                "id": "Telah menceritakan kepada kami Zaid bin Akhzam telah menceritakan kepada kami Bisyr bin Umar telah menceritakan kepada kami Muhammad bin Khazim, ia berkata: Disebutkan bagaimana bacaan Jibril dan Mikail menurut Al A'masy. Lalu Al A'masy menceritakan kepada kami dari Sa'd Ath Thai dari 'Athiyyah Al 'Aufi dari Abu Sa'id Al Khudri ia berkata: Rasulullah shallallahu 'alaihi wa sallam menyebutkan tentang malaikat peniup sangkakala, beliau bersabda: \"Di sebelah kanannya adalah Jibril dan di sebelah kirinya adalah Mikail.\""
            },
            {
                "number": 3486,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ قَالَ مَعْمَرٌ وَرُبَمَا ذَكَرَ ابْنَ الْمُسَيِّبِ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبُو بَكْرٍ وَعُمَرُ وَعُثْمَانُ يَقْرَءُونَ { مَالِكِ يَوْمِ الدِّينِ } وَأَوَّلُ مَنْ قَرَأَهَا { مَلِكِ يَوْمِ الدِّينِ } مَرْوَانُ قَالَ أَبُو دَاوُد هَذَا أَصَحُّ مِنْ حَدِيثِ الزُّهْرِيِّ عَنْ أَنَسٍ وَالزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ",
                "id": "Telah menceritakan kepada kami Ahmad bin Hanbal telah menceritakan kepada kami Abdurrazzaq telah mengabarkan kepada kami Ma'mar dari Az Zuhri, Ma'mar berkata: kadang ia juga menyebutkan Ibnu Al Musayyab, ia berkata: Nabi shallallahu 'alaihi wa sallam, Abu Bakr, Umar dan Utsman membaca: {MAALIKI YAUMIDDIIN} (QS. Al Fatihah: 4), dan orang pertama yang membaca: {MALIKI YAUMIDDIIN} adalah Marwan. Abu Daud berkata: Hadits ini lebih shahih daripada hadits Az Zuhri dari Anas dan Az Zuhri dari Salim dari ayahnya."
            },
            {
                "number": 3487,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ يَحْيَى الْأُمَوِيُّ حَدَّثَنِي أَبِي حَدَّثَنَا ابْنُ جُرَيْجٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ عَنْ أُمِّ سَلَمَةَ أَنَّهَا ذَكَرَتْ أَوْ كَلِمَةً غَيْرَهَا قِرَاءَةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ { الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ الرَّحْمَنِ الرَّحِيمِ مَلِكِ يَوْمِ الدِّينِ } يُقَطِّعُ قِرَاءَتَهُ آيَةً آيَةً قَالَ أَبُو دَاوُد سَمِعْتُ أَحْمَدَ يَقُولُ الْقِرَاءَةُ الْقَدِيمَةُ { مَالِكِ يَوْمِ الدِّينِ }",
                "id": "Telah menceritakan kepada kami Sa'id bin Yahya Al Umawi telah menceritakan kepadaku ayahku telah menceritakan kepada kami Ibnu Juraij dari Abdullah bin Abu Mulaikah dari Ummu Salamah bahwa ia menyebutkan bacaan Rasulullah shallallahu 'alaihi wa sallam: Bismillaahirrahmaanirrahiim, Alhamdulillaahi Rabbil 'Aalamiin, Arrahmaanirrahiim, Maliki Yaumid Diin. Beliau membaca dengan memutus bacaan ayat demi ayat. Abu Daud berkata: Aku mendengar Ahmad berkata: Bacaan yang lama adalah {Maaliki Yaumid Diin}."
            },
            {
                "number": 3488,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَعُبَيْدُ اللَّهِ بْنُ عُمَرَ بْنِ مَيْسَرَةَ قَالَا حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ عَنْ سُفْيَانَ بْنِ حُسَيْنٍ عَنْ الْحَكَمِ بْنِ عُتَيْبَةَ عَنْ إِبْرَاهِيمَ التَّيْمِيِّ عَنْ أَبِيهِ عَنْ أَبِي ذَرٍّ قَالَ كُنْتُ رَدِيفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ عَلَى حِمَارٍ وَالشَّمْسُ عِنْدَ غُرُوبِهَا فَقَالَ هَلْ تَدْرِي أَيْنَ تَغْرُبُ هَذِهِ قُلْتُ اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ فَإِنَّهَا تَغْرُبُ فِي عَيْنٍ حَامِيَةٍ",
                "id": "Telah menceritakan kepada kami Utsman bin Abu Syaibah dan 'Ubaidullah bin Umar bin Maisarah, mereka berkata: telah menceritakan kepada kami Yazid bin Harun dari Sufyan bin Husain dari Al Hakam bin 'Utaibah dari Ibrahim At Taimi dari ayahnya dari Abu Dzar ia berkata: Aku pernah membonceng Rasulullah shallallahu 'alaihi wa sallam di atas keledai ketika matahari hampir tenggelam. Beliau bersabda: \"Tahukah engkau di mana matahari ini tenggelam?\" Aku menjawab: \"Allah dan Rasul-Nya lebih mengetahui.\" Beliau bersabda: \"Sesungguhnya matahari itu tenggelam di mata air yang berlumpur.\""
            },
            {
                "number": 3489,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا حَجَّاجٌ عَنْ ابْنِ جُرَيْجٍ قَالَ أَخْبَرَنِي عُمَرُ بْنُ عَطَاءٍ أَنَّ مَوْلًى لِابْنِ الْأَسْقَعِ رَجُلَ صِدْقٍ أَخْبَرَهُ عَنْ ابْنِ الْأَسْقَعِ أَنَّهُ سَمِعَهُ يَقُولُ إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَاءَهُمْ فِي صُفَّةِ الْمُهَاجِرِينَ فَسَأَلَهُ إِنْسَانٌ أَيُّ آيَةٍ فِي الْقُرْآنِ أَعْظَمُ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ { اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ }",
                "id": "Telah menceritakan kepada kami Muhammad bin Isa telah menceritakan kepada kami Hajjaj dari Ibnu Juraij ia berkata: telah mengabarkan kepadaku Umar bin 'Atha bahwa seorang mantan budak Ibnu Al Asqa', seorang yang jujur, mengabarkan kepadanya dari Ibnu Al Asqa', bahwa ia mendengarnya berkata: Nabi shallallahu 'alaihi wa sallam datang kepada penghuni Shuffah dari kalangan Muhajirin. Lalu seseorang bertanya: \"Ayat manakah dalam Al Qur'an yang paling agung?\" Beliau menjawab: {Allah, tidak ada Tuhan yang berhak disembah selain Dia, Yang Maha Hidup lagi Maha Berdiri sendiri, tidak mengantuk dan tidak tidur}."
            },
            {
                "number": 3490,
                "arab": "حَدَّثَنَا أَبُو مَعْمَرٍ عَبْدُ اللَّهِ بْنُ عَمْرِو بْنِ أَبِي الْحَجَّاجِ الْمِنْقَرِيُّ حَدَّثَنَا عَبْدُ الْوَارِثِ حَدَّثَنَا شَيْبَانُ عَنْ الْأَعْمَشِ عَنْ شَقِيقٍ عَنْ ابْنِ مَسْعُودٍ أَنَّهُ قَرَأَ { هَيْتَ لَكَ } فَقَالَ شَقِيقٌ إِنَّا نَقْرَؤُهَا { هِئْتُ لَكَ } يَعْنِي فَقَالَ ابْنُ مَسْعُودٍ أَقْرَؤُهَا كَمَا عُلِّمْتُ أَحَبُّ إِلَيَّ",
                "id": "Telah menceritakan kepada kami Abu Ma'mar Abdullah bin 'Amru bin Abu Al Hajjaj Al Minqari telah menceritakan kepada kami Abdul Warits telah menceritakan kepada kami Syaiban dari Al A'masy dari Syaqiq dari Ibnu Mas'ud bahwa ia membaca: {HAITA LAK} (Marilah ke sini). Kemudian Syaqiq berkata: \"Kami membacanya: {HI`TU LAK}.\" Lalu Ibnu Mas'ud berkata: \"Aku membacanya sebagaimana yang diajarkan kepadaku, itu lebih aku sukai.\""
            },
            {
                "number": 3491,
                "arab": "حَدَّثَنَا هَنَادٌ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ شَقِيقٍ قَالَ قِيلَ لِعَبْدِ اللَّهِ إِنَّ أُنَاسًا يَقْرَءُونَ هَذِهِ الْآيَةَ { وَقَالَتْ هِيتَ لَكَ } فَقَالَ إِنِّي أَقْرَأُ كَمَا عُلِّمْتُ أَحَبُّ إِلَيَّ { وَقَالَتْ هَيْتَ لَكَ }",
                "id": "Telah menceritakan kepada kami Hanad telah menceritakan kepada kami Abu Mu'awiyah dari Al A'masy dari Syaqiq, ia berkata: Abdullah ditanya: \"Sesungguhnya ada orang-orang yang membaca ayat ini: {WA QAALAT HIITA LAK}.\" Maka ia berkata: \"Aku membaca sebagaimana yang diajarkan kepadaku lebih aku sukai: {WA QAALAT HAITA LAK}.\""
            },
            {
                "number": 3492,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ ح و حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنَا هِشَامُ بْنُ سَعْدٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اللَّهُ عَزَّ وَجَلَّ لِبَنِي إِسْرَائِيلَ { ادْخُلُوا الْبَابَ سُجَّدًا وَقُولُوا حِطَّةٌ تُغْفَرْ لَكُمْ خَطَايَاكُمْ } حَدَّثَنَا جَعْفَرُ بْنُ مُسَافِرٍ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ عَنْ هِشَامِ بْنِ سَعْدٍ بِإِسْنَادِهِ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami Ahmad bin Shalih ia berkata: telah menceritakan kepada kami Ibnu Wahb. Dan telah menceritakan kepada kami Sulaiman bin Daud Al Mahri telah mengabarkan kepada kami Ibnu Wahb telah mengabarkan kepada kami Hisyam bin Sa'd dari Zaid bin Aslam dari 'Atha bin Yasar dari Abu Sa'id Al Khudri ia berkata: Rasulullah shallallahu 'alaihi wa sallam bersabda: \"Allah عز وجل berfirman kepada Bani Israil: {Masukilah pintu sambil bersujud dan katakanlah: 'Hiththah', niscaya diampuni dosa-dosa kalian}.\" Diriwayatkan pula oleh Ja'far bin Musafir dari Ibnu Abu Fudaik dari Hisyam bin Sa'd dengan sanad yang sama."
            },
            {
                "number": 3493,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ عُرْوَةَ أَنَّ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ نَزَلَ الْوَحْيُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَرَأَ عَلَيْنَا { سُورَةٌ أَنْزَلْنَاهَا وَفَرَضْنَاهَا } قَالَ أَبُو دَاوُد يَعْنِي مُخَفَّفَةً حَتَّى أَتَى عَلَى هَذِهِ الْآيَاتِ",
                "id": "Telah menceritakan kepada kami Musa bin Isma'il telah menceritakan kepada kami Hammad telah menceritakan kepada kami Hisyam bin 'Urwah dari 'Urwah bahwa Aisyah radliallahu 'anha berkata: Wahyu turun kepada Rasulullah shallallahu 'alaihi wa sallam, lalu beliau membacakannya kepada kami: {SUURATUN ANZALNAAHAA WA FARADLNAAHAA}. Abu Daud berkata: Yaitu dibaca tanpa tasydid sampai ayat-ayat tersebut."
            }
  ]
}