{
    "kategori": "Kitab Makanan",
  "hadits": [
    {
                "number": 3247,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا دُعِيَ أَحَدُكُمْ إِلَى الْوَلِيمَةِ فَلْيَأْتِهَاحَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَاهُ زَادَ فَإِنْ كَانَ مُفْطِرًا فَلْيَطْعَمْ وَإِنْ كَانَ صَائِمًا فَلْيَدْعُ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Nafi'] dari [Abdullah bin Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang di antara kalian diundang untuk menghadiri sebuah pesta, maka hendaknya ia mendatanginya!\" Telah menceritakan kepada kami [Makhlad bin Khalid] telah menceritakan kepada kami [Abu Usamah] dari ['Ubaidullah] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda dengan makna yang sama, ia menambahkan, \"Jika tidak berpuasa hendaklah ia makan, jika sedang berpuasa hendaklah ia (memberikan) doa.\""
            },
            {
                "number": 3248,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَعَا أَحَدُكُمْ أَخَاهُ فَلْيُجِبْ عُرْسًا كَانَ أَوْ نَحْوَهُحَدَّثَنَا ابْنُ الْمُصَفَّى حَدَّثَنَا بَقِيَّةُ حَدَّثَنَا الزُّبَيْدِيُّ عَنْ نَافِعٍ بِإِسْنَادِ أَيُّوبَ وَمَعْنَاهُ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali] telah menceritakan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Ma'mar] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang di antara kalian mengundang saudaranya, hendaknya ia memenuhi undangannya baik berupa pesta atau yang semisalnya!\" Telah menceritakan kepada kami [Ibnu Al Mushaffa] telah menceritakan kepada kami [Baqiyyah] telah menceritakan kepada kami [Az Zubaidi] dari [Nafi'] dengan sanad dan makna hadits Ayyub.\""
            },
            {
                "number": 3249,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ دُعِيَ فَلْيُجِبْ فَإِنْ شَاءَ طَعِمَ وَإِنْ شَاءَ تَرَكَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] telah mengabarkan kepada kami [Sufyan] dari [Abu Az Zubair] dari [Jabir] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa diundang hendaknya ia memenuhi undangan tersebut, jika mau ia boleh makan, dan jika mau ia boleh untuk tidak makan.\""
            },
            {
                "number": 3250,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا دُرُسْتُ بْنُ زِيَادٍ عَنْ أَبَانَ بْنِ طَارِقٍ عَنْ نَافِعٍ قَالَ قَالَ عَبْدُ اللَّهِ بْنُ عُمَرَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ دُعِيَ فَلَمْ يُجِبْ فَقَدْ عَصَى اللَّهَ وَرَسُولَهُ وَمَنْ دَخَلَ عَلَى غَيْرِ دَعْوَةٍ دَخَلَ سَارِقًا وَخَرَجَ مُغِيرًاقَالَ أَبُو دَاوُد أَبَانُ بْنُ طَارِقٍ مَجْهُولٌ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Durst bin Ziyad] dari [Aban bin Thariq] dari [Nafi'] ia berkata, [Abdullah bin Umar] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa diundang dan ia tidak mendatangi undangan tersebut maka sungguh ia telah durhaka kepada Allah dan rasul-Nya. Barangsiapa yang masuk tanpa undangan maka ia masuk sebagai pencuri, dan keluar sebagai orang yang menyerang.\" Abu Daud berkata, \"Aban bin Thariq adalah orang yang tidak dikenal.\""
            },
            {
                "number": 3251,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ أَنَّهُ كَانَ يَقُولُشَرُّ الطَّعَامِ طَعَامُ الْوَلِيمَةِ يُدْعَى لَهَا الْأَغْنِيَاءُ وَيُتْرَكُ الْمَسَاكِينُ وَمَنْ لَمْ يَأْتِ الدَّعْوَةَ فَقَدْ عَصَى اللَّهَ وَرَسُولَهُ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Ibnu Syihab] dari [Al A'raj] dari [Abu Hurairah] bahwa ia pernah berkata, \"Seburuk-buruk makanan adalah makanan pesta, orang-orang kaya diundang untuk menghadirinya sementara orang-orang miskin ditinggalkan. Barangsiapa tidak mendatangi undangan maka ia telah durhaka kepada Allah dan Rasul-Nya.\""
            },
            {
                "number": 3252,
                "arab": "حَدَّثَنَا مُسَدَّدٌ وَقُتَيْبَةُ بْنُ سَعِيدٍ قَالَا حَدَّثَنَا حَمَّادٌ عَنْ ثَابِتٍ قَالَذُكِرَ تَزْوِيجُ زَيْنَبَ بِنْتِ جَحْشٍ عِنْدَ أَنَسِ بْنِ مَالِكٍ فَقَالَ مَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْلَمَ عَلَى أَحَدٍ مِنْ نِسَائِهِ مَا أَوْلَمَ عَلَيْهَا أَوْلَمَ بِشَاةٍ",
                "id": "Telah menceritakan kepada kami [Musaddad] dan [Qutaibah bin Sa'id] mereka berkata; telah menceritakan kepada kami [Hammad] dari [Tsabit] ia berkata, \"Telah disebutkan pernikahan Zainab binti Jahsy di sisi [Anas bin Malik] maka Anas pun berkata, \"Aku tidak pernah melihat Rasulullah shallallahu 'alaihi wasallam merayakan pesta pernikahan dengan para isterinya, sebagaimana pesta pernikahan yang beliau rayakan bersama Zainab. Beliau merayakan hanya dengan satu kambing.\""
            },
            {
                "number": 3253,
                "arab": "حَدَّثَنَا حَامِدُ بْنُ يَحْيَى حَدَّثَنَا سُفْيَانُ حَدَّثَنَا وَائِلُ بْنُ دَاوُدَ عَنْ ابْنِهِ بَكْرِ بْنِ وَائِلٍ عَنْ الزَّهْرِيِّ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْلَمَ عَلَى صَفِيَّةَ بِسَوِيقٍ وَتَمْرٍ",
                "id": "Telah menceritakan kepada kami [Hamid bin Yahya] dari [Sufyan] telah menceritakan kepada kami [Wail bin Daud] dari anaknya [Bakr bin Wail] dari [Az Zuhri] dari [Anas bin Malik] bahwa Nabi shallallahu 'alaihi wasallam merayakan pernikahan Shafiyyah dengan memasak gandum dan kurma.\""
            },
            {
                "number": 3254,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ عَنْ الْحَسَنِ عَنْ عَبْدِ اللَّهِ بْنِ عُثْمَانَ الثَّقَفِيِّ عَنْ رَجُلٍ أَعْوَرَ مِنْ ثَقِيفٍ كَانَ يُقَالُ لَهُ مَعْرُوفًا أَيْ يُثْنَى عَلَيْهِ خَيْرًا إِنْ لَمْ يَكُنْ اسْمُهُ زُهَيْرُ بْنُ عُثْمَانَ فَلَا أَدْرِي مَا اسْمُهُأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْوَلِيمَةُ أَوَّلَ يَوْمٍ حَقٌّ وَالثَّانِيَ مَعْرُوفٌ وَالْيَوْمَ الثَّالِثَ سُمْعَةٌ وَرِيَاءٌقَالَ قَتَادَةُ وَحَدَّثَنِي رَجُلٌ أَنَّ سَعِيدَ بْنَ الْمُسَيِّبِ دُعِيَ أَوَّلَ يَوْمٍ فَأَجَابَ وَدُعِيَ الْيَوْمَ الثَّانِيَ فَأَجَابَ وَدُعِيَ الْيَوْمَ الثَّالِثَ فَلَمْ يُجِبْ وَقَالَ أَهْلُ سُمْعَةٍ وَرِيَاءٍ حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هِشَامٌ عَنْ قَتَادَةَ عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ بِهَذِهِ الْقِصَّةِ قَالَ فَدُعِيَ الْيَوْمَ الثَّالِثَ فَلَمْ يُجِبْ وَحَصَبَ الرَّسُولَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami ['Affan bin Muslim] telah menceritakan kepada kami [Hammam] telah menceritakan kepada kami [Qatadah] dari [Al Hasan] dari [Abdullah bin Utsman Ats Tsaqafi] dari -seorang laki-laki juling yang berasal dari Tsaqif yang dipanggil Ma'ruf, yaitu sebagai pujian yang baik kepadanya. Apabila namanya bukan- [Zuhair bin Utsman] maka aku tidak mengetahui siapa namanya. Nabi shallallahu 'alaihi wasallam bersabda: \"Pesta pada hari pertama adalah sesuatu yang hak, pada hari kedua adalah sesuatu yang baik, dan pada hari yang ketiga adalah suatu perbuatan sum'ah (ingin di dengar) dan riya` (ingin dilihat).\" [Qatadah] berkata, \"Telah menceritakan kepada kami seorang laki-laki bahwa [Sa'id bin Al Musayyab] pernah diundang pada hari pertama, kemudian ia memenuhi undangan tersebut, dan ia diundang pada hari kedua, kemudian ia memenuhi undangan tersebut, dan diundang pada hari ketiga, kemudian ia tidak memenuhi undangan tersebut seraya berkata, \"Ia adalah orang yang sum'ah dan riya`.\" Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Hisyam] dari [Qatadah] dari [Sa'id bin Al Musayyab] dengan hadits ini. Ia berkata, \"Ketika diundang pada hari ketiga ia tidak memenuhi undangan tersebut dan justru melempar sang utusan.\""
            },
            {
                "number": 3255,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ شُعْبَةَ عَنْ مُحَارِبِ بْنِ دِثَارٍ عَنْ جَابِرٍ قَالَلَمَّا قَدِمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ نَحَرَ جَزُورًا أَوْ بَقَرَةً",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Waki'] dari [Syu'bah] dari [Muharib bin Ditsar] dari [Jabir] ia berkata, \"Tatkala Nabi shallallahu 'alaihi wasallam datang ke Madinah, beliau menyembelih unta dan sapi.\""
            },
            {
                "number": 3256,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي شُرَيْحٍ الْكَعْبِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيُكْرِمْ ضَيْفَهُ جَائِزَتُهُ يَوْمُهُ وَلَيْلَتُهُ الضِّيَافَةُ ثَلَاثَةُ أَيَّامٍ وَمَا بَعْدَ ذَلِكَ فَهُوَ صَدَقَةٌ وَلَا يَحِلُّ لَهُ أَنْ يَثْوِيَ عِنْدَهُ حَتَّى يُحْرِجَهُقَالَ أَبُو دَاوُد قُرِئَ عَلَى الْحَارِثِ بْنِ مِسْكِينٍ وَأَنَا شَاهِدٌ أَخْبَرَكُمْ أَشْهَبُ قَالَ وَسُئِلَ مَالِكٌ عَنْ قَوْلِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَائِزَتُهُ يَوْمٌ وَلَيْلَةٌ قَالَ يُكْرِمُهُ وَيُتْحِفُهُ وَيَحْفَظُهُ يَوْمًا وَلَيْلَةً وَثَلَاثَةَ أَيَّامٍ ضِيَافَةً",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Sa'id Al Maqburi] dari [Abu Syuraih Al Ka'bi] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa beriman kepada Allah dan Hari Akhir, hendaknya ia muliakan tamunya, wajibnya (memberi jamuan) adalah satu hari satu malam, dan penjamuan tamu adalah tiga hari, setelah itu adalah sedekah. Dan seorang tamu tidak boleh bermalam, sehingga ia diusir.\" Abu Daud berkata; telah dibacakan riwayat di hadapan Al Harits bin Miskin dan aku menyaksikannya. Telah mengabarkan kepada kalian Asyhab Ia berkata, \"Malik ditanya tentang sabda Nabi shallallahu 'alaihi wasallam 'wajibnya (memberi jamuan) adalah satu hari satu malam', Anas menjawab, \"Memuliakan, berbuat baik dan menjaganya selama satu hari satu malam. Dan bertamu itu selama tiga hari.\""
            },
            {
                "number": 3257,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ وَمُحَمَّدُ بْنُ مَحْبُوبٍ قَالَا حَدَّثَنَا حَمَّادٌ عَنْ عَاصِمٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الضِّيَافَةُ ثَلَاثَةُ أَيَّامٍ فَمَا سِوَى ذَلِكَ فَهُوَ صَدَقَةٌ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] dan [Muhammad bin Mahbub] mereka berkata; telah menceritakan kepada kami [Hammad] dari ['Ashim] dari [Abu Shalih] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Penjamuan tamu adalah tiga hari, dan selain itu adalah sebuah sedekah.\""
            },
            {
                "number": 3258,
                "arab": "حَدَّثَنَا مُسَدَّدٌ وَخَلَفُ بْنُ هِشَامٍ قَالَا حَدَّثَنَا أَبُو عَوَانَةَ عَنْ مَنْصُورٍ عَنْ عَامِرٍ عَنْ أَبِي كَرِيمَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْلَةُ الضَّيْفِ حَقٌّ عَلَى كُلِّ مُسْلِمٍ فَمَنْ أَصْبَحَ بِفِنَائِهِ فَهُوَ عَلَيْهِ دَيْنٌ إِنْ شَاءَ اقْتَضَى وَإِنْ شَاءَ تَرَكَ",
                "id": "Telah menceritakan kepada kami [Musaddad] dan [Khalaf bin Hisyam] mereka berkata; telah menceritakan kepada kami [Abu 'Awanah] dari [Manshur] dari ['Amir] dari [Abu Karimah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Malam bertamu adalah kewajiban atas setiap Muslim 9untuk memuliakannya), maka barangsiapa diwaktu pagi ia (tamu) berada di halaman rumahnya, maka itu adalah hutang; jika mau ia boleh menjamu dan jika tidak maka ia boleh membiarkannya.\""
            },
            {
                "number": 3259,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ شُعْبَةَ حَدَّثَنِي أَبُو الْجُودِيِّ عَنْ سَعِيدِ بْنِ أَبِي الْمُهَاجِرِ عَنْ الْمِقْدَامِ أَبِي كَرِيمَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّمَا رَجُلٍ أَضَافَ قَوْمًا فَأَصْبَحَ الضَّيْفُ مَحْرُومًا فَإِنَّ نَصْرَهُ حَقٌّ عَلَى كُلِّ مُسْلِمٍ حَتَّى يَأْخُذَ بِقِرَى لَيْلَةٍ مِنْ زَرْعِهِ وَمَالِهِ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Syu'bah] telah menceritakan kepadaku [Abu Al Judi] dari [Sa'id bin Al Muhajir] dari [Al Miqdam Abu Karimah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Laki-laki manapun yang datang kepada suatu kaum sebagai tamu, kemudian tamu tersebut terhalang mendapatkan jamuan, maka atas setiap Muslim wajib menolongnya hingga ia mendapatkan jamuan pada malam hari dari tanaman serta harta orang yang kedatangan tamu.\""
            },
            {
                "number": 3260,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ أَبِي الْخَيْرِ عَنْ عُقْبَةَ بْنِ عَامِرٍ أَنَّهُ قَالَقُلْنَا يَا رَسُولَ اللَّهِ إِنَّكَ تَبْعَثُنَا فَنَنْزِلُ بِقَوْمٍ فَمَا يَقْرُونَنَا فَمَا تَرَى فَقَالَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنْ نَزَلْتُمْ بِقَوْمٍ فَأَمَرُوا لَكُمْ بِمَا يَنْبَغِي لِلضَّيْفِ فَاقْبَلُوا فَإِنْ لَمْ يَفْعَلُوا فَخُذُوا مِنْهُمْ حَقَّ الضَّيْفِ الَّذِي يَنْبَغِي لَهُمْقَالَ أَبُو دَاوُد وَهَذِهِ حُجَّةٌ لِلرَّجُلِ يَأْخُذُ الشَّيْءَ إِذَا كَانَ لَهُ حَقًّا",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Al Laits] dari [Yazid bin Abu Habib] dari [Abu Al Khair] dari ['Uqbah bin 'Amir] bahwa ia berkata, \"Kami bertanya, \"Wahai Rasulullah, ketika tuan mengirim kami, maka kami singgah di suatu kaum, namun mereka tidak mau menjamu kami, bagaimana pendapat anda?\" Rasulullah shallallahu 'alaihi wasallam lalu bersabda kepada kami: \"Apabila kalian singgah di suatu kaum, lalu mereka memberikan apa yang layak bagi tamu maka terimalah, namun jika mereka tidak melakukannya maka ambillah apa yang berhak bagi seorang tamu dari mereka.\" Abu Daud berkata, \"Ini adalah dalil bagi seorang laki-laki untuk mengambil jika sesuatu itu adalah haknya.\""
            },
            {
                "number": 3261,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ الْمَرْوَزِيُّ حَدَّثَنِي عَلِيُّ بْنُ الْحُسَيْنِ بْنِ وَاقِدٍ عَنْ أَبِيهِ عَنْ يَزِيدَ النَّحْوِيِّ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ{ لَا تَأْكُلُوا أَمْوَالَكُمْ بَيْنَكُمْ بِالْبَاطِلِ إِلَّا أَنْ تَكُونَ تِجَارَةً عَنْ تَرَاضٍ مِنْكُمْ }فَكَانَ الرَّجُلُ يَحْرَجُ أَنْ يَأْكُلَ عِنْدَ أَحَدٍ مِنْ النَّاسِ بَعْدَ مَا نَزَلَتْ هَذِهِ الْآيَةُ فَنَسَخَ ذَلِكَ الْآيَةُ الَّتِي فِي النُّورِ قَالَ لَيْسَ عَلَيْكُمْ جُنَاحٌ أَنْ تَأْكُلُوا مِنْ بُيُوتِكُمْ إِلَى قَوْلِهِ أَشْتَاتًا كَانَ الرَّجُلُ الْغَنِيُّ يَدْعُو الرَّجُلَ مِنْ أَهْلِهِ إِلَى الطَّعَامِ قَالَ إِنِّي لَأَجَّنَّحُ أَنْ آكُلَ مِنْهُ وَالتَّجَنُّحُ الْحَرَجُ وَيَقُولُ الْمِسْكِينُ أَحَقُّ بِهِ مِنِّي فَأُحِلَّ فِي ذَلِكَ أَنْ يَأْكُلُوا مِمَّا ذُكِرَ اسْمُ اللَّهِ عَلَيْهِ وَأُحِلَّ طَعَامُ أَهْلِ الْكِتَابِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Muhammad Al Marwazi] telah menceritakan kepadaku [Ali bin Al Husain bin Waqid] dari [Ayahnya] dari [Yazid An Nahwi] dari [Ikrimah] dari [Ibnu Abbas] ia berkata, \"Firman Allah: '(Janganlah kamu saling memakan harta sesamamu dengan jalan yang batil, kecuali dengan jalan perniagaan yang berlaku dengan suka sama-suka di antara kamu) ' (Qs. An Nisaa: 29), maka setelah ayat tersebut turun, seseorang merasa tidak enak untuk makan di rumah orang lain, kemudian hal tersebut dihapuskan oleh ayat yang ada dalam Surat An Nuur: '(dan tidak (pula) ada halangan bagi dirimu sendiri untuk makan (bersama-sama mereka) di rumah kamu sendiri atau di rumah bapak-bapakmu, di rumah ibu-ibumu, di rumah saudara- saudaramu yang laki-laki, di rumah saudaramu yang perempuan, di rumah saudara bapakmu yang laki-laki, di rumah saudara bapakmu yang perempuan, di rumah saudara ibumu yang laki-laki, di rumah saudara ibumu yang perempuan, di rumah yang kamu miliki kuncinya atau di rumah kawan-kawanmu. Tidak ada halangan bagi kamu makan bersama-sama mereka atau sendirian) '. Maka orang yang kaya mengundang seseorang dari keluarganya untuk makan. Ia berkata, \"Sungguh aku merasa ada ganjalan untuk makan darinya.\" Tajannuh adalah perasaan mengganjal dalam hati. Ia berkata; orang miskin lebih berhak daripada diriku. Kemudian dihalalkan dalam hal tersebut untuk maka apa yang disebutkan padanya nama Allah, dan telah dihalalkan makanan ahli kitab.\""
            },
            {
                "number": 3262,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ زَيْدِ بْنِ أَبِي الزَّرْقَاءِ حَدَّثَنَا أَبِي حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ عَنْ الزُّبَيْرِ بْنِ الْخِرِّيتِ قَالَ سَمِعْتُ عِكْرِمَةَ يَقُولُ كَانَ ابْنُ عَبَّاسٍ يَقُولُإِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ طَعَامِ الْمُتَبَارِيَيْنِ أَنْ يُؤْكَلَقَالَ أَبُو دَاوُد أَكْثَرُ مَنْ رَوَاهُ عَنْ جَرِيرٍ لَا يَذْكُرُ فِيهِ ابْنَ عَبَّاسٍ وَهَارُونُ النَّحْوِيُّ ذَكَرَ فِيهِ ابْنَ عَبَّاسٍ أَيْضًا وَحَمَّادُ بْنُ زَيْدٍ لَمْ يَذْكُرْ ابْنَ عَبَّاسٍ",
                "id": "Telah menceritakan kepada kami [Harun bin Zaid bin Abu Az Zarqa`] telah menceritakan kepada kami [Ayahku] telah menceritakan kepada kami [Jarir bin Hazim] dari [Az Zubair bin Al Khirrit] ia berkata; aku mendengar [Ikrimah] berkata, \" [Ibnu Abbas] berkata, \"Sesungguhnya Nabi shallallahu 'alaihi wasallam melarang makan makanan dua orang yang saling membanggakan diri.\" Abu Daud berkata, \"Kebanyakkan orang yang meriwayatkan hadits tersebut dari Jarir tidak menyebutkan nama Ibnu Abbas, sementara [Harun An Nahwi] menyebutkan nama Ibnu Abbas juga. Demikian juga dengan [Hammad bin Zaid], ia tidak menyebutkan nama Ibnu Abbas.\""
            },
            {
                "number": 3263,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ أَخْبَرَنَا حَمَّادٌ عَنْ سَعِيدِ بْنِ جُمْهَانَ عَنْ سَفِينَةَ أَبِي عَبْدِ الرَّحْمَنِأَنَّ رَجُلًا أَضَافَ عَلِيَّ بْنَ أَبِي طَالِبٍ فَصَنَعَ لَهُ طَعَامًا فَقَالَتْ فَاطِمَةُ لَوْ دَعَوْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَكَلَ مَعَنَا فَدَعُوهُ فَجَاءَ فَوَضَعَ يَدَهُ عَلَى عِضَادَتَيْ الْبَابِ فَرَأَى الْقِرَامَ قَدْ ضُرِبَ بِهِ فِي نَاحِيَةِ الْبَيْتِ فَرَجَعَ فَقَالَتْ فَاطِمَةُ لِعَلِيٍّ الْحَقْهُ فَانْظُرْ مَا رَجَعَهُ فَتَبِعْتُهُ فَقُلْتُ يَا رَسُولَ اللَّهِ مَا رَدَّكَ فَقَالَ إِنَّهُ لَيْسَ لِي أَوْ لِنَبِيٍّ أَنْ يَدْخُلَ بَيْتًا مُزَوَّقًا",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah mengabarkan kepada kami [Hammad] dari [Sa'id bin Jumhan] dari [Safinah Abu Abdurrahman] bahwa seorang laki-laki datang kepada Ali bin Abu Thalib sebagai seorang tamu, kemudian Ali membuatkan makanan untuknya. Fatimah kemudian berkata, \"Seandainya kita mengundang Rasulullah shallallahu 'alaihi wasallam dan makan bersama kita, maka akan lebih baik.\" Kemudian mereka mengundang beliau, setelah itu beliau datang dan meletakkan tangannya di atas kedua sisi pintu. Ketika melihat tabir dari katun yang terpasang di salah satu sisi pintu, beliau pun kembali pulang. Fatimah lalu berkata kepada Ali, \"Kejarlah beliau dan lihat apa yang membuat beliau kembali pulang.\" Lalu aku mengikuti beliau dan aku katakan, \"Wahai Rasulullah, apakah yang membuat anda kembali pulang?\" Kemudian beliau menjawab: \"Sesungguhnya tidak boleh bagiku dan bagi seorang nabi untuk memasuki sebuah rumah yang diperhias.\""
            },
            {
                "number": 3264,
                "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ عَبْدِ السَّلَامِ بْنِ حَرْبٍ عَنْ أَبِي خَالِدٍ الدَّالَانِيِّ عَنْ أَبِي الْعَلَاءِ الْأَوْدِيِّ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ الْحِمْيَرِيِّ عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا اجْتَمَعَ الدَّاعِيَانِ فَأَجِبْ أَقْرَبَهُمَا بَابًا فَإِنَّ أَقْرَبَهُمَا بَابًا أَقْرَبَهُمَا جِوَارًا وَإِنْ سَبَقَ أَحَدُهُمَا فَأَجِبْ الَّذِي سَبَقَ",
                "id": "Telah menceritakan kepada kami [Hannad bin As Sarri] dari [Abdussalam bin Harb] dari [Abu Khalid Ad Dalani] dari [Abu Al 'Ala Al Audi] dari [Humaid bin Abdurrahman Al Himyari] dari [seorang] sahabat Nabi shallallahu 'alaihi wasallam, bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Apabila terdapat dua orang yang mengundang dengan bersama-sama maka penuhilah undangan orang yang paling dekat pintunya, karena sesungguhnya orang yang paling dekat pintunya adalah orang yang paling dekat pertolongannya. Dan apabila ada yang lebih dahulu di antara keduanya, maka penuhilah undangan orang yang terlebih dahulu!\""
            },
            {
                "number": 3265,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ وَمُسَدَّدٌ الْمَعْنَى قَالَ أَحْمَدُ حَدَّثَنِي يَحْيَى الْقَطَّانُ عَنْ عُبَيْدِ اللَّهِ قَالَ حَدَّثَنِي نَافِعٌ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا وُضِعَ عَشَاءُ أَحَدِكُمْ وَأُقِيمَتْ الصَّلَاةُ فَلَا يَقُومُ حَتَّى يَفْرُغَزَادَ مُسَدَّدٌ وَكَانَ عَبْدُ اللَّهِ إِذَا وُضِعَ عَشَاؤُهُ أَوْ حَضَرَ عَشَاؤُهُ لَمْ يَقُمْ حَتَّى يَفْرُغَ وَإِنْ سَمِعَ الْإِقَامَةَ وَإِنْ سَمِعَ قِرَاءَةَ الْإِمَامِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] dan [Musaddad] secara makna, Ahmad berkata; telah menceritakan kepadaku [Yahya Al Qaththan] dari ['Ubaidullah] ia berkata; telah menceritakan kepadaku [Nafi'] dari [Ibnu Umar] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Apabila makan malam salah seorang di antara kalian telah dihidangkan, atau telah siap makan malamnya, maka janganlah ia berdiri hingga selesai, walaupun ia mendengar iqamah dan mendengar bacaan imam.\""
            },
            {
                "number": 3266,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ بَزِيعٍ حَدَّثَنَا مُعَلَّى يَعْنِي ابْنَ مَنْصُورٍ عَنْ مُحَمَّدِ بْنِ مَيْمُونٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُؤَخَّرُ الصَّلَاةُ لِطَعَامٍ وَلَا لِغَيْرِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Hatim bin Bazi'] telah menceritakan kepada kami [Mua'lla bin Manshur] dari [Muhammad bin Maimun] dari [Ja'far bin Muhammad] dari [Ayahnya] dari [Jabir bin Abdullah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Shalat tidak boleh ditunda karena makanan dan karena yang lainnya.\""
            },
            {
                "number": 3267,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُسْلِمٍ الطُّوسِيُّ حَدَّثَنَا أَبُو بَكْرٍ الْحَنَفِيُّ حَدَّثَنَا الضَّحَّاكُ بْنُ عُثْمَانَ عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدِ بْنِ عُمَيْرٍ قَالَكُنْتُ مَعَ أَبِي فِي زَمَانِ ابْنِ الزُّبَيْرِ إِلَى جَنْبِ عَبْدِ اللَّهِ بْنِ عُمَرَ فَقَالَ عَبَّادُ بْنُ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ إِنَّا سَمِعْنَا أَنَّهُ يُبْدَأُ بِالْعَشَاءِ قَبْلَ الصَّلَاةِ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ وَيْحَكَ مَا كَانَ عَشَاؤُهُمْ أَتُرَاهُ كَانَ مِثْلَ عَشَاءِ أَبِيكَ",
                "id": "Telah menceritakan kepada kami [Ali bin Muslim Ath Thusi] telah menceritakan kepada kami [Abu Bakr Al Hanafi] telah menceritakan kepada kami [Adl Dlahhak bin Utsman] dari [Abdullah bin 'Ubaid bin 'Umair] ia berkata, \"Aku pernah bersama ayahku pada zaman kekhilafahan Ibnu Az Zubair menuju kepada [Abdullah bin Umar], kemudian 'Abbad bin Abdullah bin Az Zubair berkata, \"Sesungguhnya kami mendengar bahwa makan lebih didahulukan daripada shalat?\" Abdullah bin Umar menjawab, \"Celaka kami! Apa kamu kira makan malam mereka seperti makan malam ayah kamu? "
            },
            {
                "number": 3268,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا إِسْمَعِيلُ حَدَّثَنَا أَيُّوبُ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ مِنْ الْخَلَاءِ فَقُدِّمَ إِلَيْهِ طَعَامٌ فَقَالُوا أَلَا نَأْتِيكَ بِوَضُوءٍ فَقَالَ إِنَّمَا أُمِرْتُ بِالْوُضُوءِ إِذَا قُمْتُ إِلَى الصَّلَاةِ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Isma'il] telah menceritakan kepada kami [Ayyub] dari [Abdullah bin Abu Mulaikah] dari [Abdullah bin Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam pernah keluar dari toilet, kemudian disuguhkan makanan kepada beliau. Para sahabat pun bertanya, \"Tidakkah kami bawakan kepada anda air wudlu?\" Beliau menjawab: \"Hanyasanya aku diperintah untuk berwudlu apabila hendak melakukan shalat.\""
            },
            {
                "number": 3269,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا قَيْسٌ عَنْ أَبِي هَاشِمٍ عَنْ زَاذَانَ عَنْ سَلْمَانَ قَالَقَرَأْتُ فِي التَّوْرَاةِ أَنَّ بَرَكَةَ الطَّعَامِ الْوُضُوءُ قَبْلَهُ فَذَكَرْتُ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ بَرَكَةُ الطَّعَامِ الْوُضُوءُ قَبْلَهُ وَالْوُضُوءُ بَعْدَهُوَكَانَ سُفْيَانُ يَكْرَهُ الْوُضُوءَ قَبْلَ الطَّعَامِ قَالَ أَبُو دَاوُد وَهُوَ ضَعِيفٌ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Qais] dari [Abu Hasyim] dari [Zadzan] dari [Salman] ia berkata, \"Aku membaca dalam Taurat bahwa berkah makanan adalah dengan berwudlu sebelum makan. Lalu aku ceritakan hal tersebut kepada Nabi shallallahu 'alaihi wasallam, maka beliau bersabda: \"Berkah makanan adalah dengan berwudlu sebelum makan dan setelah makan.\" Sedangkan Sufyan tidak menyukai wudlu sebelum makan.\" Abu Daud berkata, \"Hadits tersebut adalah dla'if.\""
            },
            {
                "number": 3270,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي مَرْيَمَ حَدَّثَنَا عَمِّي يَعْنِي سَعَيدَ بْنَ الْحَكَمِ حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ أَخْبَرَنِي خَالِدُ بْنُ يَزِيدَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّهُ قَالَأَقْبَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ شِعْبٍ مِنْ الْجَبَلِ وَقَدْ قَضَى حَاجَتَهُ وَبَيْنَ أَيْدِينَا تَمْرٌ عَلَى تُرْسٍ أَوْ حَجَفَةٍ فَدَعَوْنَاهُ فَأَكَلَ مَعَنَا وَمَا مَسَّ مَاءً",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abu Maryam] telah menceritakan kepada kami pamanku [Sa'id bin Al Hakam] telah menceritakan kepada kami [Al Laits bin Sa'd] telah mengabarkan kepadaku [Khalid bin Yazid] dari [Abu Az Zubair] dari [Jabir bin Abdullah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah datang dari jalan sebuah gunung dalam keadaan telah menyelesaikan hajatnya, sementara di hadapan kami terdapat kurma di atas tameng, kemudian kami mengundang beliau, lalu beliau makan bersama kami dan tidak menyentuh air.\""
            },
            {
                "number": 3271,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ الْأَعْمَشِ عَنْ أبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَمَا عَابَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَعَامًا قَطُّ إِنْ اشْتَهَاهُ أَكَلَهُ وَإِنْ كَرِهَهُ تَرَكَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] telah mengabarkan kepada kami [Sufyan] dari [Al A'masy] dari [Abu Hazim] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam tidak pernah mencela makanan sama sekali, apabila senang maka beliau memakannya dan apabila tidak menyukai maka beliau meninggalkannya.\""
            },
            {
                "number": 3272,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ حَدَّثَنِي وَحْشِيُّ بْنُ حَرْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ أَصْحَابَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالُوا يَا رَسُولَ اللَّهِ إِنَّا نَأْكُلُ وَلَا نَشْبَعُ قَالَ فَلَعَلَّكُمْ تَفْتَرِقُونَ قَالُوا نَعَمْ قَالَ فَاجْتَمِعُوا عَلَى طَعَامِكُمْ وَاذْكُرُوا اسْمَ اللَّهِ عَلَيْهِ يُبَارَكْ لَكُمْ فِيهِقَالَ أَبُو دَاوُد إِذَا كُنْتَ فِي وَلِيمَةٍ فَوُضِعَ الْعَشَاءُ فَلَا تَأْكُلْ حَتَّى يَأْذَنَ لَكَ صَاحِبُ الدَّارِ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Musa Ar Razi] telah menceritakan kepada kami [Al Walid bin Muslim] ia berkata; telah menceritakan kepadaku [Wahsyi bin Harb] dari [Ayahnya] dari [Kakeknya] bahwa para sahabat Nabi shallallahu 'alaihi wasallam berkata, \"Wahai Rasulullah, sesungguhnya kami makan dan tidak merasa kenyang?\" Beliau bersabda: \"Kemungkinan kalian makan sendiri-sendiri.\" Mereka menjawab, \"Ya.\" Beliau bersabda: \"Hendaklah kalian makan secara bersama-sama, dan sebutlah nama Allah, maka kalian akan diberi berkah padanya.\" Abu Daud berkata, \"Apabila engkau berada pada sebuah pesta kemudian dihidangkan makan malam, maka janganlah engkau memakannya hingga pemilik rumah mengizinkanmu.\""
            },
            {
                "number": 3273,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ خَلَفٍ حَدَّثَنَا أَبُو عَاصِمٍ عَنْ ابْنِ جُرَيْجٍ قَالَ أَخْبَرَنِي أَبُو الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِسَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا دَخَلَ الرَّجُلُ بَيْتَهُ فَذَكَرَ اللَّهَ عِنْدَ دُخُولِهِ وَعِنْدَ طَعَامِهِ قَالَ الشَّيْطَانُ لَا مَبِيتَ لَكُمْ وَلَا عَشَاءَ وَإِذَا دَخَلَ فَلَمْ يُذْكَرْ اللَّهَ عِنْدَ دُخُولِهِ قَالَ الشَّيْطَانُ أَدْرَكْتُمْ الْمَبِيتَ فَإِذَا لَمْ يَذْكُرْ اللَّهَ عِنْدَ طَعَامِهِ قَالَ أَدْرَكْتُمْ الْمَبِيتَ وَالْعَشَاءَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Khalaf] telah menceritakan kepada kami [Abu 'Ashim] dari [Ibnu Juraij] ia berkata; telah mengabarkan kepadaku [Abu Az Zubair] dari [Jabir bin Abdullah] ia mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Apabila seseorang memasuki rumahnya dan menyebutkan nama Allah ketika masuk dan ketika makan, maka setan berkata, 'Tidak ada tempat bermalam bagi kalian dan tidak ada makan malam'. Dan apabila ia masuk rumah dan tidak menyebutkan nama Allah ketika masuk maka setan berkata, 'Kalian mendapatkan tempat bermalam'. Kemudian apabila ia tidak menyebutkan nama Allah ketika makan maka setan berkata, 'Kalian mendapatkan tempat bermalam dan makan malam'.\""
            },
            {
                "number": 3274,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ خَيْثَمَةَ عَنْ أَبِي حُذَيْفَةَ عَنْ حُذَيْفَةَ قَالَكُنَّا إِذَا حَضَرْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَعَامًا لَمْ يَضَعْ أَحَدُنَا يَدَهُ حَتَّى يَبْدَأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَإِنَّا حَضَرْنَا مَعَهُ طَعَامًا فَجَاءَ أَعْرَابِيٌّ كَأَنَّمَا يُدْفَعُ فَذَهَبَ لِيَضَعَ يَدَهُ فِي الطَّعَامِ فَأَخَذَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدِهِ ثُمَّ جَاءَتْ جَارِيَةٌ كَأَنَّمَا تُدْفَعُ فَذَهَبَتْ لِتَضَعَ يَدَهَا فِي الطَّعَامِ فَأَخَذَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدِهَا وَقَالَ إِنَّ الشَّيْطَانَ لَيَسْتَحِلُّ الطَّعَامَ الَّذِي لَمْ يُذْكَرْ اسْمُ اللَّهِ عَلَيْهِ وَإِنَّهُ جَاءَ بِهَذَا الْأَعْرَابِيِّ يَسْتَحِلُّ بِهِ فَأَخَذْتُ بِيَدِهِ وَجَاءَ بِهَذِهِ الْجَارِيَةِ يَسْتَحِلُّ بِهَا فَأَخَذْتُ بِيَدِهَا فَوَالَّذِي نَفْسِي بِيَدِهِ إِنَّ يَدَهُ لَفِي يَدِي مَعَ أَيْدِيهِمَا",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Khaitsamah] dari [Abu Hudzaifah] dari [Hudzaifah] ia berkata, \"Jika kami bersama Rasulullah shallallahu 'alaihi wasallam menghadiri jamuan makanan, maka tidak ada seorangpun di antara kami yang meletakkan tangannya hingga Rasulullah shallallahu 'alaihi wasallam memulai. Dan kami pernah bersama beliau menghadiri jamuan makan, lalu seorang Arab badui datang yang seolah-oleh ia terdorong, lalu ia meletakkan tangannya pada makanan, namun Rasulullah shallallahu 'alaihi wasallam memegang tangannya. Kemudian seorang budak wanita datang sepertinya ia terdorong hendak meletakkan tangannya pada makanan, namun beliau memegang tangannya dan berkata: \"Sungguh, setan menghalalkan makanan yang tidak disebutkan nama Allah padanya. Setan datang bersama orang badui ini, dengannya setan ingin menghalalkan makanan tersebut, maka aku pegang tangannya. Dan setan tersebut juga datang bersama budak wanita ini, dengannya ia ingin menghalalkan makanan tersebut, maka aku pegang tangannya. Demi Dzat yang jiwaku ada di tangan-Nya, sesungguhnya tangan setan tersebut ada di tanganku bersama tangan mereka berdua.\""
            },
            {
                "number": 3275,
                "arab": "حَدَّثَنَا مُؤَمَّلُ بْنُ هِشَامٍ حَدَّثَنَا إِسْمَعِيلُ عَنْ هِشَامٍ يَعْنِي ابْنَ أَبِي عَبْدِ اللَّهِ الدَّسْتُوَائِيَّ عَنْ بُدَيْلٍ عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدٍ عَنْ امْرَأَةٍ مِنْهُمْ يُقَالُ لَهَا أُمُّ كُلْثُومٍ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَاأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا أَكَلَ أَحَدُكُمْ فَلْيَذْكُرْ اسْمَ اللَّهِ تَعَالَى فَإِنْ نَسِيَ أَنْ يَذْكُرَ اسْمَ اللَّهِ تَعَالَى فِي أَوَّلِهِ فَلْيَقُلْ بِسْمِ اللَّهِ أَوَّلَهُ وَآخِرَهُ",
                "id": "Telah menceritakan kepada kami [Muammal bin Hisyam] telah menceritakan kepada kami [Isma'il] dari [Hisyam bin Abu Abdullah Ad Dastuwai] dari [Budail] dari [Abdullah bin 'Ubaid] dari seorang wanita di antara mereka yang dipanggil [Ummu Kultsum] dari [Aisyah] radliallahu 'anhuma, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang di antara kalian makan, maka hendaknya ia menyebutkan nama Allah Ta'ala. Jika ia lupa untuk menyebut nama Allah Ta'ala di awal, hendaklah ia mengucapkan: BISMILLAAHI AWWALAHU WA AAKHIRAHU (dengan nama Allah pada awal dan akhirnya) '.\""
            },
            {
                "number": 3276,
                "arab": "حَدَّثَنَا مُؤَمَّلُ بْنُ الْفَضْلِ الْحَرَّانِيُّ حَدَّثَنَا عِيسَى يَعْنِي ابْنَ يُونُسَ حَدَّثَنَا جَابِرُ بْنُ صُبْحٍ حَدَّثَنَا الْمُثَنَّى بْنُ عَبْدِ الرَّحْمَنِ الْخُزَاعِيُّ عَنْ عَمِّهِ أُمَيَّةَ بْنِ مَخْشِيٍّ وَكَانَ مَنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَالِسًا وَرَجُلٌ يَأْكُلُ فَلَمْ يُسَمِّ حَتَّى لَمْ يَبْقَ مِنْ طَعَامِهِ إِلَّا لُقْمَةٌ فَلَمَّا رَفَعَهَا إِلَى فِيهِ قَالَ بِسْمِ اللَّهِ أَوَّلَهُ وَآخِرَهُ فَضَحِكَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ قَالَ مَا زَالَ الشَّيْطَانُ يَأْكُلُ مَعَهُ فَلَمَّا ذَكَرَ اسْمَ اللَّهِ عَزَّ وَجَلَّ اسْتَقَاءَ مَا فِي بَطْنِهِقَالَ أَبُو دَاوُد جَابِرُ بْنُ صُبْحٍ جَدُّ سُلَيْمَانَ بْنَ حَرْبٍ مِنْ قِبَلِ أُمِّهِ",
                "id": "Telah menceritakan kepada kami [Muammal bin Al Fadll Al Harrani] telah menceritakan kepada kami [Isa bin Yunus] telah menceritakan kepada kami [Jabir bin Shubh] telah menceritakan kepada kami [Al Mutsanna bin Abdurrahman Al Khuza'i] dari pamannya [Umayyah bin Makhsyi] seorang sahabat Rasulullah shallallahu 'alaihi wasallam, ia berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah duduk, sementara ada seorang laki-laki makan dan tidak menyebutkan nama Allah hingga makanannya hanya tersisa satu suap, kemudian tatkala ia mengangkatnya ke mulut ia mengucapkan; BISMILLAAHI AWWALAHU WA AAKHIRAHU (Dengan nama Allah, pada awal dan akhirnya), maka Nabi shallallahu 'alaihi wasallam tertawa kemudian berkata: \"Setan terus makan bersamanya, kemudian tatkala ia menyebutkan nama Allah Azza wa Jalla, maka setan memuntahkan apa yang ada di perutnya.\" Abu Daud berkata, \"Jabir bin Shubh adalah kakek Sulaiman bin Harb dari pihak ibunya.\""
            },
            {
                "number": 3277,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ عَلِيِّ بْنِ الْأَقْمَرِ قَالَ سَمِعْتُ أَبَا جُحَيْفَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا آكُلُ مُتَّكِئًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] telah mengabarkan kepada kami [Sufyan] dari [Ali bin Al Aqmar] ia berkata; aku mendengar [Abu Juhaifah] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku tidak makan dengan bersandar.\""
            },
            {
                "number": 3278,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ ثَابِتٍ الْبُنَانِيِّ عَنْ شُعَيْبِ بْنِ عَبْدِ اللَّهِ بْنِ عَمْرٍو عَنْ أَبِيهِ قَالَمَا رُئِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْكُلُ مُتَّكِئًا قَطُّ وَلَا يَطَأُ عَقِبَهُ رَجُلَانِ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] dari [Tsabit Al Bunani] dari [Syu'aib bin Abdullah bin 'Amru] dari [Ayahnya] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam tidak pernah terlihat makan dalam keadaan bersandar sama sekali, dan tidak ada dua orangpun yang berjalan di belakang beliau.\""
            },
            {
                "number": 3279,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ أَخْبَرَنَا وَكِيعٌ عَنْ مُصْعَبِ بْنِ سُلَيْمٍ قَالَ سَمِعْتُ أَنَسًا يَقُولُبَعَثَنِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَجَعْتُ إِلَيْهِ فَوَجَدْتُهُ يَأْكُلُ تَمْرًا وَهُوَ مُقْعٍ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Musa Ar Razi] telah mengabarkan kepada kami [Waki'] dari [Mush'ab bin Sulaim] ia berkata; aku mendengar [Anas] berkata, \"Nabi shallallahu 'alaihi wasallam mengutusku, ketika kembali aku melihat beliau makan kurma dengan duduk (di atas bokong dengan menegakkan kedua betisnya).\""
            },
            {
                "number": 3280,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا شُعْبَةُ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا أَكَلَ أَحَدُكُمْ طَعَامًا فَلَا يَأْكُلْ مِنْ أَعْلَى الصَّحْفَةِ وَلَكِنْ لِيَأْكُلْ مِنْ أَسْفَلِهَا فَإِنَّ الْبَرَكَةَ تَنْزِلُ مِنْ أَعْلَاهَا",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Syu'bah] dari ['Atha bin As Saib] dari [Sa'id bin Jubair] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Apabila salah seorang di antara kalian makan makanan maka janganlah ia makan dari atas piring, tetapi hendaknya ia makan dari bawahnya, sesungguhnya berkah turun dari atasnya.\" "
            },
            {
                "number": 3281,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ الْحِمْصِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ عِرْقٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُسْرٍ قَالَكَانَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَصْعَةٌ يُقَالُ لَهَا الْغَرَّاءُ يَحْمِلُهَا أَرْبَعَةُ رِجَالٍ فَلَمَّا أَضْحَوْا وَسَجَدُوا الضُّحَى أُتِيَ بِتِلْكَ الْقَصْعَةِ يَعْنِي وَقَدْ ثُرِدَ فِيهَا فَالْتَفُّوا عَلَيْهَا فَلَمَّا كَثَرُوا جَثَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَعْرَابِيٌّ مَا هَذِهِ الْجِلْسَةُ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ جَعَلَنِي عَبْدًا كَرِيمًا وَلَمْ يَجْعَلْنِي جَبَّارًا عَنِيدًا ثُمَّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُوا مِنْ حَوَالَيْهَا وَدَعُوا ذِرْوَتَهَا يُبَارَكْ فِيهَا",
                "id": "Telah menceritakan kepada kami ['Amru bin Utsman Al Himshi] telah menceritakan kepada kami [Ayahku] telah menceritakan kepada kami [Muhammad bin Abdurrahman bin 'Irq] telah menceritakan kepada kami [Abdullah bin Busr] ia berkata, \"Nabi shallallahu 'alaihi wasallam memiliki nampan yang disebut Gharra`, dan hanya bisa diangkat oleh empat orang laki-laki. Di pagi hari saat mereka telah melaksanakan shalat dluha, nampan tersebut dihadirkan dan telah penuh dengan bubur. Orang-orang pun mengerumuninya, ketika jumlah mereka telah banyak, Rasulullah shallallahu 'alaihi wasallam duduk di atas lututnya. Seorang Arab badui lalu berkata, \"Duduk apakah ini?\" Nabi shallallahu 'alaihi wasallam menjawab: \"Sesungguhnya Allah telah menjadikan aku seorang hamba yang mulia, bukan seorang yang otoriter dan pembangkang.\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda lagi: \"Makanlah dari sekitarnya dan biarkan bagian atasnya maka akan diberkahi padanya.\""
            },
            {
                "number": 3282,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا كَثِيرُ بْنُ هِشَامٍ عَنْ جَعْفَرِ بْنِ بُرْقَانَ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ مَطْعَمَيْنِ عَنْ الْجُلُوسِ عَلَى مَائِدَةٍ يُشْرَبُ عَلَيْهَا الْخَمْرُ وَأَنْ يَأْكُلَ الرَّجُلُ وَهُوَ مُنْبَطِحٌ عَلَى بَطْنِهِقَالَ أَبُو دَاوُد هَذَا الْحَدِيثُ لَمْ يَسْمَعْهُ جَعْفَرٌ مِنْ الزُّهْرِيِّ وَهُوَ مُنْكَرٌ حَدَّثَنَا هَارُونُ بْنُ زَيْدِ بْنِ أَبِي الزَّرْقَاءِ حَدَّثَنَا أَبِي حَدَّثَنَا جَعْفَرٌ أَنَّهُ بَلَغَهُ عَنْ الزُّهْرِيِّ بِهَذَا الْحَدِيثِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Katsir bin Hisyam] dari [Ja'far bin Burqan] dari [Zuhri] dari [Salim] dari [Ayahnya] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam telah melarang dari dua tempat makan; duduk menghadap hidangan yang padanya diminum khamer dan serta seseorang makan dalam keadaan tengkurap.\" Abu Daud berkata, \"Hadits ini adalah hadits yang tidak didengar oleh Ja'far dari Az Zuhri, dan hadits tersebut adalah hadits mungkar.\" Telah menceritakan kepada kami [Harun bin Zaid bin Abu Az Zarqa`] telah menceritakan kepada kami [Ayahku] telah menceritakan kepada kami [Ja'far] bahwa hadits ini telah sampai kepadanya dari [Az Zuhri].\""
            },
            {
                "number": 3283,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ أَخْبَرَنِي أَبُو بَكْرِ بْنُ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ جَدِّهِ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا أَكَلَ أَحَدُكُمْ فَلْيَأْكُلْ بِيَمِينِهِ وَإِذَا شَرِبَ فَلْيَشْرَبْ بِيَمِينِهِ فَإِنَّ الشَّيْطَانَ يَأْكُلُ بِشِمَالِهِ وَيَشْرَبُ بِشِمَالِهِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] telah mengabarkan kepadaku [Abu Bakr bin 'Ubaidullah bin Abdullah bin Umar] dari kakeknya [Ibnu Umar] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian makan, maka hendaknya ia makan dengan menggunakan tangan kanannya, dan apabila minum maka hendaknya ia minum dengan tangan kanannya, karena sesungguhnya setan makan dan minum menggunakan tangan kirinya.\""
            },
            {
                "number": 3284,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ لُوَيْنٌ عَنْ سُلَيْمَانَ بْنِ بِلَالٍ عَنْ أَبِي وَجْزَةَ عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ادْنُ بُنَيَّ فَسَمِّ اللَّهَ وَكُلْ بِيَمِينِكَ وَكُلْ مِمَّا يَلِيكَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Sulaiman Luwain] dari [Sulaiman bin Bilal] dari [Abu Wajzah] dari [Umar bin Abu Salamah] ia berkata, \"Nabi shallallahu 'alaihi wasallam berkata: \"Wahai anakku mendekatlah, sebutlah nama Allah, makanlah dengan tangan kananmu, serta makanlah dari yang dekat.\""
            },
            {
                "number": 3285,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا أَبُو مَعْشَرٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَقْطَعُوا اللَّحْمَ بِالسِّكِّينِ فَإِنَّهُ مِنْ صَنِيعِ الْأَعَاجِمِ وَانْهَسُوهُ فَإِنَّهُ أَهْنَأُ وَأَمْرَأُقَالَ أَبُو دَاوُد وَلَيْسَ هُوَ بِالْقَوِيِّ",
                "id": "Telah menceritakan kepada kami [Sa'id bin Manshur] telah menceritakan kepada kami [Abu Ma'syar] dari [Hisyam bin 'Urwah] dari [Ayahnya] dari [Aisyah] radliallahu 'anhuma, ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian memotong daging menggunakan pisau, sesungguhnya hal tersebut termasuk perbuatan orang-orang 'Ajam (selain Arab), gigitlah daging tersebut karena sesungguhnya hal tersebut lebih nyaman dan nikmat.\" Abu Dawud berkata, \"Hadits ini tidak kuat.\""
            },
            {
                "number": 3286,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا ابْنُ عُلَيَّةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ إِسْحَقَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ مُعَاوِيَةَ عَنْ عُثْمَانَ بْنِ أَبِي سُلَيْمَانَ عَنْ صَفْوَانَ بْنِ أُمَيَّةَ قَالَكُنْتُ آكُلُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَآخُذُ اللَّحْمَ بِيَدِي مِنْ الْعَظْمِ فَقَالَ أَدْنِ الْعَظْمَ مِنْ فِيكَ فَإِنَّهُ أَهْنَأُ وَأَمْرَأُقَالَ أَبُو دَاوُد عُثْمَانُ لَمْ يَسْمَعْ مِنْ صَفْوَانَ وَهُوَ مُرْسَلٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Ibnu 'Ulaiyyah] dari [Abdurrahman bin Ishaq] dari [Abdurrahman bin Mu'awiyah] dari [Utsman bin Abu Sulaiman] dari [Shafwan bin Umayyah] ia berkata, \"Aku pernah makan bersama Nabi shallallahu 'alaihi wasallam, lalu aku mengambil daging dari tulang menggunakan tanganku. Maka beliau pun bersabda: \"Dekatkanlah tulang dari mulutmu, sesungguhnya hal tersebut lebih nyaman dan nikmat.\" Abu Daud berkata, \"Utsman tidak mendengar dari Shafwan, dan hadits tersebut adalah hadits mursal.\""
            },
            {
                "number": 3287,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا أَبُو دَاوُدَ عَنْ زُهَيْرٍ عَنْ أَبِي إِسْحَقَ عَنْ سَعْدِ بْنِ عِيَاضٍ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَكَانَ أَحَبُّ الْعُرَاقِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عُرَاقَ الشَّاةِحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو دَاوُدَ بِهَذَا الْإِسْنَادِ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعْجِبُهُ الذِّرَاعُ قَالَ وَسُمَّ فِي الذِّرَاعِ وَكَانَ يَرَى أَنَّ الْيَهُودَ هُمْ سَمُّوهُ",
                "id": "Telah menceritakan kepada kami [Harun bin Abdullah] telah menceritakan kepada kami [Abu Daud] dari [Zuhair] dari [Abu Ishaq] dari [Sa'd bin 'Iyadl] dari [Abdullah bin Mas'ud] ia berkata, \"Kuah yang paling disukai Rasulullah shallallahu 'alaihi wasallam adalah kuah daging kambing.\" Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Abu Daud] dengan sanad ini. Ia berkata, \"Nabi shallallahu 'alaihi wasallam menyukai paha kambing.\" Ia berkata, \"Pernah paha kambing diberi racun, dan beliau melihat bahwa yang orang-orang Yahudi yang telah meracuninya.\""
            },
            {
                "number": 3288,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ يَقُولُإِنَّ خَيَّاطًا دَعَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِطَعَامٍ صَنَعَهُ قَالَ أَنَسٌ فَذَهَبْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى ذَلِكَ الطَّعَامِ فَقُرِّبَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُبْزًا مِنْ شَعِيرٍ وَمَرَقًا فِيهِ دُبَّاءٌ وَقَدِيدٌ قَالَ أَنَسٌ فَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَتَبَّعُ الدُّبَّاءَ مِنْ حَوَالَيْ الصَّحْفَةِ فَلَمْ أَزَلْ أُحِبُّ الدُّبَّاءَ بَعْدَ يَوْمَئِذٍ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Ishaq bin Abdullah bin Abu Thalhah] bahwa ia mendengar [Anas bin Malik] berkata, \"Seorang penjahit mengundang Rasulullah shallallahu 'alaihi wasallam untuk menghadiri makanan yang telah ia buat.\" Anas berkata, \"Lalu aku pergi bersama Rasulullah shallallahu 'alaihi wasallam menghadiri makanan tersebut, kemudian makanan tersebut didekatkan kepada Rasulullah shallallahu 'alaihi wasallam yang berupa roti yang terbuat dari gandum serta kuah yang padanya terdapat labu dan dendeng.\" Anas berkata, \"Aku melihat Rasulullah shallallahu 'alaihi wasallam mencari-cari labu yang ada di nampan tersebut, maka semenjak itu aku suka makan labu.\""
            },
            {
                "number": 3289,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ حَسَّانَ السَّمْتِيُّ حَدَّثَنَا الْمُبَارَكُ بْنُ سَعِيدٍ عَنْ عُمَرَ بْنِ سَعِيدٍ عَنْ رَجُلٍ مَنْ أَهْلِ الْبَصْرَةِ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَكَانَ أَحَبَّ الطَّعَامِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الثَّرِيدُ مِنْ الْخُبْزِ وَالثَّرِيدُ مِنْ الْحَيْسِقَالَ أَبُو دَاوُد وَهُوَ ضَعِيفٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Hassan As Samti] telah menceritakan kepada kami [Al Mubarak bin Sa'id] dari [Umar bin Sa'id] dari [seorang laki-laki penduduk Bashrah] dari [Ikrimah] dari [Ibnu Abbas] ia berkata, \"Makanan yang paling disukai Rasulullah shallallahu 'alaihi wasallam adalah bubur yang terbuat dari roti, serta bubur dari hais (yaitu campuran antara kurma, keju dan mentega).\" Abu Daud berkata, \"Ini adalah hadits lemah.\""
            },
            {
                "number": 3290,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا سِمَاكُ بْنُ حَرْبٍ حَدَّثَنِي قَبِيصَةُ بْنُ هُلْبٍ عَنْ أَبِيهِ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَسَأَلَهُ رَجُلٌ فَقَالَ إِنَّ مِنْ الطَّعَامِ طَعَامًا أَتَحَرَّجُ مِنْهُ فَقَالَ لَا يَتَخَلَّجَنَّ فِي صَدْرِكَ شَيْءٌ ضَارَعْتَ فِيهِ النَّصْرَانِيَّةَ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Simak bin Harb] telah menceritakan kepadaku [Qabishah bin Hulb] dari [Ayahnya] ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam ditanya seorang laki-laki, \"Di antara makanan ada makanan yang aku merasa ragu untuk memakannya.\" Beliau bersabda: \"Janganlah ada keraguan ada dalam hatimu (akan kehalalannya) sehingga engkau menyerupai orang-orang Nashrani.\""
            },
            {
                "number": 3291,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدَةُ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ ابْنِ أَبِي نَجِيحٍ عَنْ مُجَاهِدٍ عَنْ ابْنِ عُمَرَ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَكْلِ الْجَلَّالَةِ وَأَلْبَانِهَا",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami ['Abdah] dari [Muhammad bin Ishaq] dari [Ibnu Abu Najih] dari [Mujahid] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang makan hewan Jallalah dan meminum susunya.\" "
            },
            {
                "number": 3292,
                "arab": "حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنِي أَبُو عَامِرٍ حَدَّثَنَا هِشَامٌ عَنْ قَتَادَةَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ لَبَنِ الْجَلَّالَةِ",
                "id": "Telah menceritakan kepada kami [Ibnu Al Mutsanna] telah menceritakan kepadaku [Abu 'Amir] telah menceritakan kepada kami [Hisyam] dari [Qatadah] dari [Ikrimah] dari [Ibnu Abbas] bahwa Nabi shallallahu 'alaihi wasallam melarang dari meminum susu hewan Jallalah.\" "
            },
            {
                "number": 3293,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي سُرَيْجٍ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ جَهْمٍ حَدَّثَنَا عُمْرُو بْنُ أَبِي قَيْسٍ عَنْ أَيُّوبَ السَّخْتِيَانِيِّ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْجَلَّالَةِ فِي الْإِبِلِ أَنْ يُرْكَبَ عَلَيْهَا أَوْ يُشْرَبَ مِنْ أَلْبَانِهَا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abu Suraij] telah mengabarkan kepadaku [Abdullah bin Jahm] telah menceritakan kepada kami ['Amru bin Abu Qais] dari [Ayyub As Sakhtiyani] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang menaiki dan minum susu unta yang makan kotoran.\""
            },
            {
                "number": 3294,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادٌ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَنَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ خَيْبَرَ عَنْ لُحُومِ الْحُمُرِ وَأَذِنَ لَنَا فِي لُحُومِ الْخَيْلِ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad] dari ['Amru bin Dinar] dari [Muhammad bin Ali] dari [Jabir bin Abdullah] ia berkata, \"Pada saat perang Khaibar Rasulullah shallallahu 'alaihi wasallam melarang kami untuk makan daging keledai dan mengizinkan kami makan daging kuda.\""
            },
            {
                "number": 3295,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَذَبَحْنَا يَوْمَ خَيْبَرَ الْخَيْلَ وَالْبِغَالَ وَالْحَمِيرَ فَنَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْبِغَالِ وَالْحَمِيرِ وَلَمْ يَنْهَنَا عَنْ الْخَيْلِ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] dari [Abu Az Zubair] dari [Jabir bin Abdullah] ia berkata, \"Pada saat perang Khaibar kami menyembelih kuda, bighal dan keledai, lalu Rasulullah shallallahu 'alaihi wasallam melarang kami untuk menyembelih bighal dan keledai, dan tidak melarang kami dari menyembelih kuda.\""
            },
            {
                "number": 3296,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ شَبِيبٍ وَحَيْوَةُ بْنُ شُرَيْحٍ الْحِمْصِيُّ قَالَ حَيْوَةُ حَدَّثَنَا بَقِيَّةُ عَنْ ثَوْرِ بْنِ يَزِيدَ عَنْ صَالِحِ بْنِ يَحْيَى بْنِ الْمِقْدَامِ بْنِ مَعْدِي كَرِبَ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ خَالِدِ بْنِ الْوَلِيدِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ أَكْلِ لُحُومِ الْخَيْلِ وَالْبِغَالِ وَالْحَمِيرِ زَادَ حَيْوَةُ وَكُلِّ ذِي نَابٍ مِنْ السِّبَاعِقَالَ أَبُو دَاوُد وَهُوَ قَوْلُ مَالِكٍ قَالَ أَبُو دَاوُد لَا بَأْسَ بِلُحُومِ الْخَيْلِ وَلَيْسَ الْعَمَلُ عَلَيْهِ قَالَ أَبُو دَاوُد وَهَذَا مَنْسُوخٌ قَدْ أَكَلَ لُحُومَ الْخَيْلِ جَمَاعَةٌ مَنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْهُمْ ابْنُ الزُّبَيْرِ وَفَضَالَةُ بْنُ عُبَيْدٍ وَأَنَسُ بْنُ مَالِكٍ وَأَسْمَاءُ بِنْتُ أَبِي بَكْرٍ وسُوَيْدُ بْنُ غَفَلَةَ وَعَلْقَمَةُ وَكَانَتْ قُرَيْشٌ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَذْبَحُهَا",
                "id": "Telah menceritakan kepada kami [Sa'id bin Syabib] dan [Haiwah bin Syuraih Al Himshi] [Haiwah] berkata; telah menceritakan kepadaku [Baqiyyah] dari [Tsaur bin Yazid] dari [Shalih bin Yahya bin Al Miqdam bin Ma'dikarib] dari [Ayahnya] dari [Kakeknya] dari [Khalid bin Al Walid] bahwa Rasulullah shallallahu 'alaihi wasallam melarang kami makan daging kuda, bighal, dan keledai.\" Haiwah menambahkan, \"Dan setiap binatang buas yang bertaring.\" Abu Daud berkata, \"Ini adalah pendapat Malik.\" Abu Daud berkata, \"Tidak mengapa memakan daging kuda, dan hal tersebut bukan menjadi dasar beramal.\" Abu Daud berkata, \"Hadits ini telah dihapuskan, sebab sejumlah sahabat Nabi shallallahu 'alaihi wasallam telah memakan daging kuda. Di antara mereka adalah Ibnu Az Zubair, Fadlalah bin 'Ubaid, Anas bin Malik, Asma` binti Abu Bakar, Suwaid bin Ghafalah, dan 'Alqamah. Dan orang-orang Quraisy pada zaman Rasulullah shallallahu 'alaihi wasallam juga menyembelihnya.\""
            },
            {
                "number": 3297,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ هِشَامِ بْنِ زَيْدٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَكُنْتُ غُلَامًا حَزَوَّرًا فَصِدْتُ أَرْنَبًا فَشَوَيْتُهَا فَبَعَثَ مَعِي أَبُو طَلْحَةَ بِعَجُزِهَا إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَيْتُهُ بِهَا فَقَبِلَهَا",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] dari [Hisyam bin Zaid] dari [Anas bin Malik] ia berkata, \"Aku adalah seorang anak yang kuat, lalu aku berburu kelinci dan membakarnya. Kemudian Abu Thalhah menyuruhku untuk mengirimkan bagian pantat kelinci kepada Nabi shallallahu 'alaihi wasallam, lalu aku membawanya kepada beliau dan beliau menerimanya.\""
            },
            {
                "number": 3298,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ خَلَفٍ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ حَدَّثَنَا مُحَمَّدُ بْنُ خَالِدٍ قَالَ سَمِعْتُ أَبِي خَالِدَ بْنَ الْحُوَيْرِثِ يَقُولُإِنَّ عَبْدَ اللَّهِ بْنَ عَمْرٍو كَانَ بِالصِّفَاحِ قَالَ مُحَمَّدٌ مَكَانٌ بِمَكَّةَ وَإِنَّ رَجُلًا جَاءَ بِأَرْنَبٍ قَدْ صَادَهَا فَقَالَ يَا عَبْدَ اللَّهِ بْنَ عَمْرٍو مَا تَقُولُ قَالَ قَدْ جِيءَ بِهَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا جَالِسٌ فَلَمْ يَأْكُلْهَا وَلَمْ يَنْهَ عَنْ أَكْلِهَا وَزَعَمَ أَنَّهَا تَحِيضُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Khalaf] telah menceritakan kepada kami [Rauh bin 'Ubadah] telah menceritakan kepada kami [Muhammad bin Khalid] ia berkata; aku mendengar bapakku [Khalid bin Al Huwairits] berkata, \" [Abdullah bin 'Amru] pernah berada di Ash Shifah -Muhammad berkata; tempat di Makkah-, lalu seorang laki-laki datang membawa kelinci yang ia buru. Laki-laki itu lalu berkata, \"Wahai Abdullah bin 'Amru, apa pendapatmu? Abdullah bin Amru menjawab, \"Pernah seekor kelinci (bakar) dibawa ke hadapan Rasulullah shallallahu 'alaihi wasallam, beliau tidak memakannya dan tidak melarang untuk memakannya, sementara saat itu aku berada di sisi beliau. Dan beliau menyakini bahwa kelinci tersebut mengeluarkan darah.\""
            },
            {
                "number": 3299,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي بِشْرٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍأَنَّ خَالَتَهُ أَهْدَتْ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَمْنًا وَأَضُبًّا وَأَقِطًا فَأَكَلَ مِنْ السَّمْنِ وَمِنْ الْأَقِطِ وَتَرَكَ الْأَضُبَّ تَقَذُّرًا وَأُكِلَ عَلَى مَائِدَتِهِ وَلَوْ كَانَ حَرَامًا مَا أُكِلَ عَلَى مَائِدَةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar] telah menceritakan kepada kami [Syu'bah] dan [Abu Bisyr] dari [Sa'id bin Jubair] dari [Ibnu Abbas] bahwa bibinya telah memberi hadiah mentega, biawak dan keju kepada Rasulullah shallallahu 'alaihi wasallam. Lalu beliau memakan sebagian dari mentega dan keju, serta meninggalkan biawak karena merasa jijik. Dan biawak tersebut dimakan di atas meja makan beliau, seandainya biawak itu haram, maka biawak tersebut tidak akan dimakan di atas meja makan Rasulullah shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 3300,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ عَنْ خَالِدِ بْنِ الْوَلِيدِأَنَّهُ دَخَلَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْتَ مَيْمُونَةَ فَأُتِيَ بِضَبٍّ مَحْنُوذٍ فَأَهْوَى إِلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدِهِ فَقَالَ بَعْضُ النِّسْوَةِ اللَّاتِي فِي بَيْتِ مَيْمُونَةَ أَخْبِرُوا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَا يُرِيدُ أَنْ يَأْكُلَ مِنْهُ فَقَالُوا هُوَ ضَبٌّ فَرَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَهُ قَالَ فَقُلْتُ أَحَرَامٌ هُوَ يَا رَسُولَ اللَّهِ قَالَ لَا وَلَكِنَّهُ لَمْ يَكُنْ بِأَرْضِ قَوْمِي فَأَجِدُنِي أَعَافُهُ قَالَ خَالِدٌ فَاجْتَرَرْتُهُ فَأَكَلْتُهُ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْظُرُ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Ibnu Syihab] dari [Abu Umamah bin Sahl bin Hunaif] dari [Abdullah bin Abbas] dari [Khalid bin Al Walid] bahwa ia bersama Rasulullah shallallahu 'alaihi wasallam pernah memasuki rumah Maimunah, kemudian didatangkan seekor biawak bakar. Rasulullah shallallahu 'alaihi wasallam berkeinginan untuk mengambilnya, lalu sebagian isteri yang berada di rumah Maimunah berkata, \"Beritahukanlah kepada Nabi shallallahu 'alaihi wasallam apa yang hendak beliau makan!\" Kemudian mereka berkata, \"Itu daging biawak.\" Maka Rasulullah shallallahu 'alaihi wasallam pun mengangkat tangannya.\" Khalid berkata, \"Lalu aku katakan, \"Wahai Rasulullah, apakah daging itu haram?\" Beliau menjawab: \"Tidak, akan tetapi biawak tersebut tidak ada di negeri kaumku, maka aku dapati diriku tidak menyukainya.\" Khalid berkata, \"Lalu aku mengambil dan memakannya, sementara Rasulullah shallallahu 'alaihi wasallam melihat.\""
            },
            {
                "number": 3301,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا خَالِدٌ عَنْ حُصَيْنٍ عَنْ زَيْدِ بْنِ وَهْبٍ عَنْ ثَابِتٍ بْنِ وَدِيعَةَ قَالَكُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي جَيْشٍ فَأَصَبْنَا ضِبَابًا قَالَ فَشَوَيْتُ مِنْهَا ضَبًّا فَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَوَضَعْتُهُ بَيْنَ يَدَيْهِ قَالَ فَأَخَذَ عُودًا فَعَدَّ بِهِ أَصَابِعَهُ ثُمَّ قَالَ إِنَّ أُمَّةً مِنْ بَنِي إِسْرَائِيلَ مُسِخَتْ دَوَابَّ فِي الْأَرْضِ وَإِنِّي لَا أَدْرِي أَيُّ الدَّوَابِّ هِيَ قَالَ فَلَمْ يَأْكُلْ وَلَمْ يَنْهَ",
                "id": "Telah menceritakan kepada kami ['Amru bin 'Aun] telah mengabarkan kepada kami [Khalid] dari [Hushain] dari [Zaid bin Wahb] dari [Tsabit bin Wadi'ah] ia berkata, \"Aku pernah bersama Rasulullah shallallahu 'alaihi wasallam berada di antara pasukan, lalu kami mendapatkan beberapa ekor biawak.\" Tsabit berkata, \"Lalu aku membakar satu ekor darinya. Kemudian aku datang kepada Rasulullah shallallahu 'alaihi wasallam dan meletakkannya di hadapan beliau.\" Tsabit bin Wadi'ah melanjutkan, \"Beliau lantas mengambil sebatang ranting dan beliau gunakan untuk menghitung jari-jarinya (biawak). Setelah itu beliau bersabda: \"Sekelompok umat dari kalangan Bani Israil telah diubah menjadi hewan melata di bumi, dan aku tidak tahu hewan apakah itu?\" Tsabit berkata, \"Maka beliau tidak makan dan tidak melarang.\""
            },
            {
                "number": 3302,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَوْفٍ الطَّائِيُّ أَنَّ الْحَكَمَ بْنَ نَافِعٍ حَدَّثَهُمْ حَدَّثَنَا ابْنُ عَيَّاشٍ عَنْ ضَمْضَمِ بْنِ زُرْعَةَ عَنْ شُرَيْحِ بْنِ عُبَيْدٍ عَنْ أَبِي رَاشِدٍ الْحُبْرَانِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ شِبْلٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ أَكْلِ لَحْمِ الضَّبِّ",
                "id": "Telah menceritakan kepada kami [Muhammad bin 'Auf Ath Thai] bahwa [Al Hakam bin Nafi'] telah menceritakan kepada mereka, ia berkata; telah menceritakan kepada kami [Ibnu 'Ayyasy] dari [Dlamdlam bin Zur'ah] dari [Syuraih bin 'Ubaid] dari [Abu Rasyid Al Hubrani] dari [Abdurrahman bin Syibl] bahwa Rasulullah shallallahu 'alaihi wasallam melarang makan daging biawak.\""
            },
            {
                "number": 3303,
                "arab": "حَدَّثَنَا الْفَضْلُ بْنُ سَهْلٍ حَدَّثَنَا إِبْرَاهِيمُ بْنُ عَبْدِ الرَّحْمَنِ ابْنِ مَهْدِيٍّ حَدَّثَنِي بُرَيْهُ بْنُ عُمَرَ بْنِ سَفِينَةَ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَأَكَلْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَحْمَ حُبَارَى",
                "id": "Telah menceritakan kepada kami [Al Fadll bin Sahl] telah menceritakan kepada kami [Ibrahim bin Abdurrahman bin Mahdi] telah menceritakan kepadaku [Buraih bin Umar bin Safinah] dari [Ayahnya] dari [Kakeknya] ia berkata, \"Aku bersama Rasulullah shallallahu 'alaihi wasallam pernah makan daging hubara (burung yang panjang lehernya menyerupai angsa).\""
            },
            {
                "number": 3304,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا غَالِبُ بْنُ حَجْرَةَ حَدَّثَنِي مِلْقَامُ بْنُ التَّلِبِّ عَنْ أَبِيهِ قَالَصَحِبْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ أَسْمَعْ لِحَشَرَةِ الْأَرْضِ تَحْرِيمًا",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Ghalib bin Hajrah] telah menceritakan kepadaku [Milqam bin At Talib] dari [Ayahnya] ia berkata, \"Aku telah menemani Nabi shallallahu 'alaihi wasallam dan tidak mendengar adanya pengharaman serangga bumi.\""
            },
            {
                "number": 3305,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ خَالِدٍ الْكَلْبِيُّ أَبُو ثَوْرٍ حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ عِيسَى بْنِ نُمَيْلَةَ عَنْ أَبِيهِ قَالَكُنْتُ عِنْدَ ابْنِ عُمَرَ فَسُئِلَ عَنْ أَكْلِ الْقُنْفُذِ فَتَلَا{ قُلْ لَا أَجِدُ فِيمَا أُوحِيَ إِلَيَّ مُحَرَّمًا }الْآيَةَقَالَ قَالَ شَيْخٌ عِنْدَهُ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ ذُكِرَ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ خَبِيثَةٌ مِنْ الْخَبَائِثِ فَقَالَ ابْنُ عُمَرَ إِنْ كَانَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَذَا فَهُوَ كَمَا قَالَ مَا لَمْ نَدْرِ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Khalid Al Kalbi Abu Tsaur] telah menceritakan kepada kami [Sa'id bin Manshur] telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Isa bin Numailah] dari [Ayahnya] ia berkata, \"Aku pernah berada di sisi Ibnu Umar kemudian ia ditanya tentang hukum makan daging landak, kemudian ia membaca firman Allah: '(Katakanlah: \"Aku tidak mendapatkan dalam wahyu yang diwahyukan kepadaku, sesuatu yang diharamkan….) ' (Qs. Al An'aam: 145). Numailah berkata, \" [Seorang laki-laki tua] yang ada di sisinya berkata, \"Aku pernah mendengar [Abu Hurairah] berkata, \"Telah disebutkan landak di hadapan Nabi shallallahu 'alaihi wasallam, kemudian beliau bersabda: \"Landak adalah sesuatu yang buruk.\" Kemudian Ibnu Umar berkata, \"Jika Rasulullah shallallahu 'alaihi wasallam mengatakan demikian, maka hukumnya adalah sebagaimana yang beliau ucapkan.\""
            },
            {
                "number": 3306,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ دَاوُدَ بْنِ صَبِيحٍ حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ حَدَّثَنَا مُحَمَّدٌ يَعْنِي ابْنَ شَرِيكٍ الْمَكِّيَّ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ أَبِي الشَّعْثَاءِ عَنْ ابْنِ عَبَّاسٍ قَالَكَانَ أَهْلُ الْجَاهِلِيَّةِ يَأْكُلُونَ أَشْيَاءَ وَيَتْرُكُونَ أَشْيَاءَ تَقَذُّرًا فَبَعَثَ اللَّهُ تَعَالَى نَبِيَّهُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنْزَلَ كِتَابَهُ وَأَحَلَّ حَلَالَهُ وَحَرَّمَ حَرَامَهُ فَمَا أَحَلَّ فَهُوَ حَلَالٌ وَمَا حَرَّمَ فَهُوَ حَرَامٌ وَمَا سَكَتَ عَنْهُ فَهُوَ عَفْوٌ وَتَلَا{ قُلْ لَا أَجِدُ فِيمَا أُوحِيَ إِلَيَّ مُحَرَّمًا }إِلَى آخِرِ الْآيَةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Daud bin Shabih] telah menceritakan kepada kami [Al Fadll bin Dukain] telah menceritakan kepada kami [Muhammad bin Syarik Al Makki] dari ['Amru bin Dinar] dari [Abu Asy Sya'tsa`] dari [Ibnu Abbas] ia berkata, \"Dahulu orang-orang jahiliyah biasa makan beberapa macam makanan dan meninggalkan beberapa makanan karena jijik. Kemudian Allah Ta'ala mengutus Nabi-Nya shallallahu 'alaihi wasallam dan menurunkan Kitab-Nya, serta menghalalkan yang halal dan mengharamkan yang haram. Maka apa yang Allah halalkan adalah halal, apa yang Allah haramkan adalah haram, dan apa yang Allah diamkan maka hukumnya dimaafkan.\" Kemudian Ibnu Abbas membaca ayat: '(Katakanlah: \"Aku tidak mendapatkan dalam wahyu yang diwahyukan kepadaku, sesuatu yang diharamkan…) ' (Qs. Al An'aam: 145) hingga akhir ayat.\""
            },
            {
                "number": 3307,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْخُزَاعِيُّ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَمَّارٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الضَّبُعِ فَقَالَ هُوَ صَيْدٌ وَيُجْعَلُ فِيهِ كَبْشٌ إِذَا صَادَهُ الْمُحْرِمُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah Al Khuza'i] telah menceritakan kepada kami [Jarir bin Hazim] dari [Abdullah bin 'Ubaid] dari [Abdurrahman bin Abu 'Ammar] dari [Jabir bin Abdullah] ia berkata, \"Aku pernah bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai biawak, beliau lalu menjawab: \"Biawak adalah hewan buruan, dan dijadikan padanya denda satu ekor domba apabila orang yang berihram memburunya.\""
            },
            {
                "number": 3308,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي إِدْرِيسَ الْخَوْلَانِيِّ عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ أَكْلِ كُلِّ ذِي نَابٍ مِنْ السَّبُعِ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Ibnu Syihab] dari [Abu Idris Al Khaulani] dari [Abu Tsa'labah Al Khusyani] bahwa Rasulullah shallallahu 'alaihi wasallam melarang makan semua binatang buas yang bertaring.\""
            },
            {
                "number": 3309,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ أَبِي بِشْرٍ عَنْ مَيْمُونِ بْنِ مِهْرَانَ عَنْ ابْنِ عَبَّاسٍ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَكْلِ كُلِّ ذِي نَابٍ مِنْ السَّبُعِ وَعَنْ كُلِّ ذِي مِخْلَبٍ مِنْ الطَّيْرِ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abu 'Awanah] dari [Abu Bisyr] dari [Maimun bin Mihran] dari [Ibnu Abbas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam telah melarang mengkonsumsi semua binatang buas yang bertaring dan semua burung yang memiliki cakar.\""
            },
            {
                "number": 3310,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى الْحِمْصِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ عَنْ الزُّبَيْدِيِّ عَنْ مَرْوَانَ بْنِ رُؤْبَةَ التَّغْلِبِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَوْفٍ عَنْ الْمِقْدَامِ بْنِ مَعْدِي كَرِبَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَلَا لَا يَحِلُّ ذُو نَابٍ مِنْ السِّبَاعِ وَلَا الْحِمَارُ الْأَهْلِيُّ وَلَا اللُّقَطَةُ مِنْ مَالِ مُعَاهَدٍ إِلَّا أَنْ يَسْتَغْنِيَ عَنْهَا وَأَيُّمَا رَجُلٍ ضَافَ قَوْمًا فَلَمْ يَقْرُوهُ فَإِنَّ لَهُ أَنْ يُعْقِبَهُمْ بِمِثْلِ قِرَاهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mushaffa Al Himshi] telah menceritakan kepada kami [Muhammad bin Harb] dari [Az Zubaidi] dari [Marwan bin Ru`bah At Taghlibi] dari [Abdurrahman bin Abu 'Auf] dari [Al Miqdam bin Ma'dikarib] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Ketahuilah, tidak halal hewan buas yang memiliki taring, keledai jinak, barang temuan dari harta orang kafir Mu'ahad (yang menjalin perjanjian dengan negara Islam) kecuali ia tidak membutuhkannya. Dan siapapun laki-laki yang bertamu kepada suatu kaum dan mereka tidak menjamunya, maka baginya untuk menuntut ganti yang seperti jamuan untuknya.\""
            },
            {
                "number": 3311,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ عَنْ ابْنِ أَبِي عَدِيٍّ عَنْ ابْنِ أَبِي عَرُوبَةَ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مَيْمُونِ بْنِ مِهْرَانَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ خَيْبَرَ عَنْ أَكْلِ كُلِّ ذِي نَابٍ مِنْ السِّبَاعِ وَعَنْ كُلِّ ذِي مِخْلَبٍ مِنْ الطَّيْرِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] dari [Ibnu Abu Adi] dari [Ibnu Abu 'Arubah] dari [Ali bin Al Hakam] dari [Maimun bin Mihran] dari [Sa'id bin Jubair] dari [Ibnu Abbas] ia berkata, \"Saat perang Khaibar Rasulullah shallallahu 'alaihi wasallam melarang makan daging binatang buas yang memiliki taring dan segala burung yang memiliki cakar.\""
            },
            {
                "number": 3312,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ حَدَّثَنِي أَبُو سَلَمَةَ سُلَيْمَانُ بْنُ سُلَيْمٍ عَنْ صَالِحِ بْنِ يَحْيَى بْنِ الْمِقْدَامِ عَنْ جَدِّهِ الْمِقْدَامِ بْنِ مَعْدِي كَرِبَ عَنْ خَالِدِ بْنِ الْوَلِيدِ قَالَغَزَوْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْبَرَ فَأَتَتْ الْيَهُودُ فَشَكَوْا أَنَّ النَّاسَ قَدْ أَسْرَعُوا إِلَى حَظَائِرِهِمْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا لَا تَحِلُّ أَمْوَالُ الْمُعَاهَدِينَ إِلَّا بِحَقِّهَا وَحَرَامٌ عَلَيْكُمْ حُمُرُ الْأَهْلِيَّةِ وَخَيْلُهَا وَبِغَالُهَا وَكُلُّ ذِي نَابٍ مِنْ السِّبَاعِ وَكُلُّ ذِي مِخْلَبٍ مِنْ الطَّيْرِ",
                "id": "Telah menceritakan kepada kami ['Amru bin Utsman] telah menceritakan kepada kami [Muhammad bin Harb] telah menceritakan kepadaku [Abu Salamah Sulaiman bin Sulaim] dari [Shalih bin Yahya bin Al Miqdam] dari kakeknya [Al Miqdam bin Ma'dikarib] dari [Khalid bin Al Walid] ia berkata, \"Aku pernah mengikuti perang Khaibar bersama Rasulullah shallallahu 'alaihi wasallam, kemudian orang-orang Yahudi datang dan mengeluhkan bahwa kaum Muslimin cepat-cepat menyerbu kandang mereka. Lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ketahuilah, tidak halal harta orang-orang kafir Mu'ahad (yang memiliki perjanjian damai dengan orang-orang muslim) kecuali dengan haknya, dan haram atas kalian keledai jinak, kuda jinak, dan bighal jinak serta segala binatang buas yang memiliki taring dan segala burung yang memiliki cakar.\""
            },
            {
                "number": 3313,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ وَمُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ قَالَا حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ عُمَرَ بْنِ زَيْدٍ الصَّنْعَانِيِّ أَنَّهُ سَمِعَ أَبَا الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ ثَمَنِ الْهِرِّ قَالَ ابْنُ عَبْدِ الْمَلِكِ عَنْ أَكْلِ الْهِرِّ وَأَكْلِ ثَمَنِهَا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] dan [Muhammad bin Abdul Malik] mereka berkata; telah menceritakan kepada kami [Abdurrazzaq] dari [Umar bin Zaid Ash Shan'ani] bahwa ia mendengar [Abu Az Zubair] dari [Jabir bin Abdullah] bahwa Nabi shallallahu 'alaihi wasallam telah melarang menjual kucing.\" Ibnu Abdul Malik menyebutkan, \"Memakan daging kucing dan memakan hasil penjualannya.\""
            },
            {
                "number": 3314,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ حَسَنٍ الْمِصِّيصِيُّ حَدَّثَنَا حَجَّاجٌ عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ أَخْبَرَنِي رَجُلٌ عَنْ جَابِرِ بَنِ عَبْدِ اللَّهِ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ خَيْبَرَ عَنْ أَنْ نَأْكُلَ لُحُومَ الْحُمُرِ وَأَمَرَنَا أَنْ نَأْكُلَ لُحُومَ الْخَيْلِقَالَ عَمْرٌو فَأَخْبَرْتُ هَذَا الْخَبَرَ أَبَا الشَّعْثَاءِ فَقَالَ قَدْ كَانَ الْحَكَمُ الْغِفَارِيُّ فِينَا يَقُولُ هَذَا وَأَبَى ذَلِكَ الْبَحْرُ يُرِيدُ ابْنَ عَبَّاسٍ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Hasan Al Mishshi] telah menceritakan kepada kami [Hajjaj] dari [Ibnu Juraij] telah mengabarkan kepadaku ['Amru bin Dinar] telah mengabarkan kepadaku [seorang laki-laki] dari [Jabir bin Abdullah] ia berkata, \"Saat perang Khaibar Rasulullah shallallahu 'alaihi wasallam melarang dari memakan daging keledai, dan memerintahkan kami agar makan daging kuda.\" 'Amru berkata, \"Aku lalu memberitahukan hadits ini kepada Abu Asy Sya'tsa`, maka ia pun berkata, \"Dahulu Al Hakam Al Ghifari berada di antara kami, ia membolehkannya, namun hal itu ditolak oleh Ibnu Abbas.\""
            },
            {
                "number": 3315,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي زِيَادٍ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ إِسْرَائِيلَ عَنْ مَنْصُورٍ عَنْ عُبَيْدٍ أَبِي الْحَسَنِ عَنْ عَبْدِ الرَّحْمَنِ عَنْ غَالِبِ بْنِ أَبْجَرَ قَالَأَصَابَتْنَا سَنَةٌ فَلَمْ يَكُنْ فِي مَالِي شَيْءٌ أُطْعِمُ أَهْلِي إِلَّا شَيْءٌ مِنْ حُمُرٍ وَقَدْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَرَّمَ لُحُومَ الْحُمُرِ الْأَهْلِيَّةِ فَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ أَصَابَتْنَا السَّنَةُ وَلَمْ يَكُنْ فِي مَالِي مَا أُطْعِمُ أَهْلِي إِلَّا سِمَانُ الْحُمُرِ وَإِنَّكَ حَرَّمْتَ لُحُومَ الْحُمُرِ الْأَهْلِيَّةِ فَقَالَ أَطْعِمْ أَهْلَكَ مِنْ سَمِينِ حُمُرِكَ فَإِنَّمَا حَرَّمْتُهَا مِنْ أَجْلِ جَوَّالِ الْقَرْيَةِ يَعْنِي الْجَلَّالَةَقَالَ أَبُو دَاوُد عَبْدُ الرَّحْمَنِ هَذَا هُوَ ابْنُ مَعْقِلٍ قَالَ أَبُو دَاوُد رَوَى شُعْبَةُ هَذَا الْحَدِيثَ عَنْ عُبَيْدٍ أَبِي الْحَسَنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ مَعْقِلٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ بِشْرٍ عَنْ نَاسٍ مِنْ مُزَيْنَةَ أَنَّ سَيِّدَ مُزَيْنَةَ أَبْجَرَ أَوِ ابْنَ أَبْجَرَ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ حَدَّثَنَا أَبُو نُعَيْمٍ عَنْ مِسْعَرٍ عَنْ عُبَيْدٍ عَنْ ابْنِ مَعْقِلٍ عَنْ رَجُلَيْنِ مِنْ مُزَيْنَةَ أَحَدُهُمَا عَنْ الْآخَرِ أَحَدُهُمَا عَبْدُ اللَّهِ بْنُ عَمْرِو بْنِ عُوَيْمٍ وَالْآخَرُ غَالِبُ بْنُ الْأَبْجَرِ قَالَ مِسْعَرٌ أَرَى غَالِبًا الَّذِي أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْحَدِيثِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Abu Ziyad] telah menceritakan kepada kami ['Ubaidullah] dari [Israil] dari [Manshur] dari ['Ubaid Abu Al Hasan] dari [Abdurrahman] dari [Ghalib bin Abhar] ia berkata, \"Kami tertimpa kekeringan, dan di antara hartaku tidak ada sesuatu yang dapat aku gunakan untuk memberi makan keluargaku, kecuali lemak keledai. Sementara Rasulullah shallallahu 'alaihi wasallam telah mengharamkan daging keledai jinak. Lalu aku datang kepada Nabi shallallahu 'alaihi wasallam dan aku katakan, \"Wahai Rasulullah, kami telah tertimpa musim kering, dan tidak ada di antara hartaku sesuatu yang dapat aku gunakan untuk memberi makan keluargaku kecuali lemak keledai, sementara anda telah mengharamkan daging keledai jinak. Kemudian beliau berkata: \"Berilah makan keluargamu dari lemak keledaimu, hanysanya aku haramkan itu karena hewan-hewan yang suka berkeliling kampung (hewan yang suka makan kotoran).\" Abu Daud berkata, \"Abdurrahman ini adalah Ibnu Ma'qil.\" Abu Daud berkata, \" [Syu'bah] meriwayatkan hadits ini dari ['Ubaid Abu Al Hasan] dari [Abdurrahman bin Ma'qil] dari [Abdurrahman bin Bisyr] dari [beberapa orang] yang berasal dari Muzainah, bahwa pemimpin Muzainah [Abjar atau anak Abjar] telah bertanya kepada Nabi shallallahu 'alaihi wasallam….\" Telah menceritakan kepada kami [Muhammad bin Sulaiman] telah menceritakan kepada kami [Abu Nu'aim] dari [Mis'ar] dari ['Ubaid] dari [Abu Ma'qil] dari [dua orang laki-laki] yang berasal dari Muzainah, salah seorang dari mereka (meriwayatkan) dari yang lainnya. Salah seorang mereka adalah [Abdullah bin 'Amru bin 'Uwaim] sedangkan yang lainnya adalah [Ghalib bin Al Abjar] Mis'ar berkata, \"Menurutku Ghalib lah yang datang kepada Nabi shallallahu 'alaihi wasallam, dengan hadits seperti ini.\""
            },
            {
                "number": 3316,
                "arab": "حَدَّثَنَا سَهْلُ بْنُ بَكَّارٍ حَدَّثَنَا وُهَيْبٌ عَنْ ابْنِ طَاوُسٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ خَيْبَرَ عَنْ لُحُومِ الْحُمُرِ الْأَهْلِيَّةِ وَعَنْ الْجَلَّالَةِ عَنْ رُكُوبِهَا وَأَكْلِ لَحْمِهَا",
                "id": "Telah menceritakan kepada kami [Sahl bin Bakkar] telah menceritakan kepada kami [Wuhaib] dari [Ibnu Thawus] dari ['Amru bin Syu'aib] dari [Ayahnya] dari [Kakeknya] ia berkata, \"Saat perang Khaibar Rasulullah shallallahu 'alaihi wasallam melarang makan daging keledai jinak, menaiki hewan jallalah dan meminum susunya.\" "
            },
            {
                "number": 3317,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ النَّمَرِيُّ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي يَعْفُورٍ قَالَ سَمِعْتُ ابْنَ أَبِي أَوْفَىوَسَأَلْتُهُ عَنْ الْجَرَادِ فَقَالَ غَزَوْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سِتَّ أَوْ سَبْعَ غَزَوَاتٍ فَكُنَّا نَأْكُلُهُ مَعَهُ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar An Namari] telah menceritakan kepada kami [Syu'bah] dari [Abu Ya'fur] ia berkata; aku mendengar [Ibnu Abu Aufa] dan aku tanyakan kepadanya mengenai belalang, kemudian ia menjawab, \"Aku pernah berperang bersama Rasulullah shallallahu 'alaihi wasallam sebanyak enam atau tujuh kali peperangan, dan kami pernah memakannya bersama beliau.\""
            },
            {
                "number": 3318,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْفَرَجِ الْبَغْدَادِيُّ حَدَّثَنَا ابْنُ الزِّبْرِقَانِ حَدَّثَنَا سُلَيْمَانُ التَّيْمِيُّ عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ عَنْ سَلْمَانَ قَالَسُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْجَرَادِ فَقَالَ أَكْثَرُ جُنُودِ اللَّهِ لَا آكُلُهُ وَلَا أُحَرِّمُهُقَالَ أَبُو دَاوُد رَوَاهُ الْمُعْتَمِرُ عَنْ أَبِيهِ عَنْ أَبِي عُثْمَانَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَذْكُرْ سَلْمَانَ حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ وَعَلِيُّ بْنُ عَبْدِ اللَّهِ قَالَا حَدَّثَنَا زَكَرِيَّا بْنُ يَحْيَى بْنِ عُمَارَةَ عَنْ أَبِي الْعَوَّامِ الْجَزَّارِ عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ عَنْ سَلْمَانَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ فَقَالَ مِثْلَهُ فَقَالَ أَكْثَرُ جُنْدِ اللَّهِ قَالَ عَلِيٌّ اسْمُهُ فَائِدٌ يَعْنِي أَبَا الْعَوَّامِ قَالَ أَبُو دَاوُد رَوَاهُ حَمَّادُ بْنُ سَلَمَةَ عَنْ أَبِي الْعَوَّامِ عَنْ أَبِي عُثْمَانَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَذْكُرْ سَلْمَانَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Faraj Al Baghdadi] telah menceritakan kepada kami [Ibnu Az Zibriqan] telah menceritakan kepada kami [Sulaiman At Tamimi] dari [Abu Utsman An Nahdi] dari [Salman] ia berkata, \"Nabi shallallahu 'alaihi wasallam ditanya mengenai belalang, kemudian beliau bersabda: \"Mereka adalah tentara Allah terbanyak. Aku tidak memakannya dan tidak mengharamkannya.\" Abu Daud berkata, \"Hadits tersebut diriwayatkan oleh [Al Mu'tamir] dari [Ayahnya] dari [Abu Utsman] dari Nabi shallallahu 'alaihi wasallam, namun ia tidak menyebutkan Salman.\" Telah menceritakan kepada kami [Nashr bin Ali] serta [Ali bin Abdullah] mereka berkata; telah menceritakan kepada kami [Zakaria bin Yahya bin 'Umarah] dari [Abu Al 'Awwam Al Hazzar] dari [Abu Utsman An Nahdi] dari [Salman] bahwa Rasulullah shallallahu 'alaihi wasallam ditanya, kemudian beliau mengatakan seperti itu. Beliau bersabda: \"Mereka adalah pasukan Allah yang terbanyak.\" Ali berkata, \"Namanya adalah Faid Abu Al 'Awwam.\" Abu Daud berkata, \"Hadits tersebut diriwayatkan oleh [Hammad bin Salamah] dari [Abu Al 'Awwam] dari [Abu Utsman] dari Nabi shallallahu 'alaihi wasallam, namuan Ia tidak menyebutkan Salman.\""
            },
            {
                "number": 3319,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ حَدَّثَنَا يَحْيَى بْنُ سُلَيْمٍ الطَّائِفِيُّ حَدَّثَنَا إِسْمَعِيلَ بْنُ أُمَيَّةَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أَلْقَى الْبَحْرُ أَوْ جَزَرَ عَنْهُ فَكُلُوهُ وَمَا مَاتَ فِيهِ وَطَفَا فَلَا تَأْكُلُوهُقَالَ أَبُو دَاوُد رَوَى هَذَا الْحَدِيثَ سُفْيَانُ الثَّوْرِيُّ وَأَيُّوبُ وَحَمَّادٌ عَنْ أَبِي الزُّبَيْرِ أَوْقَفُوهُ عَلَى جَابِرٍ وَقَدْ أُسْنِدَ هَذَا الْحَدِيثُ أَيْضًا مِنْ وَجْهٍ ضَعِيفٍ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin 'Abdah] telah menceritakan kepada kami [Yahya bin Sulaim Ath Thaifi] telah menceritakan kepada kami [Isma'il bin Umayyah] dari [Abu Az Zubair] dari [Jabir bin Abdullah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apa yang didamparkan oleh laut atau yang tersingkap darinya maka makanlah, dan apa yang mati padanya dalam keadaan mengapung maka janganlah engkau makan.\" Abu Daud berkata, \"Hadits tersebut diriwayatkan oleh [Sufyan Ats Tsauri] dan [Ayyub] serta [Hammad] dari [Abu Az Zubair] mereka menyandarkannya kepada Jabir. Dan hadits ini juga di sandarkan dengan sanad yang lemah, dari jalur Ibnu Abu Dzi`b dari Abu Az Zubair dari Jabir dari Nabi shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 3320,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ جَابِرِ بْنِ سَمُرَةَأَنَّ رَجُلًا نَزَلَ الْحَرَّةَ وَمَعَهُ أَهْلُهُ وَوَلَدُهُ فَقَالَ رَجُلٌ إِنَّ نَاقَةً لِي ضَلَّتْ فَإِنْ وَجَدْتَهَا فَأَمْسِكْهَا فَوَجَدَهَا فَلَمْ يَجِدْ صَاحِبَهَا فَمَرِضَتْ فَقَالَتْ امْرَأَتُهُ انْحَرْهَا فَأَبَى فَنَفَقَتْ فَقَالَتْ اسْلُخْهَا حَتَّى نُقَدِّدَ شَحْمَهَا وَلَحْمَهَا وَنَأْكُلَهُ فَقَالَ حَتَّى أَسْأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَاهُ فَسَأَلَهُ فَقَالَ هَلْ عِنْدَكَ غِنًى يُغْنِيكَ قَالَ لَا قَالَ فَكُلُوهَا قَالَ فَجَاءَ صَاحِبُهَا فَأَخْبَرَهُ الْخَبَرَ فَقَالَ هَلَّا كُنْتَ نَحَرْتَهَا قَالَ اسْتَحْيَيْتُ مِنْكَ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] dari [Simak bin Harb] dari [Jabir bin Samurah] bahwa seorang laki-laki singgah di Harrah bersama dengan anak dan isterinya. Kemudian seorang laki-laki berkata, \"Sesungguhnya untaku telah hilang, apabila engkau mendapatkannya maka tangkaplah!\" Laki-laki itu kemudian mendapatkannya dan tidak mendapati pemiliknya, lalu unta tersebut sakit. Lantas isterinya berkata, \"Sembelihlah unta tersebut!\" Namun suaminya menolak, hingga unta itu pun mati. Isterinya kemudian berkata, \"Kulitilah unta tersebut hingga kita jadikan lemak dan dagingnya menjadi dendeng hingga kita bisa memakannya.\" Suaminya berkata, \"Tidak, hingga aku bertanya kepada Rasulullah shallallahu 'alaihi wasallam.\" Lalu ia datang kepada beliau dan beliau bertanya: \"Apakah engkau memiliki sesuatu yang memberikan kecukupan bagimu?\" Ia berkata, \"Tidak.\" Beliau lalu bersabda: \"Makanlah!\" Jabir bin Samurah berkata, \"Kemudian pemiliknya datang hingga ia pun mengabarkan perihal unta tersebut. Sang pemilik unta lalu berkata, \"Kenapa tidak kamu sembelih?\" laki-laki itu menjawab, \"Aku malu darimu.\""
            },
            {
                "number": 3321,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ حَدَّثَنَا عُقْبَةُ بْنُ وَهْبِ بْنِ عُقْبَةَ الْعَامِرِيُّ قَالَ سَمِعْتُ أَبِي يُحَدِّثُ عَنْ الْفُجَيْعِ الْعَامِرِيِّأَنَّهُ أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَا يَحِلُّ لَنَا مِنْ الْمَيْتَةِ قَالَ مَا طَعَامُكُمْ قُلْنَا نَغْتَبِقُ وَنَصْطَبِحُقَالَ أَبُو نُعَيْمٍ فَسَّرَهُ لِي عُقْبَةُ قَدَحٌ غُدْوَةً وَقَدَحٌ عَشِيَّةً قَالَ ذَاكَ وَأَبِي الْجُوعُ فَأَحَلَّ لَهُمْ الْمَيْتَةَ عَلَى هَذِهِ الْحَالِ قَالَ أَبُو دَاوُد الْغَبُوقُ مِنْ آخِرِ النَّهَارِ وَالصَّبُوحُ مِنْ أَوَّلِ النَّهَارِ",
                "id": "Telah menceritakan kepada kami [Harun bin Abdullah] telah menceritakan kepada kami [Al Fadll bin Dukain] telah menceritakan kepada kami ['Uqbah bin Wahb bin 'Uqbah Al 'Amiri] ia berkata; aku mendengar [Ayahku] menceritakan dari [Al Fujai' Al 'Amiri] bahwa ia telah datang kepada Rasulullah shallallahu 'alaihi wasallam dan bertanya, \"Bangkai apakah yang halal bagi kami?\" Beliau menjawab: \"Apakah makanan kalian?\" Kami menjawab, \"Kami minum susu pada satu gelas pada sore hari dan minum satu gelas pada pagi hari.\" Abu Nu'aim berkata, \"Uqbah mentafsirkannya untukku, 'Yaitu satu gelas pada pagi hari dan satu gelas pada sore hari'. Beliau bersabda: \"Ukuran itu tidak cukup dan masih ada rasa lapar.\" Kemudian beliau menghalalkan bangkai bagi mereka dalam keadaan ini.\" Abu Daud berkata, \"Ghabuq adalah dari akhir siang sedangkan shabuh dari awal siang.\""
            },
            {
                "number": 3322,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ بْنِ أَبِي رِزْمَةَ أَخْبَرَنَا الْفَضْلُ بْنُ مُوسَى عَنْ حُسَيْنِ بْنِ وَاقِدٍ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَدِدْتُ أَنَّ عِنْدِي خُبْزَةً بَيْضَاءَ مِنْ بُرَّةٍ سَمْرَاءَ مُلَبَّقَةً بِسَمْنٍ وَلَبَنٍ فَقَامَ رَجُلٌ مِنْ الْقَوْمِ فَاتَّخَذَهُ فَجَاءَ بِهِ فَقَالَ فِي أَيِّ شَيْءٍ كَانَ هَذَا قَالَ فِي عُكَّةِ ضَبٍّ قَالَ ارْفَعْهُقَالَ أَبُو دَاوُد هَذَا حَدِيثٌ مُنْكَرٌ قَالَ أَبُو دَاوُد وَأَيُّوبُ لَيْسَ هُوَ السَّخْتِيَانِيُّ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdul Aziz bin Abu Rizmah] telah mengabarkan kepada kami [Al Fadll bin Musa] dari [Husain bin Waqid] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku berharap memiliki roti putih yang terbuat dari gandum yang dicampur dengan mentega dan susu.\" Kemudian seorang laki-laki dari salah seorang mereka berdiri dan lalu membuatnya uantuk kemudian membawanya kepada beliau. Beliau kemudian bertanya: \"Di tempat apakah mentega ini sebelumnya?\" Laki-laki itu menjawab, \"Berada dalam bejana yang terbuat dari kulit biawak.\" Beliau bersabda: \"Angkatlah makanan tersebut!\" Abu Daud berkata, \"Hadits ini adalah hadits mungkar.\" Abu Daud berkata, \"Ayyub bukanlah As Sakhtinyani.\""
            },
            {
                "number": 3323,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ مُوسَى الْبَلْخِيُّ حَدَّثَنَا إِبْرَاهِيمُ بْنُ عُيَيْنَةَ عَنْ عَمْرِو بْنِ مَنْصُورٍ عَنْ الشَّعْبِيِّ عَنْ ابْنِ عُمَرَ قَالَأُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِجُبْنَةٍ فِي تَبُوكَ فَدَعَا بِسِكِّينٍ فَسَمَّى وَقَطَعَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Musa Al Balkhi] telah menceritakan kepada kami [Ibrahim bin 'Uyainah] dari ['Amru bin Manshur] dari [Asy Sya'bi] dari [Ibnu Umar] ia berkata, \"Nabi shallallahu 'alaihi wasallam diberi keju di Tabuk, kemudian beliau meminta pisau lalu menyebutkan nama Allah dan memotongnya.\""
            },
            {
                "number": 3324,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ حَدَّثَنَا سُفْيَانُ عَنْ مُحَارِبِ بْنِ دِثَارٍ عَنْ جَابِرٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نِعْمَ الْإِدَامُ الْخَلُّ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Mu'awiyah bin Hisyam] telah menceritakan kepada kami [Sufyan] dari [Muharib bin Ditsar] dari [Jabir] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sebaik-baik lauk adalah cuka.\""
            },
            {
                "number": 3325,
                "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ وَمُسْلِمُ بْنُ إِبْرَاهِيمَ قَالَا حَدَّثَنَا الْمُثَنَّى بْنُ سَعِيدٍ عَنْ طَلْحَةَ بْنِ نَافِعٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نِعْمَ الْإِدَامُ الْخَلُّ",
                "id": "Telah menceritakan kepada kami [Abu Al Walid Ath Thayalisi] dan [Muslim bin Ibrahim] mereka berkata; telah menceritakan kepada kami [Al Mutsanna bin Sa'id] dari [Thalhah bin Nafi'] dari [Jabir bin Abdullah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sebaik-baik lauk adalah cuka.\""
            },
            {
                "number": 3326,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ حَدَّثَنِي عَطَاءُ بْنُ أَبِي رَبَاحٍ أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ قَالَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَكَلَ ثُومًا أَوْ بَصَلًا فَلْيَعْتَزِلْنَا أَوْ لِيَعْتَزِلْ مَسْجِدَنَا وَلْيَقْعُدْ فِي بَيْتِهِ وَإِنَّهُ أُتِيَ بِبَدْرٍ فِيهِ خَضِرَاتٌ مِنْ الْبُقُولِ فَوَجَدَ لَهَا رِيحًا فَسَأَلَ فَأُخْبِرَ بِمَا فِيهَا مِنْ الْبُقُولِ فَقَالَ قَرِّبُوهَا إِلَى بَعْضِ أَصْحَابِهِ كَانَ مَعَهُ فَلَمَّا رَآهُ كَرِهَ أَكْلَهَا قَالَ كُلْ فَإِنِّي أُنَاجِي مَنْ لَا تُنَاجِيقَالَ أَحْمَدُ بْنُ صَالِحٍ بِبَدْرٍ فَسَّرَهُ ابْنُ وَهْبٍ طَبَقٌ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] telah menceritakan kepadaku ['Atha bin Abu Rabah] bahwa [Jabir bin Abdullah] berkata, \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa makan bawang putih dan bawang merah, maka hendaknya ia menjauhi masjid kami dan duduk di rumahnya.\" Beliau pernah diberi nampan berisi sayur-sayuran hijau. Kemudian beliau mencium bau sesuatu, ketika beliau menanyakan perihal bau tersebut, maka beliau pun diberitahu tentang bau tersebut. Kemudian beliau bersabda: \"Dekatkan!\" yaitu kepada sebagian sahabat yang bersamanya! Kemudian ketika beliau melihat mereka enggan makan, beliau pun bersabda: \"Makanlah, sesungguhnya aku bermunajat kepada Dzat yang engkau tidak bermunajat kepada-Nya.\" Ahmad bin Shalih berkata, \"Badr ditafsirkan Ibnu Wahb dengan nampan.\""
            },
            {
                "number": 3327,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو أَنَّ بَكْرَ بْنَ سَوَادَةَ حَدَّثَهُ أَنَّ أَبَا النَّجِيبِ مَوْلَى عَبْدِ اللَّهِ بْنِ سَعْدٍ حَدَّثَهُ أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ حَدَّثَهُأَنَّهُ ذُكِرَ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الثُّومُ وَالْبَصَلُ وَقِيلَ يَا رَسُولَ اللَّهِ وَأَشَدُّ ذَلِكَ كُلُّهُ الثُّومُ أَفَتُحَرِّمُهُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُوهُ وَمَنْ أَكَلَهُ مِنْكُمْ فَلَا يَقْرَبْ هَذَا الْمَسْجِدَ حَتَّى يَذْهَبَ رِيحُهُ مِنْهُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku ['Amru] bahwa [Bakr bin Sawadah] telah menceritakan kepadanya, bahwa [Abu An Najib] mantan budak Abdullah bin Sa'd menceritakan kepadanya, bahwa [Abu Sa'id Al Khudri] menceritakan kepadanya, bahwa disebutkan bawang putih dan bawang merah di hadapan Rasulullah shallallahu 'alaihi wasallam. Dikatakan, \"Wahai Rasulullah, di antara yang ada, yang paling keras baunya adalah bawang putih. Apakah anda mengharamkannya?\" Nabi shallallahu 'alaihi wasallam bersabda: \"Makanlah, siapa di antara kalian yang telah memakannya, maka janganlah ia mendekati masjid kami hingga baunya hilang.\""
            },
            {
                "number": 3328,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ الشَّيْبَانِيِّ عَنْ عَدِيِّ بْنِ ثَابِتٍ عَنْ زِرِّ بْنِ حُبَيْشٍ عَنْ حُذَيْفَةَأَظُنُّهُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ تَفَلَ تُجَاهَ الْقِبْلَةِ جَاءَ يَوْمَ الْقِيَامَةِ تَفْلُهُ بَيْنَ عَيْنَيْهِ وَمَنْ أَكَلَ مِنْ هَذِهِ الْبَقْلَةِ الْخَبِيثَةِ فَلَا يَقْرَبَنَّ مَسْجِدَنَا ثَلَاثًا",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Jarir] dari [Asy Syaibani] dari [Adi bin Tsabit] dari [Zirr bin Khubaisy] dari [Hudzaifah] aku mengira dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa meludah ke arah kiblat, maka pada hari kiamat ia akan datang sementara ludahnya ada di antara kedua matanya. Dan barangsiapa makan sebagian dari sayur yang berbau busuk ini, maka janganlah ia mendekati masjid kami!\" Beliau mengatakannya sebanyak tiga kali.\""
            },
            {
                "number": 3329,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَكَلَ مِنْ هَذِهِ الشَّجَرَةِ فَلَا يَقْرَبَنَّ الْمَسَاجِدَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Yahya] dari ['Ubaidullah] dari [Nafi'] dari [Ibnu Umar] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa makan sebagian dari pohon ini, maka janganlah ia mendekati masjid-masjid!\""
            },
            {
                "number": 3330,
                "arab": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا أبُو هِلَالٍ حَدَّثَنَا حُمَيْدُ بْنُ هِلَالٍ عَنْ أَبِي بُرْدَةَ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَأَكَلْتُ ثُومًا فَأَتَيْتُ مُصَلَّى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَدْ سُبِقْتُ بِرَكْعَةٍ فَلَمَّا دَخَلْتُ الْمَسْجِدَ وَجَدَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رِيحَ الثُّومِ فَلَمَّا قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاتَهُ قَالَ مَنْ أَكَلَ مِنْ هَذِهِ الشَّجَرَةِ فَلَا يَقْرَبَنَّا حَتَّى يَذْهَبَ رِيحُهَا أَوْ رِيحُهُ فَلَمَّا قُضِيَتْ الصَّلَاةُ جِئْتُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ وَاللَّهِ لَتُعْطِيَنِّي يَدَكَ قَالَ فَأَدْخَلْتُ يَدَهُ فِي كُمِّ قَمِيصِي إِلَى صَدْرِي فَإِذَا أَنَا مَعْصُوبُ الصَّدْرِ قَالَ إِنَّ لَكَ عُذْرًا",
                "id": "Telah menceritakan kepada kami [Syaiban bin Farrukh] telah menceritakan kepada kami [Abu Hilal] telah menceritakan kepada kami [Humaid bin Hilal] dari [Abu Burdah] dari [Al Mughirah bin Syu'bah] ia berkata, \"Aku pernah makan bawang putih kemudian mendatangi mushalla Nabi shallallahu 'alaihi wasallam, dan aku telah ketinggalan satu rakaat. Saat aku masuk masjid Nabi shallallahu 'alaihi wasallam mencium bau bawang putih, selesai shalat Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Barangsiapa makan sebagian dari pohon ini maka janganlah ia mendekati kami, hingga hilang baunya.\" Selesai shalat aku datang menemui Rasulullah shallallahu 'alaihi wasallam dan aku katakan, \"Wahai Rasulullah, demi Allah! Berikanlah tanganmu kepadaku.\" Aku lalu memasukkan tangan beliau ke dalam lubang pergelangan bajuku hingga menyentuh dadaku. Sementara aku telah mengikat perut bagian dada dengan kain (karena lapar), maka beliau pun bersabda: \"Sesungguhnya engkau memiliki udzur.\""
            },
            {
                "number": 3331,
                "arab": "حَدَّثَنَا عَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ حَدَّثَنَا أَبُو عَامِرٍ عَبْدُ الْمَلِكِ بْنُ عَمْرٍو حَدَّثَنَا خَالِدُ بْنُ مَيْسَرَةَ يَعْنِي الْعَطَّارَ عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ هَاتَيْنِ الشَّجَرَتَيْنِ وَقَالَ مَنْ أَكَلَهُمَا فَلَا يَقْرَبَنَّ مَسْجِدَنَا وَقَالَ إِنْ كُنْتُمْ لَا بُدَّ آكِلِيهِمَا فَأَمِيتُوهُمَا طَبْخًاقَالَ يَعْنِي الْبَصَلَ وَالثُّومَ",
                "id": "Telah menceritakan kepada kami [Abbas bin Abdul 'Azhim] telah menceritakan kepada kami [Abu 'Amir Abdul Malik bin 'Amru] telah menceritakan kepada kami [Khalid bin Maisarah Al 'Aththar] dari [Mu'awiyah bin Qurrah] dari [Ayahnya] bahwa Nabi shallallahu 'alaihi wasallam telah melarang dari dua pohon ini, beliau bersabda: \"Barangsiapa memakan keduanya maka janganlah ia mendekati masjid kami!\" Dan beliau bersabda: \"Apabila kalian harus memakannya maka hilangkan bau keduanya dengan dimasak!\" Qurrah berkata, \"Yaitu bawang merah dan bawang putih.\""
            },
            {
                "number": 3332,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا الْجَرَّاحُ أَبُو وَكِيعٍ عَنْ أَبِي إِسْحَقَ عَنْ شَرِيكٍ عَنْ عَلِيٍّ عَلَيْهِ السَّلَام قَالَنُهِيَ عَنْ أَكْلِ الثُّومِ إِلَّا مَطْبُوخًاقَالَ أَبُو دَاوُد شَرِيكُ بْنُ حَنْبَلٍ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Al Jarrah Abu Waki'] dari [Abu Ishaq] dari [Syarik] dari [Ali] radliallahu 'anhu, ia berkata, \"Telah dilarang makan bawang putih kecuali dalam keadaan dimasak.\" Abu Daud berkata, \"Syarik bin Hanbal.\""
            },
            {
                "number": 3333,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى أَخْبَرَنَا ح و حَدَّثَنَا حَيْوَةُ بْنُ شُرَيْحٍ حَدَّثَنَا بَقِيَّةُ عَنْ بَحِيرٍ عَنْ خَالِدٍ عَنْ أَبِي زِيَادٍ خِيَارِ بْنِ سَلَمَةَأَنَّهُ سَأَلَ عَائِشَةَ عَنْ الْبَصَلِ فَقَالَتْ إِنَّ آخِرَ طَعَامٍ أَكَلَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَعَامٌ فِيهِ بَصَلٌ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Musa] telah mengabarkan kepada kami. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Haiwah bin Syuraih] telah menceritakan kepada kami [Baqiyyah] dari [Bahir] dari [Khalid] dari [Abu Ziyad Khiyar bin Salamah] bahwa ia pernah bertanya kepada [Aisyah] mengenai bawang merah, lalu ia menjawab, \"Sesungguhnya makanan terakhir yang dimakan Rasulullah shallallahu 'alaihi wasallam adalah makanan yang padanya terdapat bawang merah.\""
            },
            {
                "number": 3334,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ حَدَّثَنَا أَبِي عَنْ مُحَمَّدِ بْنِ أَبِي يَحْيَى عَنْ يَزِيدَ الْأَعْوَرِ عَنْ يُوسُفَ بْنِ عَبْدِ اللَّهِ بْنِ سَلَامٍ قَالَرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخَذَ كِسْرَةً مِنْ خُبْزِ شَعِيرٍ فَوَضَعَ عَلَيْهَا تَمْرَةً وَقَالَ هَذِهِ إِدَامُ هَذِهِ",
                "id": "Telah menceritakan kepada kami [Harun bin Abdullah] telah menceritakan kepada kami [Umar bin Hafsh] telah menceritakan kepada kami [Ayahku] dari [Muhammad bin Abu Yahya] dari [Yazid Al A'war] dari [Yusuf bin Abdullah bin Salam] ia berkata, \"Aku melihat Nabi shallallahu 'alaihi wasallam mengambil pecahan roti yang terbuat dari gandum lalu meletakkan kurma di atasnya, dan beliau bersabda: 'Kurma ini adalah lauk untuk roti ini.\""
            },
            {
                "number": 3335,
                "arab": "حَدَّثَنَا الْوَلِيدُ بْنُ عُتْبَةَ حَدَّثَنَا مَرْوَانُ بْنُ مُحَمَّدٍ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ حَدَّثَنِي هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْتٌ لَا تَمْرَ فِيهِ جِيَاعٌ أَهْلُهُ",
                "id": "Telah menceritakan kepada kami [Al Walid bin 'Utbah] telah menceritakan kepada kami [Marwan bin Muhammad] telah menceritakan kepada kami [Sulaiman bin Bilal] telah menceritakan kepadaku [Hisyam bin 'Urwah] dari [Ayahnya] dari [Aisyah] radliallahu 'anha, ia berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Rumah yang tidak ada kurma padanya maka penghuninya adalah orang-orang yang lapar.\""
            },
            {
                "number": 3336,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرِو بْنِ جَبَلَةَ حَدَّثَنَا سَلْمُ بْنُ قُتَيْبَةَ أَبُو قُتَيْبَةَ عَنْ هَمَّامٍ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَأُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِتَمْرٍ عَتِيقٍ فَجَعَلَ يُفَتِّشُهُ يُخْرِجُ السُّوسَ مِنْهُحَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا هَمَّامٌ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُؤْتَى بِالتَّمْرِ فِيهِ دُودٌ فَذَكَرَ مَعْنَاهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin 'Amru bin Jabalah] telah menceritakan kepada kami [Salm bin Qutaibah Abu Qutaibah] dari [Hammam] dari [Ishaq bin Abdullah bin Abu Thalhah] dari [Anas bin Malik] ia berkata, \"Nabi shallallahu 'alaihi wasallam diberi kurma 'Atiq, lalu beliau memeriksanya untuk mengeluarkan kutu darinya.\" Telah menceritakan kepada kami [Muhammad bin Katsir] telah mengabarkan kepada kami [Hammam] dari [Ishaq bin Abdullah bin Abu Thalhah] bahwa Nabi shallallahu 'alaihi wasallam pernah diberi kurma yang padanya terdapat ulat... lalu Abdullah bin Abu Thalhah menyebutkan makna hadits tersebut.\""
            },
            {
                "number": 3337,
                "arab": "حَدَّثَنَا وَاصِلُ بْنُ عَبْدِ الْأَعْلَى حَدَّثَنَا ابْنُ فُضَيْلٍ عَنْ أَبِي إِسْحَقَ عَنْ جَبَلَةَ بْنِ سُحَيْمٍ عَنْ ابْنِ عُمَرَ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْإِقْرَانِ إِلَّا أَنْ تَسْتَأْذِنَ أَصْحَابَكَ",
                "id": "Telah menceritakan kepada kami [Washil bin Abdul A'la] telah menceritakan kepada kami [Ibnu Fudlail] dari [Abu Ishaq] dari [Jabalah bin Suhaim] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam telah melarang dari iqran (makan kurma dua, dua) kecuali engkau meminta izin para sahabatmu (yang makan bersama).\""
            },
            {
                "number": 3338,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ النَّمَرِيُّ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْكُلُ الْقِثَّاءَ بِالرُّطَبِ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar An Namari] telah menceritakan kepada kami [Ibrahim bin Sa'd] dari [Ayahnya] dari [Abdullah bin Ja'far] bahwa Nabi shallallahu 'alaihi wasallam pernah makan mentimun dengan ruthab (kurma segar).\""
            },
            {
                "number": 3339,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ نُصَيْرٍ حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْكُلُ الْبِطِّيخَ بِالرُّطَبِ فَيَقُولُ نَكْسِرُ حَرَّ هَذَا بِبَرْدِ هَذَا وَبَرْدَ هَذَا بِحَرِّ هَذَا",
                "id": "Telah menceritakan kepada kami [Sa'id bin Nushair] telah menceritakan kepada kami [Abu Usamah] telah menceritakan kepada kami [Hisyam bin 'Urwah] dari [Ayahnya] dari [Aisyah] radliallahu 'anha, ia berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah makan labu dengan kurma segar. Kemudian beliau bersabda: \"Kita menghilangkan panas ini dengan dinginnya ini, dan dingin ini dengan panas ini.\""
            },
            {
                "number": 3340,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْوَزِيرِ حَدَّثَنَا الْوَلِيدُ بْنُ مَزْيَدَ قَالَ سَمِعْتُ ابْنَ جَابِرٍ قَالَ حَدَّثَنِي سُلَيْمُ بْنُ عَامِرٍ عَنْ ابْنَيْ بُسْرٍ السُّلَمِيَّيْنِ قَالَادَخَلَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَدَّمْنَا زُبْدًا وَتَمْرًا وَكَانَ يُحِبُّ الزُّبْدَ وَالتَّمْرَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Wazir] telah menceritakan kepada kami [Al Walid bin Mazyad] ia berkata; aku mendengar [Ibnu Jabir] berkata; telah menceritakan kepadaku [Sulaim bin 'Amir] dari [dua anak] [Busr As Sulami] mereka berkata, \"Rasulullah shallallahu 'alaihi wasallam menemui kami, lalu kami menghidangkan keju dan kurma, dan beliau menyukai keduanya.\""
            },
            {
                "number": 3341,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ الْأَعْلَى وَإِسْمَعِيلُ عَنْ بُرْدِ بْنِ سِنَانٍ عَنْ عَطَاءٍ عَنْ جَابِرٍ قَالَكُنَّا نَغْزُو مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنُصِيبُ مِنْ آنِيَةِ الْمُشْرِكِينَ وَأَسْقِيَتِهِمْ فَنَسْتَمْتِعُ بِهَا فَلَا يَعِيبُ ذَلِكَ عَلَيْهِمْ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Abdul A'la] dan [Isma'il] dari [Burd bin Sinan] dari ['Atha] dari [Jabir] ia berkata, \"Dahulu kami pernah berperang bersama Rasulullah shallallahu 'alaihi wasallam, lalu kami mendapatkan bejana orang-orang musyrik dan tempat minum mereka. Lalu kami menggunakannya dan beliau tidak mencela mereka.\""
            },
            {
                "number": 3342,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَاصِمٍ حَدَّثَنَا مُحَمَّدُ بْنُ شُعَيْبٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْعَلَاءِ بْنِ زَبْرٍ عَنْ أَبِي عُبَيْدِ اللَّهِ مُسْلِمِ بْنِ مِشْكَمٍ عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّأَنَّهُ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّا نُجَاوِرُ أَهْلَ الْكِتَابِ وَهُمْ يَطْبُخُونَ فِي قُدُورِهِمْ الْخِنْزِيرَ وَيَشْرَبُونَ فِي آنِيَتِهِمْ الْخَمْرَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنْ وَجَدْتُمْ غَيْرَهَا فَكُلُوا فِيهَا وَاشْرَبُوا وَإِنْ لَمْ تَجِدُوا غَيْرَهَا فَارْحَضُوهَا بِالْمَاءِ وَكُلُوا وَاشْرَبُوا",
                "id": "Telah menceritakan kepada kami [Nashr bin 'Ashim] telah menceritakan kepada kami [Muhammad bin Syu'aib] telah mengabarkan kepada kami [Abdullah bin Al 'Ala bin Zabr] dari [Abu 'Ubaidullah Muslim bin Misykam] dari [Abu Tsa'labah Al Khusyani] bahwa ia pernah bertanya kepada Rasulullah shallallahu 'alaihi wasallam, ia berkata, \"Sesungguhnya kami bertetangga dengan orang ahli kitab sementara mereka merebus babi di dalam kuali mereka dan minum khamr dalam bejana mereka?\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila kalian mendapatkan selainnya maka makan dan minumlah padanya, dan apabila kalian tidak mendapatkan selainnya maka cucilah menggunakan air dan makan serta minumlah!\""
            },
            {
                "number": 3343,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَبَعَثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَمَّرَ عَلَيْنَا أَبَا عُبَيْدَةَ بْنَ الْجَرَّاحِ نَتَلَقَّى عِيرًا لِقُرَيْشٍ وَزَوَّدَنَا جِرَابًا مِنْ تَمْرٍ لَمْ نَجِدْ لَهُ غَيْرَهُ فَكَانَ أَبُو عُبَيْدَةَ يُعْطِينَا تَمْرَةً تَمْرَةً كُنَّا نَمُصُّهَا كَمَا يَمُصُّ الصَّبِيُّ ثُمَّ نَشْرَبُ عَلَيْهَا مِنْ الْمَاءِ فَتَكْفِينَا يَوْمَنَا إِلَى اللَّيْلِ وَكُنَّا نَضْرِبُ بِعِصِيِّنَا الْخَبَطَ ثُمَّ نَبُلُّهُ بِالْمَاءِ فَنَأْكُلُهُ وَانْطَلَقْنَا عَلَى سَاحِلِ الْبَحْرِ فَرُفِعَ لَنَا كَهَيْئَةِ الْكَثِيبِ الضَّخْمِ فَأَتَيْنَاهُ فَإِذَا هُوَ دَابَّةٌ تُدْعَى الْعَنْبَرَ فَقَالَ أَبُو عُبَيْدَةَ مَيْتَةٌ وَلَا تَحِلُّ لَنَا ثُمَّ قَالَ لَا بَلْ نَحْنُ رُسُلُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَفِي سَبِيلِ اللَّهِ وَقَدْ اضْطُرِرْتُمْ إِلَيْهِ فَكُلُوا فَأَقَمْنَا عَلَيْهِ شَهْرًا وَنَحْنُ ثَلَاثُ مِائَةٍ حَتَّى سَمِنَّا فَلَمَّا قَدِمْنَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَكَرْنَا ذَلِكَ لَهُ فَقَالَ هُوَ رِزْقٌ أَخْرَجَهُ اللَّهُ لَكُمْ فَهَلْ مَعَكُمْ مِنْ لَحْمِهِ شَيْءٌ فَتُطْعِمُونَا مِنْهُ فَأَرْسَلْنَا مِنْهُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَكَلَ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Abu Az Zubair] dari [Jabir] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam mengutus kami dan menjadikan Abu 'Ubaidah bin Al Jarrah sebagai pemimpin untuk menghadang rombongan pedagang Quraisy, beliau membekali kami dengan sekantung kurma yang kami tidak mengetahui beliau mempuyai kurma selain itu. Abu Ubaidah lalu membagikan kepada kami setiap satu butir untuk satu orang, dan kami hanya mengulum kurma tersebut sebagaimana seorang bayi mengulum. Kemudian kami minum air yang ada padanya, maka kurma tersebut cukup bagi kami pada hari itu hingga malam hari. Dan kami menggugurkan daun menggunakan tongkat kami, lalu kami membasahinya menggunakan air dan memakannya. Kami pergi ke tepi laut, kemudian kami mendapati sesuatu yang bentuknya seperti gundukan pasir yang besar. Kemudian kami mendatanginya, ternyata benda tersebut adalah hewan yang disebut paus. Abu 'Ubaidah berkata, \"Itu adalah bangkai, tidak halal bagi kita!\" Kemudian ia berkata, \"Tidak, melainkan kita adalah para utusan Rasulullah shallallahu 'alaihi wasallam, dan berada di jalan Allah. Kalian dalam keadaan terdesak untuk memakannya, maka makanlah!\" Kami kemudian memakannya selama satu bulan sedangkan jumlah kami adalah tiga ratus orang, hingga kami menjadi gemuk. Kemudian tatkala kami sampai kepada Rasulullah shallallahu 'alaihi wasallam, maka hal tersebut kami ceritakan kepada beliau. Beliau lalu bersabda: \"Itu adalah rizki yang telah Allah keluarkan untuk kalian. Apakah kalian membawa sebagian dagingnya, hingga kalian berikan kepada kami?\" Kemudian kami mengirimkan sebagiannya kepada Rasulullah shallallahu 'alaihi wasallam, dan beliau pun menerimanya.\""
            },
            {
                "number": 3344,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا سُفْيَانُ حَدَّثَنَا الزُّهْرِيُّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ عَنْ مَيْمُونَةَأَنَّ فَأْرَةً وَقَعَتْ فِي سَمْنٍ فَأُخْبِرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَلْقُوا مَا حَوْلَهَا وَكُلُوا",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami [Az Zuhri] dari ['Ubaidillah bin Abdullah] dari [Ibnu Abbas] dari [Maimunah] bahwa ada seekor tikus yang jatuh ke dalam mentega, lalu aku beritahukan kepada Nabi shallallahu 'alaihi wasallam. Kemudian beliau bersabda: \"Buanglah sekitarnya dan makanlah!\""
            },
            {
                "number": 3345,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ وَالْحَسَنُ بْنُ عَلِيٍّ وَاللَّفْظُ لِلْحَسَنِ قَالَا حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا وَقَعَتْ الْفَأْرَةُ فِي السَّمْنِ فَإِنْ كَانَ جَامِدًا فَأَلْقُوهَا وَمَا حَوْلَهَا وَإِنْ كَانَ مَائِعًا فَلَا تَقْرَبُوهُقَالَ الْحَسَنُ قَالَ عَبْدُ الرَّزَّاقِ وَرُبَّمَا حَدَّثَ بِهِ مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ عَنْ مَيْمُونَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ بُوذَوَيْهِ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ عَنْ مَيْمُونَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ الزُّهْرِيِّ عَنْ ابْنِ الْمُسَيِّبِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] dan [Al Hasan bin Ali] lafazh hadits ini adalah lafazh Al Hasan, mereka berkata; telah menceritakan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Sa'id bin Al Musayyab] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika ada tikus jatuh ke dalam mentega, jika mentega tersebut beku maka buanglah tikus tersebut dan yang ada di sekitarnya, namun jika mentega tersebut cair maka jangan engkau dekati (ambil).\" [Al Hasan] berkata, \" [Abdurrazzaq] berkata, \"Terkadang [Ma'mar] meriwayatkan hadits tersebut dari [Az Zuhri] dari ['Ubaidullah bin Abdullah] dari [Ibnu Abbas] dari [Maimunah] dari Nabi shallallahu 'alaihi wasallam.\" Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Abdurrahman bin Budzawaih] dari [Ma'mar] dari [Az Zuhri] dari ['Ubaidullah bin Abdullah] dari [Ibnu Abbas] dari [Maimunah] dari Nabi shallallahu 'alaihi wasallam dengan hadits seperti hadits Az Zuhri, dari Ibnu Al Musayyab.\""
            },
            {
                "number": 3346,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا بِشْرٌ يَعْنِي ابْنَ الْمُفَضَّلِ عَنْ ابْنِ عَجْلَانَ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا وَقَعَ الذُّبَابُ فِي إِنَاءِ أَحَدِكُمْ فَامْقُلُوهُ فَإِنَّ فِي أَحَدِ جَنَاحَيْهِ دَاءً وَفِي الْآخَرِ شِفَاءً وَإِنَّهُ يَتَّقِي بِجَنَاحِهِ الَّذِي فِيهِ الدَّاءُ فَلْيَغْمِسْهُ كُلُّهُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Bisyr bin Al Mufadldlal] dari [Ibnu 'Ajlan] dari [Sa'id Al Maqburi] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika ada lalat jatuh ke dalam bejana salah seorang dari kalian maka celupkanlah lalat tersebut, karena sesungguhnya di dalam salah satu sayapnya terdapat penyakit dan pada sayap yang lain terdapat obat. Sesungguhnya lalat tersebut melindungi diri dengan sayap yang padanya terdapat penyakit, maka celupkanlah semuannya!\""
            },
            {
                "number": 3347,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ ثَابِتٍ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَكَلَ طَعَامًا لَعِقَ أَصَابِعَهُ الثَّلَاثَ وَقَالَ إِذَا سَقَطَتْ لُقْمَةُ أَحَدِكُمْ فَلْيُمِطْ عَنْهَا الْأَذَى وَلْيَأْكُلْهَا وَلَا يَدَعْهَا لِلشَّيْطَانِ وَأَمَرَنَا أَنْ نَسْلُتَ الصَّحْفَةَ وَقَالَ إِنَّ أَحَدَكُمْ لَا يَدْرِي فِي أَيِّ طَعَامِهِ يُبَارَكُ لَهُ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] dari [Tsabit] dari [Anas bin Malik] bahwa Rasulullah shallallahu 'alaihi wasallam jika makan makanan, beliau menjilat jari-jarinya sebanyak tiga kali, beliau bersabda: \"Jika suapan salah seorang dari kalian jatuh, maka hendaknya ia membersihkannya dari kotoran dan memakannya, dan janganlah ia membiarkannya untuk setan!\" Dan beliau memerintahkan kami agar mengusap piring. Beliau bersabda: \"Sesungguhnya tidak seorangpun di antara kalian mengetahui dibagian makanan makanakah ia diberi berkah.\""
            },
            {
                "number": 3348,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ حَدَّثَنَا دَاوُدُ بْنُ قَيْسٍ عَنْ مُوسَى بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَنَعَ لِأَحَدِكُمْ خَادِمُهُ طَعَامًا ثُمَّ جَاءَهُ بِهِ وَقَدْ وَلِيَ حَرَّهُ وَدُخَانَهُ فَلْيُقْعِدْهُ مَعَهُ لِيَأْكُلَ فَإِنْ كَانَ الطَّعَامُ مَشْفُوهًا فَلْيَضَعْ فِي يَدِهِ مِنْهُ أَكْلَةً أَوْ أَكْلَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] telah menceritakan kepada kami [Daud bin Qais] dari [Musa bin Yasar] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila pembantu salah seorang di antara kalian membuatkan makanan untuknya kemudian ia datang membawa makanan tersebut kepadanya, sementara pembantu tersebut telah merasakan panas dan terkena asapnya maka hendaknya ia memintanya agar duduk untuk makan bersamanya. Apabila makakan tersebut sedikit maka hendaknya ia meletakkan di tangannya satu atau dua suap.\""
            },
            {
                "number": 3349,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ ابْنِ جُرَيْجٍ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَكَلَ أَحَدُكُمْ فَلَا يَمْسَحَنَّ يَدَهُ بِالْمِنْدِيلِ حَتَّى يَلْعَقَهَا أَوْ يُلْعِقَهَا",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Ibnu Juraij] dari ['Atha] dari [Ibnu Abbas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorangii kalian makan, maka janganlah ia usap tangannya menggunakan sapu tangan hingga ia menjilatnya atau menjilatkannya!\""
            },
            {
                "number": 3350,
                "arab": "حَدَّثَنَا النُّفَيْلِيُّ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَعْدٍ عَنْ ابْنِ كَعْبِ بْنِ مَالِكٍ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْكُلُ بِثَلَاثِ أَصَابِعَ وَلَا يَمْسَحُ يَدَهُ حَتَّى يَلْعَقَهَا",
                "id": "Telah menceritakan kepada kami [An Nufaili] telah menceritakan kepada kami [Abu Mu'awiyah] dari [Hisyam bin 'Urwah] dari [Abdurrahman bin Sa'dan] dari [Ibnu Ka'b bin Malik] dari [Ayahnya] bahwa Nabi shallallahu 'alaihi wasallam makan menggunakan tiga jari, dan tidak mengusap tangannya hingga beliau menjilatnya.\""
            },
            {
                "number": 3351,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ ثَوْرٍ عَنْ خَالِدِ بَنِ مَعْدَانَ عَنْ أَبِي أُمَامَةَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا رُفِعَتْ الْمَائِدَةُ قَالَ الْحَمْدُ لِلَّهِ حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ غَيْرَ مَكْفِيٍّ وَلَا مُوَدَّعٍ وَلَا مُسْتَغْنًى عَنْهُ رَبُّنَا",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Tsaur] dari [Khalid bin Ma'dan] dari [Abu Umamah] ia berkata, \"Jika selesai makan Rasulullah shallallahu 'alaihi wasallam membaca doa: 'ALHAMDULILLAAHI HAMDAN KATSIIRAN THAYYIBAN MUBAARAKAN FIIHI GHAIRA MAKFIYYIN WA LAA MUWADDA'IN WA LAA MUSTAGHNAN 'ANHU RABBUNAA (Segala puji bagi Allah, dengan pujian yang banyak, baik dan mendapatkan berkah padanya tidak cukup hanya itu, dan tidak terputus, serta senantiasa butuh kepadanya, wahai Tuhan kami) '.\""
            },
            {
                "number": 3352,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ أَبِي هَاشِمٍ الْوَاسِطِيِّ عَنْ إِسْمَعِيلَ بْنِ رَبَاحٍ عَنْ أَبِيهِ أَوْ غَيْرِهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا فَرَغَ مِنْ طَعَامِهِ قَالَ الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا وَجَعَلَنَا مُسْلِمِينَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala] telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Abu Hasyim Al Wasithi] dari [Isma'il bin Rabah] dari [Ayahnya atau selainnya] dari [Abu Sa'id Al Khudri] bahwa Nabi shallallahu 'alaihi wasallam jika selesai makan beliau mengucapkan: 'Al HAMDULILLAAHILLADZII ATH'AMANAA WA SAQAANAA WA JA'ALANAA MUSLIMIIN (Segala puji bagi Allah Yang telah memberi makan serta minum kami dan menjadikan kami orang-orang muslim) '.\""
            },
            {
                "number": 3353,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي سَعِيدُ بْنُ أَبِي أَيُّوبَ عَنْ أَبِي عَقِيلٍ الْقُرَشِيِّ عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْحُبُلِيِّ عَنْ أَبِي أَيُّوبَ الْأَنْصَارِيِّ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَكَلَ أَوْ شَرِبَ قَالَ الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَ وَسَقَى وَسَوَّغَهُ وَجَعَلَ لَهُ مَخْرَجًا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Sa'id bin Abu Ayyub] dari [Abu 'Aqil Al Qurasyi] dari [Abu Abdurrahman Al Hubuli] dari [Abu Ayyub Al Anshari] ia berkata, \"Jika Rasulullah shallallahu 'alaihi wasallam selesai dari makan atau minum, beliau mengucapkan: 'Al HAMDULILLAAHILLADZII ATH'AMA WA SAQAA WA SAWWAGHAHU WA JA'ALA LAHU MAKHRAJAN (Segala puji bagi Allah Yang telah memberi makan dan minum, memudahkan saat menelan dan menjadikan baginya tempat keluar) '.\""
            },
            {
                "number": 3354,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا سُهَيْلُ بْنُ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ نَامَ وَفِي يَدِهِ غَمَرٌ وَلَمْ يَغْسِلْهُ فَأَصَابَهُ شَيْءٌ فَلَا يَلُومَنَّ إِلَّا نَفْسَهُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Suhail bin Abu Shalih] dari [Ayahnya] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa tidur dan di tangannya terdapat lemak daging yang belum ia bersihkan kemudian mengenai sesuatu, maka janganlah ia mencela kecuali kepada dirinya sendiri!\""
            },
            {
                "number": 3355,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو أَحْمَدَ حَدَّثَنَا سُفْيَانُ عَنْ يَزِيدَ أَبِي خَالِدٍ الدَّالَانِيِّ عَنْ رَجُلٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَصَنَعَ أَبُو الْهَيْثَمِ بْنُ التَّيْهَانِ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَعَامًا فَدَعَا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابَهُ فَلَمَّا فَرَغُوا قَالَ أَثِيبُوا أَخَاكُمْ قَالُوا يَا رَسُولَ اللَّهِ وَمَا إِثَابَتُهُ قَالَ إِنَّ الرَّجُلَ إِذَا دُخِلَ بَيْتُهُ فَأُكِلَ طَعَامُهُ وَشُرِبَ شَرَابُهُ فَدَعَوْا لَهُ فَذَلِكَ إِثَابَتُهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Abu Ahmad] telah menceritakan kepada kami [Sufyan] dari [Yazid Abu Khalid Abu Daud Dalani] dari [seorang laki-laki] dari [Jabir bin Abdullah] ia berkata, \"Abu Al Haitsam bin At Taihan membuatkan makanan untuk Nabi shallallahu 'alaihi wasallam, kemudian ia mengundang Nabi shallallahu 'alaihi wasallam dan para sahabatnya. Ketika telah selesai beliau bersabda: \"Balaslah saudaramu!\" Para sahabat bertanya, \"Wahai Rasulullah, bagaimana membalasnya?\" Beliau menjawab: \"Sesungguhnya seseorang apabila dimasuki rumahnya kemudian dimakan makanannya serta diminum minumannya lalu mereka mendoakan untuknya, maka itulah balasan kepadanya.\""
            },
            {
                "number": 3356,
                "arab": "حَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ ثَابِتٍ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَاءَ إِلَى سَعْدِ بْنِ عُبَادَةَ فَجَاءَ بِخُبْزٍ وَزَيْتٍ فَأَكَلَ ثُمَّ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفْطَرَ عِنْدَكُمْ الصَّائِمُونَ وَأَكَلَ طَعَامَكُمْ الْأَبْرَارُ وَصَلَّتْ عَلَيْكُمْ الْمَلَائِكَةُ",
                "id": "Telah menceritakan kepada kami [Makhlad bin Khalid] telah menceritakan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Ma'mar] dari [Tsabit] dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam datang kepada Sa'd bin 'Ubadah, lalu Sa'd menyuguhkan roti dan minyak samin. Nabi shallallahu 'alaihi wasallam kemudian memakannya, setelah itu beliau bersabda: \"Telah berbuka di rumahmu orang-orang yang berpuasa, dan telah makan makananmu orang-orang yang baik, dan bershalawat kepadamu para Malaikat.\""
            }
  ]
}